#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.UpdateText
	 */
	struct UActiveEffectEntryWidget_C_UpdateText_Params
	{	};

	/**
	 * Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.Setup
	 */
	struct UActiveEffectEntryWidget_C_Setup_Params
	{
	public:
		class FName                                                EffectId;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      UntilServerTime;                                         // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      DisplayValue;                                            // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.PreConstruct
	 */
	struct UActiveEffectEntryWidget_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.Tick
	 */
	struct UActiveEffectEntryWidget_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.ExecuteUbergraph_ActiveEffectEntryWidget
	 */
	struct UActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
