#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Reset
	 */
	struct UAddFriendWidget_C_Reset_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.OnFocusReceived
	 */
	struct UAddFriendWidget_C_OnFocusReceived_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FFocusEvent                                         InFocusEvent;                                            // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
		struct FEventReply                                         ReturnValue;                                             // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Refresh
	 */
	struct UAddFriendWidget_C_Refresh_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Finished_ADCAA9EE48D9ECCB3494DC85E0915EEF
	 */
	struct UAddFriendWidget_C_Finished_ADCAA9EE48D9ECCB3494DC85E0915EEF_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Event_Refresh
	 */
	struct UAddFriendWidget_C_Event_Refresh_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature
	 */
	struct UAddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		ETextCommit                                                CommitMethod;                                            // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature
	 */
	struct UAddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.BndEvt__AddFriendMenu_ViewProfileButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature
	 */
	struct UAddFriendWidget_C_BndEvt__AddFriendMenu_ViewProfileButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.BndEvt__AddFriendMenu_SendFriendRequestButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
	 */
	struct UAddFriendWidget_C_BndEvt__AddFriendMenu_SendFriendRequestButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.BndEvt__AddFriendMenu_CopyFriendCodeButton_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature
	 */
	struct UAddFriendWidget_C_BndEvt__AddFriendMenu_CopyFriendCodeButton_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.BndEvt__AddFriendWidget_SearchButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UAddFriendWidget_C_BndEvt__AddFriendWidget_SearchButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Event_Init
	 */
	struct UAddFriendWidget_C_Event_Init_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Event_ResolveCompleted
	 */
	struct UAddFriendWidget_C_Event_ResolveCompleted_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Event_Done
	 */
	struct UAddFriendWidget_C_Event_Done_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Event_OnError
	 */
	struct UAddFriendWidget_C_Event_OnError_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.Construct
	 */
	struct UAddFriendWidget_C_Construct_Params
	{	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.ExecuteUbergraph_AddFriendWidget
	 */
	struct UAddFriendWidget_C_ExecuteUbergraph_AddFriendWidget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AddFriendWidget.AddFriendWidget_C.OnBackRequested__DelegateSignature
	 */
	struct UAddFriendWidget_C_OnBackRequested__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
