#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.SetPressed
	 */
	struct ABase_SinglePressButton_BP_C_SetPressed_Params
	{
	public:
		bool                                                       Pressed;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.OnRep_IsPressed
	 */
	struct ABase_SinglePressButton_BP_C_OnRep_IsPressed_Params
	{	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature
	 */
	struct ABase_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature_Params
	{
	public:
		class ARBPawn*                                             interactor;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class URBInteractibleComponent*                            Component;                                               // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature
	 */
	struct ABase_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature_Params
	{
	public:
		class ARBPawn*                                             interactor;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class URBInteractibleComponent*                            Component;                                               // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.Event_OnResetStage
	 */
	struct ABase_SinglePressButton_BP_C_Event_OnResetStage_Params
	{	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.ApplyColorDelayed
	 */
	struct ABase_SinglePressButton_BP_C_ApplyColorDelayed_Params
	{	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.DoButtonPressActions
	 */
	struct ABase_SinglePressButton_BP_C_DoButtonPressActions_Params
	{	};

	/**
	 * Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.ExecuteUbergraph_Base_SinglePressButton_BP
	 */
	struct ABase_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
