#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct BodyOutfitStruct.BodyOutfitStruct
	 * Size -> 0x00C0
	 */
	struct FBodyOutfitStruct
	{
	public:
		struct FBodyOutfitElement                                  Head_17_D154F14C49AA351452DB0CABA3BBD3C8;                // 0x0000(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Hair_18_BF8AF65448ED4CA388AD7795B22701A1;                // 0x0018(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  UpperBody_19_FFA026DB466D73A9D323A3B7CDCDE4CE;           // 0x0030(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Arms_R_20_D328B461474B8EED8C78C2B9F9237CAC;              // 0x0048(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Arms_L_21_A40927AC472C3764E7442D8F5BE1B0CF;              // 0x0060(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  LowerBody_22_3E80130D454B7651875892A05EAE3410;           // 0x0078(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Legs_R_23_BFF65491423F53D598B42AA70C6E1B04;              // 0x0090(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Legs_L_24_AEFC75CE428ED77759DAD39BF2A2DEEC;              // 0x00A8(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
