#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.RefreshSliders
	 */
	struct UBrightnessCalibrationMenu_C_RefreshSliders_Params
	{	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.Construct
	 */
	struct UBrightnessCalibrationMenu_C_Construct_Params
	{	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	 */
	struct UBrightnessCalibrationMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
	{
	public:
		class URBMenuButton_C*                                     Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.Event_OnPush
	 */
	struct UBrightnessCalibrationMenu_C_Event_OnPush_Params
	{	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.Event_OnPop
	 */
	struct UBrightnessCalibrationMenu_C_Event_OnPop_Params
	{	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.BndEvt__BrightnessCalibrationMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	 */
	struct UBrightnessCalibrationMenu_C_BndEvt__BrightnessCalibrationMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
	{
	public:
		class URBMenuButton_C*                                     Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.Event_SetToDefaults
	 */
	struct UBrightnessCalibrationMenu_C_Event_SetToDefaults_Params
	{	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.BndEvt__BrightnessCalibrationMenu_HDRPaperwhiteEntry_K2Node_ComponentBoundEvent_4_OnOptionValueChanged__DelegateSignature
	 */
	struct UBrightnessCalibrationMenu_C_BndEvt__BrightnessCalibrationMenu_HDRPaperwhiteEntry_K2Node_ComponentBoundEvent_4_OnOptionValueChanged__DelegateSignature_Params
	{
	public:
		class URBMenuOptionsEntry*                                 OptionEntry;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.BndEvt__BrightnessCalibrationMenu_HDRUserInterfaceEntry_K2Node_ComponentBoundEvent_6_OnOptionValueChanged__DelegateSignature
	 */
	struct UBrightnessCalibrationMenu_C_BndEvt__BrightnessCalibrationMenu_HDRUserInterfaceEntry_K2Node_ComponentBoundEvent_6_OnOptionValueChanged__DelegateSignature_Params
	{
	public:
		class URBMenuOptionsEntry*                                 OptionEntry;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.BndEvt__BrightnessCalibrationMenu_BrightnessEntry_K2Node_ComponentBoundEvent_7_OnOptionValueChanged__DelegateSignature
	 */
	struct UBrightnessCalibrationMenu_C_BndEvt__BrightnessCalibrationMenu_BrightnessEntry_K2Node_ComponentBoundEvent_7_OnOptionValueChanged__DelegateSignature_Params
	{
	public:
		class URBMenuOptionsEntry*                                 OptionEntry;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BrightnessCalibrationMenu.BrightnessCalibrationMenu_C.ExecuteUbergraph_BrightnessCalibrationMenu
	 */
	struct UBrightnessCalibrationMenu_C_ExecuteUbergraph_BrightnessCalibrationMenu_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_M3PA[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
