#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.AnimGraph
	 */
	struct UChessSpectator_AnimBP_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.FinishGhost
	 */
	struct UChessSpectator_AnimBP_C_FinishGhost_Params
	{
	public:
		EGhostFinishReason                                         finishReason;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_R4XL[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    GhostFinishCustomReason;                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ChessSpectator_AnimBP_AnimGraphNode_TransitionResult_EF9EFD0E44872E9C83DF399F9A558EE8
	 */
	struct UChessSpectator_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ChessSpectator_AnimBP_AnimGraphNode_TransitionResult_EF9EFD0E44872E9C83DF399F9A558EE8_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ChessSpectator_AnimBP_AnimGraphNode_TransitionResult_037C8ADC4AEEBADC4E22AF936A899D02
	 */
	struct UChessSpectator_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ChessSpectator_AnimBP_AnimGraphNode_TransitionResult_037C8ADC4AEEBADC4E22AF936A899D02_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ChessSpectator_AnimBP_AnimGraphNode_TransitionResult_C3D093CA4976A71660805899C315CBFD
	 */
	struct UChessSpectator_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ChessSpectator_AnimBP_AnimGraphNode_TransitionResult_C3D093CA4976A71660805899C315CBFD_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.AnimNotify_Exit
	 */
	struct UChessSpectator_AnimBP_C_AnimNotify_Exit_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.AnimNotify_Emote
	 */
	struct UChessSpectator_AnimBP_C_AnimNotify_Emote_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.AnimNotify_EnteredPounding
	 */
	struct UChessSpectator_AnimBP_C_AnimNotify_EnteredPounding_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.BP_InitializeGhost
	 */
	struct UChessSpectator_AnimBP_C_BP_InitializeGhost_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.AnimNotify_Enter
	 */
	struct UChessSpectator_AnimBP_C_AnimNotify_Enter_Params
	{	};

	/**
	 * Function ChessSpectator_AnimBP.ChessSpectator_AnimBP_C.ExecuteUbergraph_ChessSpectator_AnimBP
	 */
	struct UChessSpectator_AnimBP_C_ExecuteUbergraph_ChessSpectator_AnimBP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
