#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.ResetFlapPositionAndMaterials
	 */
	struct AFlipNumberSingleDigit__BP_C_ResetFlapPositionAndMaterials_Params
	{
	public:
		int32_t                                                    inInt;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.SetNewPlayRate
	 */
	struct AFlipNumberSingleDigit__BP_C_SetNewPlayRate_Params
	{
	public:
		float                                                      NewPlayRate;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.SetNewInt
	 */
	struct AFlipNumberSingleDigit__BP_C_SetNewInt_Params
	{
	public:
		int32_t                                                    newDigit;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.ApplyIntMaterials
	 */
	struct AFlipNumberSingleDigit__BP_C_ApplyIntMaterials_Params
	{
	public:
		int32_t                                                    inInt;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.FlipToInt
	 */
	struct AFlipNumberSingleDigit__BP_C_FlipToInt_Params
	{
	public:
		int32_t                                                    Int;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.FlipNumbers
	 */
	struct AFlipNumberSingleDigit__BP_C_FlipNumbers_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.Flip_Timeline__FinishedFunc
	 */
	struct AFlipNumberSingleDigit__BP_C_Flip_Timeline__FinishedFunc_Params
	{	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.Flip_Timeline__UpdateFunc
	 */
	struct AFlipNumberSingleDigit__BP_C_Flip_Timeline__UpdateFunc_Params
	{	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.Flip
	 */
	struct AFlipNumberSingleDigit__BP_C_Flip_Params
	{
	public:
		int32_t                                                    CurrentDigit;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.ReceiveTick
	 */
	struct AFlipNumberSingleDigit__BP_C_ReceiveTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function FlipNumberSingleDigit-01_BP.FlipNumberSingleDigit-01_BP_C.ExecuteUbergraph_FlipNumberSingleDigit-01_BP
	 */
	struct AFlipNumberSingleDigit__BP_C_ExecuteUbergraph_FlipNumberSingleDigit__BP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
