#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct LobbyReagent_BodyStruct.LobbyReagent_BodyStruct
	 * Size -> 0x00C0
	 */
	struct FLobbyReagent_BodyStruct
	{
	public:
		struct FBodyOutfitElement                                  Head_17_D154F14C49AA351452DB0CABA3BBD3C8;                // 0x0000(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Hair_18_BF8AF65448ED4CA388AD7795B22701A1;                // 0x0018(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Upper_27_FFA026DB466D73A9D323A3B7CDCDE4CE;               // 0x0030(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Arms_26_A40927AC472C3764E7442D8F5BE1B0CF;                // 0x0048(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Lower_28_3E80130D454B7651875892A05EAE3410;               // 0x0060(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Legs_25_BFF65491423F53D598B42AA70C6E1B04;                // 0x0078(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  NVGoggles_31_03F00A884CED6CF9646770B6DF7C548E;           // 0x0090(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
		struct FBodyOutfitElement                                  Arm_L_35_34B6E0F141143DC2E539638FED6F9F0C;               // 0x00A8(0x0018) Edit, BlueprintVisible, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
