#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum OPP.EAIEvent
	 */
	enum class EAIEvent : uint8_t
	{
		Undefined                           = 0,
		ReactToSoundDisturbanceAware        = 1,
		ReactToSoundDisturbanceUnaware      = 2,
		ReactToVisualDisturbanceAware       = 3,
		ReactToVisualDisturbanceUnaware     = 4,
		ReactToMajorDisturbance             = 5,
		ReactToSensingDisturbance           = 6,
		InvestigateDisturbanceAware         = 7,
		InvestigateDisturbanceUnaware       = 8,
		InvestigatePoint                    = 9,
		ReachedInvestigationPoint           = 10,
		FinishedInvestigatingPoint          = 11,
		InvestigationGiveUp                 = 12,
		AlertedGiveUp                       = 13,
		SuspiciousGiveUp                    = 14,
		SawPlayerEnterHidingSpot            = 15,
		FoundHiddenPlayer                   = 16,
		SearchForOtherPlayersAfterKnockDown = 17,
		PullOutFromHidespot                 = 18,
		ReactToPlayerBeforeChase            = 19,
		ReactToMultiplePlayersBeforeChase   = 20,
		StartChaseAfterReaction             = 21,
		StartChaseNoReaction                = 22,
		StartMoveToIncapacitatedPlayer      = 23,
		ChaseReachedLeashLimit              = 24,
		ChaseStartGiveUp                    = 25,
		ChaseGiveUp                         = 26,
		ChaseStartYielding                  = 27,
		ChaseYield                          = 28,
		ChaseChangedTarget                  = 29,
		ChaseTaunt                          = 30,
		LostSightOfPlayer                   = 31,
		StartMoveToLostSight                = 32,
		ReachedLastKnownPosition            = 33,
		UnawarePlayerProximity              = 34,
		ChasePlayerProximity                = 35,
		ReachedPatrolWaypoint               = 36,
		PassUnderDynamicObstacle            = 37,
		EnterDarknessZone                   = 38,
		EnterLightZone                      = 39,
		AttackPlayer                        = 40,
		GuardingAttack                      = 41,
		PushPlayer                          = 42,
		ImposterCharge                      = 43,
		PusherAttack                        = 44,
		PairedAttackConnecting              = 45,
		KnockedDownPlayer                   = 46,
		StartFinishingIncapacitatedPlayer   = 47,
		FinishIncapacitatedPlayer           = 48,
		DealtDamage                         = 49,
		KilledPlayer                        = 50,
		AttackOtherNPC                      = 51,
		AttackedByOtherNPC                  = 52,
		ThrowProjectile                     = 53,
		ThrownProjectileHit                 = 54,
		ThrownProjectileMiss                = 55,
		TakeDamage                          = 56,
		HitByProjectile                     = 57,
		PairedAttackInterrupted             = 58,
		HitReaction_Low                     = 59,
		HitReaction_Med                     = 60,
		HitReaction_High                    = 61,
		DelayedHitReaction                  = 62,
		ShovedByPlayerAware                 = 63,
		ShovedByPlayerUnaware               = 64,
		ShovePunish                         = 65,
		KnockedOut                          = 66,
		GetUpFromKnockOut                   = 67,
		Killed                              = 68,
		ProvocationWarning                  = 69,
		ProvokedByPlayer                    = 70,
		ReactToImperativeDisturbance        = 71,
		TurnOffImperativeDisturbance        = 72,
		SignalTackle                        = 73,
		FailedTackle                        = 74,
		SuccessfulTackle                    = 75,
		FinishedGroundAndPound              = 76,
		PlayerAvoidanceStart                = 77,
		PlayerAvoidanceRepath               = 78,
		AcknowledgePlayer                   = 79,
		AcknowledgeOtherNPC                 = 80,
		ZoneDefenseBecomeAlert              = 81,
		ZoneDefenseBlown                    = 82,
		ReactToCloseGrenade                 = 83,
		AffectedByStunGrenade               = 84,
		RecoverFromStunGrenade              = 85,
		AffectedByBlindPaint                = 86,
		AffectedByHealSlowdown              = 87,
		SleeperDisturbed                    = 88,
		SleeperScream                       = 89,
		StartRetirement                     = 90,
		MAX                                 = 91
	};

	/**
	 * Enum OPP.EScheduledPropertyValueChangedType
	 */
	enum class EScheduledPropertyValueChangedType : uint8_t
	{
		LocallySet          = 0,
		DesiredTimeReached  = 1,
		FailsafeTimeReached = 2,
		OnRepExpired        = 3,
		MAX                 = 4
	};

	/**
	 * Enum OPP.ENPCWeapon
	 */
	enum class ENPCWeapon : uint8_t
	{
		None            = 0,
		Knife           = 1,
		Machete         = 2,
		Axe             = 3,
		Bottle          = 4,
		Shotgun         = 5,
		SledgeHammer    = 6,
		Pipe            = 7,
		WoodPlank       = 8,
		MolotovCocktail = 9,
		CattleProd      = 10,
		DoubleClaw      = 11,
		MAX             = 12
	};

	/**
	 * Enum OPP.EDamageSoundMaterial
	 */
	enum class EDamageSoundMaterial : uint8_t
	{
		None              = 0,
		Unarmed           = 1,
		Berzerker         = 2,
		Blade_Large       = 3,
		Blade_Small       = 4,
		Blunt_DenseMetal  = 5,
		Blunt_HollowMetal = 6,
		Blunt_Wood        = 7,
		Blunt_Electric    = 8,
		Electric          = 9,
		Fire              = 10,
		Brick             = 11,
		PsychosisEntity   = 12,
		Grinder           = 13,
		Glass             = 14,
		Acid              = 15,
		MAX               = 16
	};

	/**
	 * Enum OPP.EHurtVOType
	 */
	enum class EHurtVOType : uint8_t
	{
		None                 = 0,
		GenericLow           = 1,
		GenericMedium        = 2,
		GenericHigh          = 3,
		LandLow              = 4,
		LandHigh             = 5,
		Fire                 = 6,
		Electricity          = 7,
		Shock                = 8,
		HurtContinuousMedium = 9,
		Acid                 = 10,
		MAX                  = 11
	};

	/**
	 * Enum OPP.EDamageType
	 */
	enum class EDamageType : uint8_t
	{
		NoDamage                = 0,
		Generic                 = 1,
		GenericNonFatal         = 2,
		Temporary               = 3,
		UnarmedRightHandStrike  = 4,
		UnarmedLeftHandStrike   = 5,
		UnarmedHeadStrike       = 6,
		UnarmedLeftFootStrike   = 7,
		UnarmedRightFootStrike  = 8,
		UnarmedOtherStrike      = 9,
		WeaponStrike            = 10,
		Throwable               = 11,
		Animated                = 12,
		AnimatedDangerous       = 13,
		ForceKill               = 14,
		Electric                = 15,
		Fire                    = 16,
		MolotovFire             = 17,
		Falling                 = 18,
		Trap                    = 19,
		SpectreProximity        = 20,
		EndOfStage              = 21,
		HackPanelFail           = 22,
		CoopTrap                = 23,
		PlayerDamageLeash       = 24,
		RunningProhibitedDamage = 25,
		Grinder                 = 26,
		AcidBottleSpill         = 27,
		StepOnGlass             = 28,
		FailedPuzzleRoom        = 29,
		Custom                  = 30,
		MAX                     = 31
	};

	/**
	 * Enum OPP.EHallucinationType
	 */
	enum class EHallucinationType : uint8_t
	{
		None            = 0,
		AlteredControls = 1,
		JumpScare       = 2,
		RandomSound     = 3,
		LSDEffect       = 4,
		Dizzyness       = 5,
		Psychosis       = 6,
		MAX             = 7
	};

	/**
	 * Enum OPP.EDoorActionType
	 */
	enum class EDoorActionType : uint8_t
	{
		Open               = 0,
		QuickOpen          = 1,
		Close              = 2,
		Lock               = 3,
		Unlock             = 4,
		Unhinge            = 5,
		Unhinge_Done       = 6,
		AttachDoorRotation = 7,
		ReleaseDoor        = 8,
		MAX                = 9
	};

	/**
	 * Enum OPP.EArmWreslingPanelInputFailType
	 */
	enum class EArmWreslingPanelInputFailType : uint8_t
	{
		Failed  = 0,
		Success = 1,
		NoInput = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.EObjectiveCoordinatorState
	 */
	enum class EObjectiveCoordinatorState : uint8_t
	{
		Invalid         = 0,
		Disabled        = 1,
		WaitingForStart = 2,
		Started         = 3,
		Stopped         = 4,
		Failed          = 5,
		Completed       = 6,
		MAX             = 7
	};

	/**
	 * Enum OPP.EPlayerLeaveTarget
	 */
	enum class EPlayerLeaveTarget : uint8_t
	{
		None             = 0,
		MainMenu         = 1,
		Lobby            = 2,
		Party            = 3,
		Experiment       = 4,
		Desktop          = 5,
		Tutorial         = 6,
		PartyGameSession = 7,
		MAX              = 8
	};

	/**
	 * Enum OPP.ECurrencyType
	 */
	enum class ECurrencyType : uint8_t
	{
		None          = 0,
		MurkoffPoint  = 1,
		MurkoffDollar = 2,
		ReleaseToken  = 3,
		EventToken    = 4,
		Count         = 5,
		MAX           = 6
	};

	/**
	 * Enum OPP.EPlayerCustomizationSlot
	 */
	enum class EPlayerCustomizationSlot : uint8_t
	{
		NightVisionGoggles = 0,
		Hair               = 1,
		Head               = 2,
		Watch              = 3,
		UpperBody          = 4,
		Toaster            = 5,
		LowerBody          = 6,
		Glove              = 7,
		ESOPStraps         = 8,
		None               = 9,
		MAX                = 10
	};

	/**
	 * Enum OPP.EProfilePlatform
	 */
	enum class EProfilePlatform : uint8_t
	{
		Unknown = 0,
		Test    = 1,
		Steam   = 2,
		EOS     = 3,
		Xbox    = 4,
		Psn     = 5,
		MAX     = 6
	};

	/**
	 * Enum OPP.EActiveSkillType
	 */
	enum class EActiveSkillType : uint8_t
	{
		None   = 0,
		Amp    = 1,
		Chem   = 2,
		Pharma = 3,
		Spec   = 4,
		Max    = 5
	};

	/**
	 * Enum OPP.ESkinColorType
	 */
	enum class ESkinColorType : uint8_t
	{
		Light = 0,
		Dark  = 1,
		MAX   = 2
	};

	/**
	 * Enum OPP.EPlayerEvent
	 */
	enum class EPlayerEvent : uint8_t
	{
		None                                          = 0,
		CoopMove                                      = 1,
		HelpedUpByTeammate                            = 2,
		HelpedUpTeammate                              = 3,
		PlayerTookDamage                              = 4,
		PlayerKnockedDown                             = 5,
		PlayerDied                                    = 6,
		PlayerLostChance                              = 7,
		SanityLost                                    = 8,
		RevivedDeadPlayer                             = 9,
		SuccessfullyUsedDynamicObstacle               = 10,
		BodyHitEnemy                                  = 11,
		HeadShotHitEnemy                              = 12,
		DistractEnemyWithBrick                        = 13,
		DistractEnemyWithBottle                       = 14,
		ShovedEnemy                                   = 15,
		SavedYourselfFromGroundAndPound               = 16,
		SavedPlayerFromGroundAndPound                 = 17,
		SavedPlayerFromExecution                      = 18,
		SavedPlayerFromElectricTrap                   = 19,
		SavedYourselfFromElectricTrap                 = 20,
		SavedByPlayerFromElectricTrap                 = 21,
		TriggeredSoundTrap                            = 22,
		CaughtByDoorTrap                              = 23,
		DamagedByExplosiveTrap                        = 24,
		DamagedByElectricFloorTrap                    = 25,
		UsedActiveSkill                               = 26,
		Skill_Spec_SpottedEnemy                       = 27,
		Skill_Pharma_AffectedPlayer                   = 28,
		Skill_Amp_AffectedEnemy                       = 29,
		Skill_Chem_AffectedEnemy                      = 30,
		Unlocked_Door_Lockpick                        = 31,
		Unlocked_Container_Lockpick                   = 32,
		Unlocked_Door_MasterKey                       = 33,
		Unlocked_Container_MasterKey                  = 34,
		SurvivedPsychosis                             = 35,
		PickedUp_MurkoffPoint                         = 36,
		PickedUp_MurkoffDollar                        = 37,
		PickedUp_CollectibleDocument                  = 38,
		PickedUp_EquippableItem                       = 39,
		UsedItem_Health                               = 40,
		UsedItem_ReviveSyringe                        = 41,
		UsedItem_Stamina                              = 42,
		UsedItem_Battery                              = 43,
		UsedItem_SkillCharge                          = 44,
		UsedItem_Antidote                             = 45,
		UsedItem_Throwable                            = 46,
		UsedItem_RespawnPill                          = 47,
		DisarmedWireTriggerTrap                       = 48,
		BashOpenLockedDoor                            = 49,
		EnteredHidingSpot                             = 50,
		PropagandaPosterCollected                     = 51,
		StageTimeElapsed                              = 52,
		CompletedStage                                = 53,
		CompletedStageAlive                           = 54,
		CompletedStageDead                            = 55,
		LeftTeammateBehind                            = 56,
		StageEndPercentageHealthLost                  = 57,
		CompletedMainObjective                        = 58,
		CompletedSecondaryObjective                   = 59,
		CompletedMainObjectiveStep                    = 60,
		CompletedSecondaryObjectiveStep               = 61,
		CompletedMainObjectiveStepPlayerSpecific      = 62,
		CompletedSecondaryObjectiveStepPlayerSpecific = 63,
		CompletedExperiment                           = 64,
		ScriptedPoints                                = 65,
		Max                                           = 66
	};

	/**
	 * Enum OPP.EPlayerIndicatorType
	 */
	enum class EPlayerIndicatorType : uint8_t
	{
		Default                      = 0,
		Knockdown                    = 1,
		Objective_Default            = 2,
		Objective_Cart               = 3,
		Objective_Exit               = 4,
		Objective_HotPotato          = 5,
		Objective_QuestInventoryItem = 6,
		Objective_Stalker            = 7,
		Objective_ZoneDefense        = 8,
		Objective_LargePickup        = 9,
		KnockdownBeingTargetted      = 10,
		AboutToDie                   = 11,
		CoopTrap                     = 12,
		CoopMove                     = 13,
		HelpUp                       = 14,
		Revive                       = 15,
		Dead                         = 16,
		CanBeRevived                 = 17,
		WantsToTrade                 = 18,
		PlayerInvestigating          = 19,
		ItemHoldingAction            = 20,
		MAX                          = 21
	};

	/**
	 * Enum OPP.EGameplayAttributeModifierType
	 */
	enum class EGameplayAttributeModifierType : uint8_t
	{
		Addition          = 0,
		Multiplication    = 1,
		AddBaseValueRatio = 2,
		MAX               = 3
	};

	/**
	 * Enum OPP.EGameplayAttributeType
	 */
	enum class EGameplayAttributeType : uint8_t
	{
		Invalid                            = 0,
		MaxHealth                          = 1,
		MaxNVBatteries                     = 2,
		MaxStamina                         = 3,
		HealthRegenDelay                   = 4,
		HealthOnHelpedUp                   = 5,
		HealthOnRevived                    = 6,
		HealthAfterRespawn                 = 7,
		PsychosisDecaySpeed                = 8,
		PsychosisContinuousGainDelay       = 9,
		PsychosisGainMultiplier            = 10,
		PsychosisDurationMultiplier        = 11,
		ExtraPsychosisGain                 = 12,
		NVBatteryConsumption               = 13,
		NVBatteryRechargeRate              = 14,
		StaminaMovementCostMultiplier      = 15,
		StaminaExhaustionDuration          = 16,
		StaminaRecoveryRateMultiplier      = 17,
		StaminaShoveCostMultiplier         = 18,
		StaminaCoopCostMultiplier          = 19,
		StaminaBashCostMultiplier          = 20,
		StaminaTraversalCostMultiplier     = 21,
		HidingSpotMaxStaminaModifier       = 22,
		ActiveSkillCooldown                = 23,
		ActiveSkillActivationRadius        = 24,
		ActiveSkillEffectRadius            = 25,
		ActiveSkillEffectDuration          = 26,
		ActiveSkillEffect2Duration         = 27,
		ActiveSkillPharmaEffectMultiplier  = 28,
		ActiveSkillSpecTagDuration         = 29,
		StartItemsBrick                    = 30,
		StartItemsLockpick                 = 31,
		StartItemsHealthGain               = 32,
		BatteryItemUseMultiplier           = 33,
		HealthItemUseMultiplier            = 34,
		TempHealthItemUseMultiplier        = 35,
		TempHealthDecayRate                = 36,
		TempHealthConversionRate           = 37,
		StaminaItemUseMultiplier           = 38,
		AntidoteItemUseMultiplier          = 39,
		MoneyPickupMultiplier              = 40,
		SkillChargeItemPickupMultiplier    = 41,
		ChanceOfKeepingSyringeAfterUse     = 42,
		ChanceOfKeepingLockpickAfterUse    = 43,
		ChanceOfKeepingMasterKeyAfterUse   = 44,
		MeleeDamageReceivedMultiplier      = 45,
		ProjectileDamageReceivedMultiplier = 46,
		SpectreDamageReceivedMultiplier    = 47,
		TrapDamageReceivedMultiplier       = 48,
		FallDamageMultiplier               = 49,
		ChanceOfPlayerBreakingIn1Hit       = 50,
		PlayerBashDamage                   = 51,
		PlayerShovePushDistance            = 52,
		PerkSlotCount                      = 53,
		InventorySlotCount                 = 54,
		NoiseTrapNoiseMultiplier           = 55,
		ThrowableNoiseMultiplier           = 56,
		ThrowableStunDurationMultiplier    = 57,
		NoiseWhenCrouching                 = 58,
		NoiseWhenRunning                   = 59,
		NoiseWhenWalking                   = 60,
		NoiseWhenOpeningDoorsMultiplier    = 61,
		PerceivedVisibilityMultiplier      = 62,
		MinigameSpeedMultiplier            = 63,
		MinigameZoneSizeModifier           = 64,
		HoldDurationMultiplier             = 65,
		GarageDoorProgressMultiplier       = 66,
		RemoveTrapMultiplier               = 67,
		GroundAndPoundMashMultiplier       = 68,
		PushCartMultiplier                 = 69,
		DisarmTrapMultiplier               = 70,
		HelpUpMultiplier                   = 71,
		HelpUpDamageSlowDownMultiplier     = 72,
		ReviveVictimMultiplier             = 73,
		ReviveHelperMultiplier             = 74,
		ReviveDamageSlowDownMultiplier     = 75,
		CrouchSpeedMultiplier              = 76,
		WalkingSpeedMultiplier             = 77,
		RunningSpeedMultiplier             = 78,
		LargeObjectCarrySpeedMultiplier    = 79,
		AimAssistRadiusMultiplier          = 80,
		MAX                                = 81
	};

	/**
	 * Enum OPP.ECustomizationMenuCategory
	 */
	enum class ECustomizationMenuCategory : uint8_t
	{
		DNA              = 0,
		Voice            = 1,
		Outfits          = 2,
		NightVision      = 3,
		UpperBody        = 4,
		LowerBody        = 5,
		Watch            = 6,
		Haircut          = 7,
		Glove            = 8,
		Rigs             = 9,
		Toaster          = 10,
		Trinkets         = 11,
		PlayerIcon       = 12,
		Cell_Bundle      = 13,
		Cell_MediumProp1 = 14,
		Cell_MediumProp2 = 15,
		Cell_SmallProp1  = 16,
		Cell_SmallProp2  = 17,
		Cell_Poster1     = 18,
		Cell_Poster2     = 19,
		Cell_Poster3     = 20,
		Cell_Poster4     = 21,
		Cell_WallPaper   = 22,
		Cell_Carpet      = 23,
		Cell_Bed         = 24,
		Cell_Sink        = 25,
		Cell_Ceramic     = 26,
		Cell_Trim        = 27,
		None             = 28,
		MAX              = 29
	};

	/**
	 * Enum OPP.EGameDifficulty
	 */
	enum class EGameDifficulty : uint8_t
	{
		Undefined = 0,
		Easy      = 1,
		Normal    = 2,
		Hard      = 3,
		Insane    = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.EPlayerCustomizationRarity
	 */
	enum class EPlayerCustomizationRarity : uint8_t
	{
		Invalid   = 0,
		Common    = 1,
		Rare      = 2,
		Epic      = 3,
		Legendary = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.ERewardType
	 */
	enum class ERewardType : uint8_t
	{
		None                = 0,
		PlayerXp            = 1,
		Customization       = 2,
		PerkSlot            = 3,
		Currency            = 4,
		RandomCustomization = 5,
		MAX                 = 6
	};

	/**
	 * Enum OPP.EXPGainType
	 */
	enum class EXPGainType : uint8_t
	{
		None                   = 0,
		TrialInitialCompletion = 1,
		TrialPerfectScore      = 2,
		TrialRepeatable        = 3,
		TrialScore             = 4,
		Badges                 = 5,
		MAX                    = 6
	};

	/**
	 * Enum OPP.EChessGameState
	 */
	enum class EChessGameState : uint8_t
	{
		None              = 0,
		WaitingForPlayers = 1,
		Intro             = 2,
		GameInProgress    = 3,
		Outtro            = 4,
		MAX               = 5
	};

	/**
	 * Enum OPP.EChessTeam
	 */
	enum class EChessTeam : uint8_t
	{
		None  = 0,
		White = 1,
		Black = 2,
		MAX   = 3
	};

	/**
	 * Enum OPP.EChessGameEndReason
	 */
	enum class EChessGameEndReason : uint8_t
	{
		None          = 0,
		Mate          = 1,
		Timeout       = 2,
		Resign        = 3,
		DrawStalemate = 4,
		DrawThreefold = 5,
		DrawFiftyRule = 6,
		DrawMaterial  = 7,
		MAX           = 8
	};

	/**
	 * Enum OPP.EChessGameTurnType
	 */
	enum class EChessGameTurnType : uint8_t
	{
		None      = 0,
		Play      = 1,
		Promoting = 2,
		Checked   = 3,
		MAX       = 4
	};

	/**
	 * Enum OPP.EChessPieceType
	 */
	enum class EChessPieceType : uint8_t
	{
		None   = 0,
		Pawn   = 1,
		Rook   = 2,
		Knight = 3,
		Bishop = 4,
		Queen  = 5,
		King   = 6,
		MAX    = 7
	};

	/**
	 * Enum OPP.EPlayerStat
	 */
	enum class EPlayerStat : uint8_t
	{
		None                              = 0,
		ItemsPickedUp                     = 1,
		ItemsPickedUp_SmallMedicine       = 2,
		ItemsPickedUp_LargeMedicine       = 3,
		ItemsPickedUp_HealthBooster       = 4,
		ItemsPickedUp_ReviveSyringe       = 5,
		ItemsPickedUp_Adrenaline          = 6,
		ItemsPickedUp_StaminaBooster      = 7,
		ItemsPickedUp_SmallBattery        = 8,
		ItemsPickedUp_LargeBattery        = 9,
		ItemsPickedUp_BatteryBooster      = 10,
		ItemsPickedUp_LockPick            = 11,
		ItemsPickedUp_MasterKey           = 12,
		ItemsPickedUp_RigRecharger        = 13,
		ItemsPickedUp_Bottle              = 14,
		ItemsPickedUp_Antidote            = 15,
		ItemsPickedUp_Brick               = 16,
		ItemsPickedUp_CollectibleDocument = 17,
		ItemsUsed                         = 18,
		ItemsUsed_Health                  = 19,
		ItemsUsed_Throwable               = 20,
		ItemsUsed_SmallMedicine           = 21,
		ItemsUsed_LargeMedicine           = 22,
		ItemsUsed_HealthBooster           = 23,
		ItemsUsed_ReviveSyringe           = 24,
		ItemsUsed_Adrenaline              = 25,
		ItemsUsed_StaminaBooster          = 26,
		ItemsUsed_SmallBattery            = 27,
		ItemsUsed_LargeBattery            = 28,
		ItemsUsed_BatteryBooster          = 29,
		ItemsUsed_LockPick                = 30,
		ItemsUsed_MasterKey               = 31,
		ItemsUsed_RigRecharger            = 32,
		ItemsUsed_Bottle                  = 33,
		ItemsUsed_Antidote                = 34,
		ItemsUsed_Brick                   = 35,
		ItemsDropped                      = 36,
		ItemsDropped_SmallMedicine        = 37,
		ItemsDropped_LargeMedicine        = 38,
		ItemsDropped_HealthBooster        = 39,
		ItemsDropped_ReviveSyringe        = 40,
		ItemsDropped_Adrenaline           = 41,
		ItemsDropped_StaminaBooster       = 42,
		ItemsDropped_SmallBattery         = 43,
		ItemsDropped_LargeBattery         = 44,
		ItemsDropped_BatteryBooster       = 45,
		ItemsDropped_LockPick             = 46,
		ItemsDropped_MasterKey            = 47,
		ItemsDropped_RigRecharger         = 48,
		ItemsDropped_Bottle               = 49,
		ItemsDropped_Antidote             = 50,
		ItemsDropped_Brick                = 51,
		UnlockedContainers                = 52,
		ItemsTraded                       = 53,
		ItemsTraded_SmallMedicine         = 54,
		ItemsTraded_LargeMedicine         = 55,
		ItemsTraded_HealthBooster         = 56,
		ItemsTraded_ReviveSyringe         = 57,
		ItemsTraded_Adrenaline            = 58,
		ItemsTraded_StaminaBooster        = 59,
		ItemsTraded_SmallBattery          = 60,
		ItemsTraded_LargeBattery          = 61,
		ItemsTraded_BatteryBooster        = 62,
		ItemsTraded_LockPick              = 63,
		ItemsTraded_MasterKey             = 64,
		ItemsTraded_RigRecharger          = 65,
		ItemsTraded_Bottle                = 66,
		ItemsTraded_Antidote              = 67,
		ItemsTraded_Brick                 = 68,
		TimesCurrencyPickedUp             = 69,
		CurrencyPickedUp_MurkoffPoint     = 70,
		CurrencyPickedUp_MurkoffDollar    = 71,
		TimesUsedActiveSkill              = 72,
		TotalDamageTaken                  = 73,
		TimesIncapacitated                = 74,
		SecondsSpentIncapacitated         = 75,
		TimesKilled                       = 76,
		ChancesLost                       = 77,
		SecondsSpentDead                  = 78,
		TimesRevived                      = 79,
		TimesRespawned                    = 80,
		TimesHelpedUpTeammate             = 81,
		TimesRevivedDeadPlayer            = 82,
		TimesUsedHidingSpot               = 83,
		SecondsSpentInHidingSpot          = 84,
		TimesUsedNightVision              = 85,
		SecondsSpentInNightVision         = 86,
		TimesUsedDynamicObstable          = 87,
		TimesHitNpcWithDynamicObstable    = 88,
		TimesTriggeredExplosiveTrap       = 89,
		TimesDamagedByExplosiveTrap       = 90,
		TotalDamageByExplosiveTraps       = 91,
		DoorTrapsDisarmed                 = 92,
		DoorTrapsTriggered                = 93,
		DoorTrapsAvoided                  = 94,
		DoorTrapsCaught                   = 95,
		BashOpenLockedDoor                = 96,
		LockedContainersDisarmAttempts    = 97,
		LockedContainersDisarmSuccess     = 98,
		LockedContainersDisarmFailure     = 99,
		TimesDamagedByElectricFloorTrap   = 100,
		TotalDamageByElectricFloorTraps   = 101,
		JumpScaresTriggered               = 102,
		Shove                             = 103,
		BodyHitEnemy                      = 104,
		HeadShotHitEnemy                  = 105,
		DistractEnemyWithThrowable        = 106,
		Spotted                           = 107,
		SecondsSpentCrouched              = 108,
		SecondsSpentRunning               = 109,
		SecondsSpentSliding               = 110,
		Chases                            = 111,
		ChasesEscaped                     = 112,
		ChasesDamaged                     = 113,
		ChasesIncapacitated               = 114,
		ChasesEscapedWithHidingSpot       = 115,
		SecondsSpentChased                = 116,
		TimesInPsychosis                  = 117,
		SecondsSpentInPsychosis           = 118,
		PuzzleRoomsCompleted              = 119,
		RewardRoomsUnlocked               = 120,
		DistanceTraveled                  = 121,
		HealthRecovered                   = 122,
		BatteryRecovered                  = 123,
		StaminaRecovered                  = 124,
		SanityRecovered                   = 125,
		CoopMovesPerformed                = 126,
		Badge_BigSaver                    = 127,
		Badge_SleighOfHand                = 128,
		Badge_Mechanophiliac              = 129,
		Badge_TogetherWeAreStong          = 130,
		Badge_CrowdControl                = 131,
		Badge_Hypochondriac               = 132,
		Badge_NotYourTimeYet              = 133,
		Badge_GottaGoFast                 = 134,
		Badge_BreatheIn                   = 135,
		Badge_PowerSurge                  = 136,
		Badge_Bulleye                     = 137,
		Badge_MajorLeaguePlayer           = 138,
		Badge_Distraction                 = 139,
		Badge_Coward                      = 140,
		Badge_TriggerHappy                = 141,
		Badge_AngerIssues                 = 142,
		Badge_TappingOut                  = 143,
		Badge_BoostMeUp                   = 144,
		Badge_ClearVision                 = 145,
		Badge_HighAsAKite                 = 146,
		Badge_StepOnMeDaddy               = 147,
		Badge_Hemophiliac                 = 148,
		Badge_Hoarder                     = 149,
		Badge_DriftKing                   = 150,
		Badge_Marathonian                 = 151,
		Badge_Hunchback                   = 152,
		Badge_CantTouchThis               = 153,
		Badge_AverageJoe                  = 154,
		Badge_CompletedProgram1           = 155,
		Badge_CompletedProgram2           = 156,
		Badge_CompletedProgram3           = 157,
		Badge_CompletedProgram4           = 158,
		Badge_CompletedProgramX           = 159,
		CharactersReleased_Volundary      = 160,
		BestTrialCompletionTimeSeconds    = 161,
		BestTrialGroupTQ                  = 162,
		BestTrialPersonalTQ               = 163,
		MaxCharacterLevelReached          = 164,
		TotalTrialTimePlayedSeconds       = 165,
		TrialsCompleted                   = 166,
		TrialsCompletedNoDamage           = 167,
		TrialsFailed                      = 168,
		ArmWrestlingMatchesWon            = 169,
		ArmWrestlingMatchesLost           = 170,
		ChessMatchesWon                   = 171,
		ChessMatchesLost                  = 172,
		TalkWheel                         = 173,
		TalkWheel_Help                    = 174,
		TalkWheel_Acknowledge             = 175,
		TalkWheel_Regroup                 = 176,
		TalkWheel_Wait                    = 177,
		TalkWheel_Danger                  = 178,
		TalkWheel_Thanks                  = 179,
		TalkWheel_OnMyWay                 = 180,
		TalkWheel_Hello                   = 181,
		TalkWheel_Ping                    = 182,
		Max                               = 183
	};

	/**
	 * Enum OPP.EGamepadType
	 */
	enum class EGamepadType : uint8_t
	{
		XboxOne    = 0,
		Xbox360    = 1,
		DualSense  = 2,
		Dualshock4 = 3,
		Dualshock3 = 4,
		None       = 5,
		MAX        = 6
	};

	/**
	 * Enum OPP.EExitStageObjectiveState
	 */
	enum class EExitStageObjectiveState : uint8_t
	{
		WaitingForButton = 0,
		WaitingForDoors  = 1,
		CanAccessSAS     = 2,
		MAX              = 3
	};

	/**
	 * Enum OPP.ELoadoutElementType
	 */
	enum class ELoadoutElementType : uint8_t
	{
		None               = 0,
		ActiveSkill        = 1,
		ActiveSkillUpgrade = 2,
		Perk               = 3,
		ProfileUpgrade     = 4,
		MAX                = 5
	};

	/**
	 * Enum OPP.EMainMenuState
	 */
	enum class EMainMenuState : uint8_t
	{
		None                       = 0,
		WaitingForPlayerController = 1,
		WaitingForInput            = 2,
		Disclaimer                 = 3,
		Connecting                 = 4,
		ProcessingBootInvite       = 5,
		Connected                  = 6,
		MainMenu                   = 7,
		EnteringLobby              = 8,
		TransitionToTutorialMap    = 9,
		EnteringTutorialMap        = 10,
		MAX                        = 11
	};

	/**
	 * Enum OPP.EGamePhase
	 */
	enum class EGamePhase : uint8_t
	{
		None                     = 0,
		WaitingForPlayers        = 1,
		WaitingForPlayersSitting = 2,
		LoadingStage             = 3,
		Populating               = 4,
		WaitingForStageReady     = 5,
		StageReady               = 6,
		StageStarted             = 7,
		StageEnding              = 8,
		StageFailed              = 9,
		StageReset               = 10,
		StageSuccess             = 11,
		ReturnToLobby            = 12,
		PostGameExitTimeout      = 13,
		MAX                      = 14
	};

	/**
	 * Enum OPP.ESASVariatorType
	 */
	enum class ESASVariatorType : uint8_t
	{
		None          = 0,
		SplitEntrance = 1,
		SplitExit     = 2,
		Max           = 3
	};

	/**
	 * Enum OPP.EObstacleVariatorType
	 */
	enum class EObstacleVariatorType : uint8_t
	{
		None           = 0,
		SoundTraps     = 1,
		ExplosiveTraps = 2,
		ElectricFloors = 3,
		PsychosisMine  = 4,
		Max            = 5
	};

	/**
	 * Enum OPP.ESecondaryObjectiveVariatorType
	 */
	enum class ESecondaryObjectiveVariatorType : uint8_t
	{
		None         = 0,
		Posters      = 1,
		SmashScreens = 2,
		Max          = 3
	};

	/**
	 * Enum OPP.EGameSessionType
	 */
	enum class EGameSessionType : uint8_t
	{
		Unknown     = 0,
		Placement   = 1,
		Matchmaking = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.ESASState
	 */
	enum class ESASState : uint8_t
	{
		Invalid          = 0,
		NextExitUnlocked = 1,
		InTransition     = 2,
		RestartingLevel  = 3,
		NextExitLocked   = 4,
		Begin            = 5,
		ReturnToLobby    = 6,
		MAX              = 7
	};

	/**
	 * Enum OPP.EHotPotatoState
	 */
	enum class EHotPotatoState : uint8_t
	{
		Disabled  = 0,
		Idle      = 1,
		Dropped   = 2,
		Carried   = 3,
		Completed = 4,
		Expired   = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.EWorldIconType
	 */
	enum class EWorldIconType : uint8_t
	{
		Unspecified        = 0,
		PlayerIndicator    = 1,
		CoopNotification   = 2,
		ObjectiveDefault   = 3,
		ObjectivePsychosis = 4,
		PlayerPing         = 5,
		NPCDebugIcon       = 6,
		FriendlyDevice     = 7,
		DeadBodySolo       = 8,
		TutorialZone       = 9,
		MAX                = 10
	};

	/**
	 * Enum OPP.EGameObjectiveType
	 */
	enum class EGameObjectiveType : uint8_t
	{
		Default          = 0,
		HotPotato        = 1,
		Stalker          = 2,
		PushCart         = 3,
		SimpleInteract   = 4,
		LargeInteract    = 5,
		Exit             = 6,
		EscapePuzzleRoom = 7,
		ShootNPC         = 8,
		MAX              = 9
	};

	/**
	 * Enum OPP.EGameMessageCategory
	 */
	enum class EGameMessageCategory : uint8_t
	{
		Normal             = 0,
		Error              = 1,
		ObjectiveStarted   = 2,
		ObjectiveCompleted = 3,
		MAX                = 4
	};

	/**
	 * Enum OPP.InventoryWheelMode
	 */
	enum class EInventoryWheelMode : uint8_t
	{
		InventoryWheelMode_Hold                   = 0,
		InventoryWheelMode_Scroll                 = 1,
		InventoryWheelMode_None                   = 2,
		InventoryWheelMode_InventoryWheelMode_MAX = 3
	};

	/**
	 * Enum OPP.PlayerActionStatus
	 */
	enum class EPlayerActionStatus : uint8_t
	{
		PlayerActionStatus_None                   = 0,
		PlayerActionStatus_HelpUp                 = 1,
		PlayerActionStatus_Revive                 = 2,
		PlayerActionStatus_InTrap                 = 3,
		PlayerActionStatus_GettingPounced         = 4,
		PlayerActionStatus_Investigating          = 5,
		PlayerActionStatus_ItemHoldingAction      = 6,
		PlayerActionStatus_PlayerActionStatus_MAX = 7
	};

	/**
	 * Enum OPP.ERBSocialMenuEntryAction
	 */
	enum class ERBSocialMenuEntryAction : uint8_t
	{
		ShowPlatformProfileUi      = 0,
		ChangeActiveSkill          = 1,
		SendFriendInvite           = 2,
		CancelFriendInvite         = 3,
		AcceptFriendInvite         = 4,
		RefuseFriendInvite         = 5,
		RemoveFriend               = 6,
		ShowAddFriendUi            = 7,
		SendPlatformFriendInvite   = 8,
		AcceptPlatformFriendInvite = 9,
		RefusePlatformFriendInvite = 10,
		JoinParty                  = 11,
		LeaveParty                 = 12,
		InviteToParty              = 13,
		RemoveFromParty            = 14,
		RefusePartyInvite          = 15,
		PromotePartyMember         = 16,
		TogglePartyInviteWidget    = 17,
		Block                      = 18,
		UnBlock                    = 19,
		PlatformBlock              = 20,
		Report                     = 21,
		InvitePlayer               = 22,
		UpdatePartySettings        = 23,
		MAX                        = 24
	};

	/**
	 * Enum OPP.ERBSocialMenuEntryFilter
	 */
	enum class ERBSocialMenuEntryFilter : uint8_t
	{
		None         = 0,
		SamePlatform = 1,
		MAX          = 2
	};

	/**
	 * Enum OPP.EFindPartyTicketState
	 */
	enum class EFindPartyTicketState : uint8_t
	{
		Searching          = 0,
		PendingAcceptance  = 1,
		AcceptanceProvided = 2,
		Completed          = 3,
		MAX                = 4
	};

	/**
	 * Enum OPP.EInventoryUpdateEventType
	 */
	enum class EInventoryUpdateEventType : uint8_t
	{
		EquippedItemChanged      = 0,
		InventoryChanged         = 1,
		ItemPickup               = 2,
		ActiveSkillChargeChanged = 3,
		ForceTemporaryFadeIn     = 4,
		MAX                      = 5
	};

	/**
	 * Enum OPP.ELocomotionMode
	 */
	enum class ELocomotionMode : uint8_t
	{
		Normal                   = 0,
		SpecialMove              = 1,
		Cinematic                = 2,
		KnockedDown              = 3,
		KnockedDownSliding       = 4,
		Dead                     = 5,
		Falling                  = 6,
		Ghost                    = 7,
		Operating                = 8,
		SoftOperating            = 9,
		DoorLiftHold             = 10,
		Pushing                  = 11,
		Hidden                   = 12,
		FreeSlide                = 13,
		SlideOver                = 14,
		SlideUnder               = 15,
		SlideDown                = 16,
		GroundAndPound           = 17,
		ScriptedIdle             = 18,
		NPCAnimating             = 19,
		Knockout                 = 20,
		MovingLargePickup        = 21,
		WakeUp                   = 22,
		OperatingDoor            = 23,
		CoopTrapped_Victim       = 24,
		CoopTrapped_Helper       = 25,
		Coop_WaitingForBash      = 26,
		Coop_HelpUp              = 27,
		Coop_Revive              = 28,
		Coop_WaitingForTraversal = 29,
		Tutorial                 = 30,
		MAX                      = 31
	};

	/**
	 * Enum OPP.ESpecialMove
	 */
	enum class ESpecialMove : uint8_t
	{
		None                                 = 0,
		EnterCinematicModeSmooth             = 1,
		EnterCinematicModeTeleport           = 2,
		ScriptedAnimation                    = 3,
		CustomInteractable                   = 4,
		AdjustPosition                       = 5,
		Jumping                              = 6,
		Landing                              = 7,
		NPC_Landing                          = 8,
		JumpOver                             = 9,
		SlideOver                            = 10,
		JumpThroughWindow                    = 11,
		ClimbOnto                            = 12,
		ClimbDown                            = 13,
		Interaction                          = 14,
		InteractionPhysWalking               = 15,
		UsingLargeObject                     = 16,
		StartOperating                       = 17,
		FinishOperating                      = 18,
		InterruptOperating                   = 19,
		StartSoftOperating                   = 20,
		FinishSoftOperating                  = 21,
		InterruptSoftOperating               = 22,
		PickUp                               = 23,
		ContainerPickUp                      = 24,
		GiveItem                             = 25,
		ContainerOpen                        = 26,
		DropItem                             = 27,
		PlayerShove                          = 28,
		PushOtherPawn                        = 29,
		HitReaction                          = 30,
		StunnedByScreamer                    = 31,
		CoopLongJumpJumper                   = 32,
		CoopLongJumpTossed                   = 33,
		CoopLongJumpTossedToCatcher          = 34,
		CoopLongJumpTosser                   = 35,
		CoopLongJumpCatcher                  = 36,
		CoopHighJumpJumper                   = 37,
		CoopHighJumpTossed                   = 38,
		CoopHighJumpTossedToCatcher          = 39,
		CoopHighJumpTosser                   = 40,
		CoopHighJumpCatcher                  = 41,
		CoopClimbOverTossed                  = 42,
		ThrowSmallWeapon                     = 43,
		EnterReadyCoopBash                   = 44,
		BashDoor                             = 45,
		BashBreakableObject                  = 46,
		LiftGarageDoor                       = 47,
		LetGoOfGarageDoor                    = 48,
		StartPushing                         = 49,
		StopPushing                          = 50,
		StartKnockdownSliding                = 51,
		StopKnockdownSliding                 = 52,
		SelfRevive                           = 53,
		EnterCoopTrapped_Victim              = 54,
		ExitCoopTrapped_Victim               = 55,
		FailCoopTrapped_VictimKnockdown      = 56,
		FailCoopTrapped_VictimDead           = 57,
		EnterCoopTrapped_Helper              = 58,
		ExitCoopTrapped_Helper               = 59,
		Enter_CoopWaitingForTraversal        = 60,
		Exit_CoopWaitingForTraversal         = 61,
		PairedPulloutFromHidingSpotLeader    = 62,
		PairedPulloutFromHidingSpotFollower  = 63,
		LandOntoLedge                        = 64,
		ConsumeItem                          = 65,
		PushFromLedge                        = 66,
		HelpUpEntryLeader                    = 67,
		HelpUpEntryFollower                  = 68,
		HelpUpLeaveLeader                    = 69,
		HelpUpSuccessLeader                  = 70,
		HelpUpSuccessFollower                = 71,
		HelpUpFailFollower                   = 72,
		ReviveEntryLeader                    = 73,
		ReviveEntryFollower                  = 74,
		ReviveLeaveLeader                    = 75,
		ReviveSuccessLeader                  = 76,
		ReviveSuccessFollower                = 77,
		Wait                                 = 78,
		TraversalSlide                       = 79,
		PickupLargeObject                    = 80,
		PutDownLargeObject                   = 81,
		EnterWakeUpSequence                  = 82,
		ExitWakeUpSequence                   = 83,
		DoorInteraction                      = 84,
		ActivateDynamicObstacle              = 85,
		StartOperatingDoor                   = 86,
		StopOperatingDoor                    = 87,
		InterruptedOperatingDoor             = 88,
		NearDeathToKnockdown                 = 89,
		KnockDownSelfHelpSAS                 = 90,
		Emote                                = 91,
		EnterHidespot                        = 92,
		ExitHidespot                         = 93,
		KnockdownInHidespot                  = 94,
		Align                                = 95,
		SignalTackle                         = 96,
		TackleFail                           = 97,
		EnterGroundAndPoundAttacker          = 98,
		EnterGroundAndPoundVictim            = 99,
		GroundAndPoundFinishAttacker         = 100,
		GroundAndPoundFinishVictim           = 101,
		GroundAndPoundGiveUpAttacker         = 102,
		GroundAndPoundGiveUpVictim           = 103,
		GroundAndPoundEscapePlayer           = 104,
		GroundAndPoundEscapePouncer          = 105,
		GroundAndPoundInterruptPouncer       = 106,
		GroundAndPoundInterruptPinnedPlayer  = 107,
		PusherAttackAttacker                 = 108,
		PusherAttackVictim                   = 109,
		PusherAttackGroup                    = 110,
		PairedAttackAttacker                 = 111,
		PairedAttackVictim                   = 112,
		StandardFatalityAttacker             = 113,
		StandardFatalityVictim               = 114,
		KnockdownToDeath                     = 115,
		GrabAndThrowAttacker                 = 116,
		GrabAndThrowVictim                   = 117,
		NPC_AnimatedStart                    = 118,
		NPC_AnimatedStop                     = 119,
		NPC_SingleShotAnim                   = 120,
		NPC_FixedPoseAnim                    = 121,
		NPC_Startled                         = 122,
		NPC_QuickAttack                      = 123,
		NPC_Attack                           = 124,
		NPC_Investigate                      = 125,
		NPC_InvestigationBreaker             = 126,
		NPC_GiveUpInvestigation              = 127,
		NPC_GiveUpAlerted                    = 128,
		NPC_GiveUpSuspicious                 = 129,
		NPC_PlayerTaunt                      = 130,
		NPC_InvestigateHidespot              = 131,
		NPC_UnhingeDoor                      = 132,
		NPC_DoorInvestigation                = 133,
		NPC_BashDynamicObstacle              = 134,
		NPC_EnterAmbientIdle                 = 135,
		NPC_LeaveAmbientIdle                 = 136,
		NPC_PeekFromHidespot                 = 137,
		NPC_Sabotage                         = 138,
		NPC_BerserkerIdleBreaker             = 139,
		NPC_Spectre_Intro                    = 140,
		NPC_Spectre_Outro                    = 141,
		NPC_JumpOver                         = 142,
		NPC_ClimbOnto                        = 143,
		NPC_ClimbDownLedge                   = 144,
		NPC_CrouchUnder                      = 145,
		NPC_GhostThroughObstacle             = 146,
		NPC_DoorPassthrough                  = 147,
		NPC_TrapReaction                     = 148,
		NPC_TurnOnSpot                       = 149,
		NPC_HitReaction                      = 150,
		NPC_DelayedFlinchReaction            = 151,
		NPC_CheckSurroundings                = 152,
		NPC_Knockout                         = 153,
		NPC_GetUpFromKnockout                = 154,
		NPC_GoryDeath                        = 155,
		NPC_WaypointAnim                     = 156,
		NPC_ShotgunAttack                    = 157,
		NPC_ShotgunReload                    = 158,
		NPC_ShakePushable                    = 159,
		NPC_HaarpReaction                    = 160,
		NPC_BreakDistrator                   = 161,
		NPC_ReactToGrenade                   = 162,
		NPC_ReactToGrenadeStun               = 163,
		NPC_GrenadeStun                      = 164,
		NPC_RecoverFromGrenadeStun           = 165,
		NPC_ReactToBlindPaint                = 166,
		NPC_ReactToHealSlowdown              = 167,
		NPC_ChaseBreaker                     = 168,
		NPC_SleeperDisturbed                 = 169,
		NPC_SleeperWakeUp                    = 170,
		NPC_StalkerTargetBulbExplodeReaction = 171,
		Pitcher_ThrowMolotov                 = 172,
		Pitcher_EquipMolotov                 = 173,
		Pitcher_UnequipMolotov               = 174,
		MAX                                  = 175
	};

	/**
	 * Enum OPP.ESpecialMoveNotifyType
	 */
	enum class ESpecialMoveNotifyType : uint8_t
	{
		DoAction              = 0,
		DoSecondaryAction     = 1,
		SpecialMoveCompleted  = 2,
		DisablePawnCollisions = 3,
		AllowMovement         = 4,
		EnableGravity         = 5,
		MAX                   = 6
	};

	/**
	 * Enum OPP.EFootStepModifierType
	 */
	enum class EFootStepModifierType : uint8_t
	{
		None    = 0,
		Rubbish = 1,
		Bloody  = 2,
		Wet     = 3,
		MAX     = 4
	};

	/**
	 * Enum OPP.EProceduralAnimInterpType
	 */
	enum class EProceduralAnimInterpType : uint8_t
	{
		Smooth   = 0,
		Linear   = 1,
		Decel    = 2,
		Accel    = 3,
		ExpDecel = 4,
		ExpAccel = 5,
		EaseOut  = 6,
		MAX      = 7
	};

	/**
	 * Enum OPP.EGhostFinishReason
	 */
	enum class EGhostFinishReason : uint8_t
	{
		NoneGiven   = 0,
		Leaving     = 1,
		Interrupted = 2,
		Custom      = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.EBashDoorType
	 */
	enum class EBashDoorType : uint8_t
	{
		KickTry      = 0,
		KickOpen     = 1,
		ShoulderTry  = 2,
		ShoulderOpen = 3,
		Unhinge      = 4,
		CoopBash     = 5,
		MAX          = 6
	};

	/**
	 * Enum OPP.EDoorInteractionType
	 */
	enum class EDoorInteractionType : uint8_t
	{
		None                     = 0,
		Open                     = 1,
		OpenFail                 = 2,
		CloseInsideLeft          = 3,
		CloseInsideRight         = 4,
		CloseOutsideLeft         = 5,
		CloseOutsideRight        = 6,
		CloseInsideLeftQuick     = 7,
		CloseInsideRightQuick    = 8,
		CloseOutsideLeftQuick    = 9,
		CloseOutsideRightQuick   = 10,
		CloseInsideLeftRunning   = 11,
		CloseInsideRightRunning  = 12,
		CloseOutsideLeftRunning  = 13,
		CloseOutsideRightRunning = 14,
		SlowOpenStart            = 15,
		MAX                      = 16
	};

	/**
	 * Enum OPP.EBasicDirection
	 */
	enum class EBasicDirection : uint8_t
	{
		None     = 0,
		Forward  = 1,
		Backward = 2,
		Left     = 3,
		Right    = 4,
		MAX      = 5
	};

	/**
	 * Enum OPP.EPawnRepulsionType
	 */
	enum class EPawnRepulsionType : uint8_t
	{
		None                   = 0,
		AllDirection           = 1,
		AllDirectionExceptBack = 2,
		ForwardOnly            = 3,
		SideOnly               = 4,
		MAX                    = 5
	};

	/**
	 * Enum OPP.EItemType
	 */
	enum class EItemType : uint8_t
	{
		Nothing               = 0,
		Fists                 = 1,
		HealthGain            = 2,
		HealthBoost           = 3,
		TempHealthGain        = 4,
		ReviveSyringe         = 5,
		RespawnConsumable     = 6,
		StaminaRegen          = 7,
		MaxStaminaBoost       = 8,
		SmallBattery          = 9,
		Battery               = 10,
		SuperBattery          = 11,
		LockPick              = 12,
		MasterKey             = 13,
		SkillCharge           = 14,
		Bottle                = 15,
		PsychosisAntidote     = 16,
		MurkoffPoint          = 17,
		MurkoffDollar         = 18,
		Brick                 = 19,
		ProximityDetector     = 20,
		CollectibleDocument   = 21,
		Quest                 = 22,
		ActiveSkillController = 23,
		ActiveSkillThrowable  = 24,
		ActiveSkillDeployable = 25,
		ObjectiveThrowable    = 26,
		GoreThrowable         = 27,
		Axe                   = 28,
		BaseballBat           = 29,
		Knife                 = 30,
		Machete               = 31,
		Pipe                  = 32,
		CattleProd            = 33,
		DoubleClaw            = 34,
		SledgeHammer          = 35,
		SpikedMace            = 36,
		WoodPlank             = 37,
		Shotgun               = 38,
		MolotovCocktail       = 39,
		MAX                   = 40
	};

	/**
	 * Enum OPP.EItemCategory
	 */
	enum class EItemCategory : uint8_t
	{
		Fist        = 0,
		Throwable   = 1,
		Health      = 2,
		Utility     = 3,
		ActiveSkill = 4,
		Currency    = 5,
		Collectible = 6,
		QuestItem   = 7,
		None        = 8,
		MAX         = 9
	};

	/**
	 * Enum OPP.EDamageVolumeType
	 */
	enum class EDamageVolumeType : uint8_t
	{
		RightHand = 0,
		LeftHand  = 1,
		Head      = 2,
		LeftFoot  = 3,
		RightFoot = 4,
		Other     = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.EKnockbackValue
	 */
	enum class EKnockbackValue : uint8_t
	{
		None     = 0,
		VeryLow  = 1,
		Low      = 2,
		Medium   = 3,
		High     = 4,
		VeryHigh = 5,
		MAX      = 6
	};

	/**
	 * Enum OPP.EDamageValue
	 */
	enum class EDamageValue : uint8_t
	{
		None     = 0,
		VeryLow  = 1,
		Low      = 2,
		Medium   = 3,
		High     = 4,
		VeryHigh = 5,
		MAX      = 6
	};

	/**
	 * Enum OPP.EConfigValueType
	 */
	enum class EConfigValueType : uint8_t
	{
		None              = 0,
		Int               = 1,
		Float             = 2,
		Bool              = 3,
		IntByDifficulty   = 4,
		FloatByDifficulty = 5,
		BoolByDifficulty  = 6,
		MAX               = 7
	};

	/**
	 * Enum OPP.EPlayerHitReactionType
	 */
	enum class EPlayerHitReactionType : uint8_t
	{
		None        = 0,
		Flinch      = 1,
		Light       = 2,
		Medium      = 3,
		Heavy       = 4,
		KnockedDown = 5,
		Dead        = 6,
		MAX         = 7
	};

	/**
	 * Enum OPP.EMessagePriority
	 */
	enum class EMessagePriority : uint8_t
	{
		NoPriority                = 0,
		Generic_SuperLowPriority  = 1,
		Gameplay_VeryLowPriority  = 2,
		Gameplay_LowPriority      = 3,
		Tutorial_LowPriority      = 4,
		Gameplay_MediumPriority   = 5,
		Tutorial_MediumPriority   = 6,
		Gameplay_HighPriority     = 7,
		Tutorial_HighPriority     = 8,
		Gameplay_VeryHighPriority = 9,
		Generic_SuperHighPriority = 10,
		MAX                       = 11
	};

	/**
	 * Enum OPP.ENightVisionAnimNotifyType
	 */
	enum class ENightVisionAnimNotifyType : uint8_t
	{
		ShowMesh              = 0,
		HUD                   = 1,
		EnterFX               = 2,
		ExitFX                = 3,
		TurnOn                = 4,
		TurnOff               = 5,
		RestrictNVOn          = 6,
		RestrictNVOff         = 7,
		RemoveAllRestrictions = 8,
		MAX                   = 9
	};

	/**
	 * Enum OPP.EDamageResultType
	 */
	enum class EDamageResultType : uint8_t
	{
		None        = 0,
		Normal      = 1,
		KnockedDown = 2,
		Dead        = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.ELargeObjectPickupSubtype
	 */
	enum class ELargeObjectPickupSubtype : uint8_t
	{
		AsIs           = 0,
		ForcedCrouched = 1,
		ForcedStanding = 2,
		MAX            = 3
	};

	/**
	 * Enum OPP.EAttackType
	 */
	enum class EAttackType : uint8_t
	{
		None           = 0,
		Quick          = 1,
		QuickLow       = 2,
		PairedAnim     = 3,
		Gun            = 4,
		BlockingAttack = 5,
		Push           = 6,
		Opener         = 7,
		Heavy          = 8,
		Punish         = 9,
		Grab           = 10,
		SpecificAnim   = 11,
		Lunge          = 12,
		FixedLocation  = 13,
		ImposterCharge = 14,
		MAX            = 15
	};

	/**
	 * Enum OPP.EPlayerPingType
	 */
	enum class EPlayerPingType : uint8_t
	{
		None            = 0,
		NPC             = 1,
		PointOfInterest = 2,
		MAX             = 3
	};

	/**
	 * Enum OPP.ECoopMoveOfferState
	 */
	enum class ECoopMoveOfferState : uint8_t
	{
		None            = 0,
		HailingGeneric  = 1,
		HailingSpecific = 2,
		Nearby          = 3,
		MAX             = 4
	};

	/**
	 * Enum OPP.ECoopMoveType
	 */
	enum class ECoopMoveType : uint8_t
	{
		None              = 0,
		HighJumpCatch     = 1,
		HighJumpToss      = 2,
		LongJump          = 3,
		CoopClimbOverToss = 4,
		MAX               = 5
	};

	/**
	 * Enum OPP.EClimbOntoAnimType
	 */
	enum class EClimbOntoAnimType : uint8_t
	{
		None    = 0,
		Running = 1,
		Walking = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.EJumpOverAnimType
	 */
	enum class EJumpOverAnimType : uint8_t
	{
		None                       = 0,
		Running                    = 1,
		Walking                    = 2,
		NoContact                  = 3,
		ClimbOver                  = 4,
		ClimberJumpOver            = 5,
		BigGruntJumpOverLowCeiling = 6,
		MAX                        = 7
	};

	/**
	 * Enum OPP.HallucinationFadeOutType
	 */
	enum class EHallucinationFadeOutType : uint8_t
	{
		HallucinationFadeOutType_Immediate                    = 0,
		HallucinationFadeOutType_Normal                       = 1,
		HallucinationFadeOutType_Fast                         = 2,
		HallucinationFadeOutType_HallucinationFadeOutType_MAX = 3
	};

	/**
	 * Enum OPP.ETalkWheelAction
	 */
	enum class ETalkWheelAction : uint8_t
	{
		None        = 0,
		Help        = 1,
		Acknowledge = 2,
		Regroup     = 3,
		Wait        = 4,
		Danger      = 5,
		Thanks      = 6,
		OnMyWay     = 7,
		Hello       = 8,
		Ping        = 9,
		MAX         = 10
	};

	/**
	 * Enum OPP.EUINoiseMeterStrength
	 */
	enum class EUINoiseMeterStrength : uint8_t
	{
		None   = 0,
		Low    = 1,
		Medium = 2,
		High   = 3,
		MAX    = 4
	};

	/**
	 * Enum OPP.EPawnCustomizationRequestType
	 */
	enum class EPawnCustomizationRequestType : uint8_t
	{
		None        = 0,
		PlayerCusto = 1,
		NPCCusto    = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.EPlayerComponentDetectionState
	 */
	enum class EPlayerComponentDetectionState : uint8_t
	{
		Idle       = 0,
		Suspicious = 1,
		Alerted    = 2,
		MAX        = 3
	};

	/**
	 * Enum OPP.EPlayerSoundDetectionState
	 */
	enum class EPlayerSoundDetectionState : uint8_t
	{
		Idle       = 0,
		Suspicious = 1,
		Alerted    = 2,
		Resetting  = 3,
		MAX        = 4
	};

	/**
	 * Enum OPP.ERegroupObjectiveState
	 */
	enum class ERegroupObjectiveState : uint8_t
	{
		Invalid           = 0,
		WaitingForPlayers = 1,
		WaitingForNPCs    = 2,
		WaitingForBP      = 3,
		Ready             = 4,
		MAX               = 5
	};

	/**
	 * Enum OPP.ETimingInputResultType
	 */
	enum class ETimingInputResultType : uint8_t
	{
		Failure        = 0,
		PartialSuccess = 1,
		Success        = 2,
		MAX            = 3
	};

	/**
	 * Enum OPP.EIKFootRootLocalAxis
	 */
	enum class EIKFootRootLocalAxis : uint8_t
	{
		NONE = 0,
		X    = 1,
		Y    = 2,
		Z    = 3,
		MAX  = 4
	};

	/**
	 * Enum OPP.EAuthErrorCodes
	 */
	enum class EAuthErrorCodes : uint8_t
	{
		MissingBaseServiceUrl            = 0,
		InvalidSessionResponseFormat     = 1,
		InvalidProfileListResponseFormat = 2,
		InvalidProfileResponseFormat     = 3,
		UnsupportedPlatform              = 4,
		MissingCredentials               = 5,
		AuthTokenRequestFailed           = 6,
		AuthTokenRequestTimeout          = 7,
		FailedToRequestSteamAuthTicket   = 8,
		InvalidAuthCode                  = 9,
		MissingRole                      = 10,
		ProfileNotFound                  = 11,
		ProfileIdMismatch                = 12,
		ProfileVersionCheckFailed        = 13,
		AuthenticationFailed             = 14,
		InvalidRefreshToken              = 15,
		InvalidClientApiKey              = 16,
		InvalidServerApiKey              = 17,
		SessionGroupNotFound             = 18,
		PolicyDocumentNotFound           = 19,
		MAX                              = 20
	};

	/**
	 * Enum OPP.EProfilePrivilegeRevocationReason
	 */
	enum class EProfilePrivilegeRevocationReason : uint8_t
	{
		Unknown                 = 0,
		TermsOfServiceViolation = 1,
		MAX                     = 2
	};

	/**
	 * Enum OPP.EProfilePrivilege
	 */
	enum class EProfilePrivilege : uint8_t
	{
		Invalid   = 0,
		Play      = 1,
		VoiceChat = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.ECoreAnalyticsErrorCodes
	 */
	enum class ECoreAnalyticsErrorCodes : uint8_t
	{
		MissingBaseServiceUrl = 0,
		MAX                   = 1
	};

	/**
	 * Enum OPP.EConfigurationErrorCodes
	 */
	enum class EConfigurationErrorCodes : uint8_t
	{
		InvalidConfigurationResponseFormat = 0,
		MissingCredentials                 = 1,
		InvalidScope                       = 2,
		InvalidEnvironment                 = 3,
		ConfigurationNotFound              = 4,
		InvalidApplication                 = 5,
		MAX                                = 6
	};

	/**
	 * Enum OPP.ECoreMatchmakingErrorCodes
	 */
	enum class ECoreMatchmakingErrorCodes : uint8_t
	{
		MissingBaseServiceUrl                = 0,
		InvalidTicketFormat                  = 1,
		MatchmakingConfigurationNotFound     = 2,
		TicketNotFound                       = 3,
		TicketCannotBeCanceled               = 4,
		GameSessionNotFound                  = 5,
		GameSessionFull                      = 6,
		InvalidGameSessionStatus             = 7,
		GameSessionPlacementCannotBeCanceled = 8,
		FailedCannotPlayOnlinePrivilegeCheck = 9,
		MAX                                  = 10
	};

	/**
	 * Enum OPP.ECorePartyErrorCodes
	 */
	enum class ECorePartyErrorCodes : uint8_t
	{
		MissingBaseServiceUrl      = 0,
		UnexpectedResponseFormat   = 1,
		TooManyParties             = 2,
		PartyNotFound              = 3,
		UnauthorizedPartyOperation = 4,
		InvalidPartyOperation      = 5,
		CannotPromoteNonMember     = 6,
		CannotPromoteSelf          = 7,
		InviteRequired             = 8,
		InviteNotValid             = 9,
		NotInParty                 = 10,
		PartyFull                  = 11,
		InvalidPartyData           = 12,
		PartyNotJoinable           = 13,
		INVALID                    = 14,
		MAX                        = 15
	};

	/**
	 * Enum OPP.EPartyPrivacy
	 */
	enum class EPartyPrivacy : uint8_t
	{
		Public    = 0,
		Friends   = 1,
		Private   = 2,
		AllowList = 3,
		Unknown   = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.ECorePresenceErrorCodes
	 */
	enum class ECorePresenceErrorCodes : uint8_t
	{
		MissingBaseServiceUrl = 0,
		MAX                   = 1
	};

	/**
	 * Enum OPP.ECoreStatsErrorCodes
	 */
	enum class ECoreStatsErrorCodes : uint8_t
	{
		MissingBaseServiceUrl         = 0,
		StatConfigNotFound            = 1,
		StatContextNotFound           = 2,
		StatConfigVersionCheckFailed  = 3,
		StatContextVersionCheckFailed = 4,
		StatsUpdateTooLarge           = 5,
		MAX                           = 6
	};

	/**
	 * Enum OPP.EEntityErrorCodes
	 */
	enum class EEntityErrorCodes : uint8_t
	{
		MissingBaseServiceUrl            = 0,
		InvalidEntityResponseFormat      = 1,
		InvalidEntityListResponseFormat  = 2,
		EntityCategoryNotFound           = 3,
		EntityNotFound                   = 4,
		EntityNotVisible                 = 5,
		InvalidApplication               = 6,
		InvalidEntityData                = 7,
		InvalidEntityId                  = 8,
		UnauthorizedAdminOperation       = 9,
		UnauthorizedApplication          = 10,
		UnauthorizedEntityUpdate         = 11,
		EntityCategoryVersionCheckFailed = 12,
		EntityVersionCheckFailed         = 13,
		MAX                              = 14
	};

	/**
	 * Enum OPP.EGameServerErrorCodes
	 */
	enum class EGameServerErrorCodes : uint8_t
	{
		Disabled = 0,
		MAX      = 1
	};

	/**
	 * Enum OPP.EInventoryErrorCodes
	 */
	enum class EInventoryErrorCodes : uint8_t
	{
		MissingBaseServiceUrl              = 0,
		InventoryConditionFailed           = 1,
		OfferNotFound                      = 2,
		ItemNotFound                       = 3,
		DefaultInventoryNotFound           = 4,
		ItemVersionCheckFailed             = 5,
		OfferVersionCheckFailed            = 6,
		DefaultInventoryVersionCheckFailed = 7,
		ProductNotFound                    = 8,
		ProductSkuNotFound                 = 9,
		ProductLocalizationDataNotFound    = 10,
		ProfilePlatformNotSupported        = 11,
		OrderNotFound                      = 12,
		InvalidOrderStatus                 = 13,
		MAX                                = 14
	};

	/**
	 * Enum OPP.EMatchmakingErrorCodes
	 */
	enum class EMatchmakingErrorCodes : uint8_t
	{
		FailedToPingDataCenters             = 0,
		NoMatchmakingConfigurationAvailable = 1,
		NoGameSessionQueueAvailable         = 2,
		FindMatchCanceled                   = 3,
		FindMatchFailed                     = 4,
		FindMatchTimedOut                   = 5,
		WaitForTicketTimedOut               = 6,
		GameSessionPlacementFailed          = 7,
		UnexpectedPlayerSessionState        = 8,
		WaitForPlacementTimedOut            = 9,
		NoAvailableRegion                   = 10,
		NoValidRegion                       = 11,
		NoSharedValidRegion                 = 12,
		MatchRefused                        = 13,
		MAX                                 = 14
	};

	/**
	 * Enum OPP.ENewsItemCTAMenuType
	 */
	enum class ENewsItemCTAMenuType : uint8_t
	{
		None          = 0,
		CurrencyPacks = 1,
		MAX           = 2
	};

	/**
	 * Enum OPP.ENewsItemCTAType
	 */
	enum class ENewsItemCTAType : uint8_t
	{
		None     = 0,
		External = 1,
		Menu     = 2,
		Product  = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.ENewsItemLocation
	 */
	enum class ENewsItemLocation : uint8_t
	{
		Unknown   = 0,
		MainMenu1 = 1,
		MainMenu2 = 2,
		MainMenu3 = 3,
		MainMenu4 = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.EOnlineCoreErrorCode
	 */
	enum class EOnlineCoreErrorCode : uint8_t
	{
		Canceled                           = 0,
		Unexpected                         = 1,
		OnlineSubsystemError               = 2,
		DependenciesNotSatisfied           = 3,
		NotConnected                       = 4,
		HttpRequestFailed                  = 5,
		HttpRequestUnexpectedStatusCode    = 6,
		HttpRequestInvalidResponseBody     = 7,
		HttpRequestUnexpectedError         = 8,
		HttpRequestUnmappedErrorCode       = 9,
		HttpRequestForbidden               = 10,
		Shutdown                           = 11,
		FeatureDisabled                    = 12,
		Throttled                          = 13,
		InvalidAuthenticationToken         = 14,
		AuthenticationTokenExpired         = 15,
		UnauthorizedSource                 = 16,
		UnauthorizedApplication            = 17,
		UnauthorizedProfile                = 18,
		NotAuthorized                      = 19,
		MissingPrivilege                   = 20,
		ParameterMissing                   = 21,
		InvalidParameterValue              = 22,
		InvalidParameterType               = 23,
		UnexpectedParameterValidationError = 24,
		MAX                                = 25
	};

	/**
	 * Enum OPP.EOnlineCoreErrorFacility
	 */
	enum class EOnlineCoreErrorFacility : uint8_t
	{
		Core          = 0,
		Platform      = 1,
		Configuration = 2,
		Auth          = 3,
		Entity        = 4,
		Messaging     = 5,
		Matchmaking   = 6,
		GameServer    = 7,
		Analytics     = 8,
		Inventory     = 9,
		RTA           = 10,
		Relationship  = 11,
		Party         = 12,
		Presence      = 13,
		CommunitySift = 14,
		Stats         = 15,
		MAX           = 16
	};

	/**
	 * Enum OPP.EOnlineErrorFacility
	 */
	enum class EOnlineErrorFacility : uint8_t
	{
		Configuration     = 0,
		Matchmaking       = 1,
		PlayerProfile     = 2,
		PlayerProgression = 3,
		Stats             = 4,
		Store             = 5,
		Party             = 6,
		PlayerStats       = 7,
		Achievements      = 8,
		Ratings           = 9,
		MAX               = 10
	};

	/**
	 * Enum OPP.EPartyErrorCodes
	 */
	enum class EPartyErrorCodes : uint8_t
	{
		FailedToJoinParty_TimedOutWaitingForInvite  = 0,
		FailedToJoinParty_CrossplayRequired         = 1,
		FailedToJoinParty_CrossplayNotAllowed       = 2,
		FailedToJoinParty_PartyNotFound             = 3,
		FailedToJoinParty_InviteRequired            = 4,
		FailedToJoinParty_InviteNotValid            = 5,
		FailedToJoinParty_PartyFull                 = 6,
		FailedToJoinParty_PartyNotJoinable          = 7,
		FailedToJoinParty_FirstPartySessionNotFound = 8,
		FailedToJoinParty_Unknown                   = 9,
		FailedToCreateFirstPartySession             = 10,
		FailedToUpdateFirstPartySession             = 11,
		FailedToDestroyFirstPartySession            = 12,
		FailedToJoinFirstPartySession               = 13,
		FailedToSendFirstPartySessionInvite         = 14,
		MAX                                         = 15
	};

	/**
	 * Enum OPP.EPartyGameSessionState
	 */
	enum class EPartyGameSessionState : uint8_t
	{
		FindingLobby = 0,
		InLobby      = 1,
		InMatch      = 2,
		Unknown      = 3,
		MAX          = 4
	};

	/**
	 * Enum OPP.EPlatformErrorCodes
	 */
	enum class EPlatformErrorCodes : uint8_t
	{
		NoUniqueNetId         = 0,
		PlatformLoginFailed   = 1,
		PlatformLoginUiFailed = 2,
		UserSignedOut         = 3,
		UserLogout            = 4,
		LoginDisabled         = 5,
		Unknown               = 6,
		MAX                   = 7
	};

	/**
	 * Enum OPP.EPlayerProgressionErrorCodes
	 */
	enum class EPlayerProgressionErrorCodes : uint8_t
	{
		NoOfferFoundForPurchase = 0,
		NoOfferFoundForLevelUp  = 1,
		MAX                     = 2
	};

	/**
	 * Enum OPP.EPlayerReportReason
	 */
	enum class EPlayerReportReason : uint8_t
	{
		AbusiveVoiceChat = 0,
		Griefing         = 1,
		NonParticipation = 2,
		Cheating         = 3,
		Spam             = 4,
		Other            = 5,
		MAX              = 6
	};

	/**
	 * Enum OPP.EPresenceState
	 */
	enum class EPresenceState : uint8_t
	{
		InMainMenu       = 0,
		InTutorial       = 1,
		InLobby          = 2,
		PreparingTrial   = 3,
		InTrial          = 4,
		ReturningToLobby = 5,
		FindingParty     = 6,
		Unknown          = 7,
		MAX              = 8
	};

	/**
	 * Enum OPP.EIntelType
	 */
	enum class EIntelType : uint8_t
	{
		None      = 0,
		Objective = 1,
		Ressource = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.EAmbientAwarenessPhase
	 */
	enum class EAmbientAwarenessPhase : uint8_t
	{
		InStation         = 0,
		WaitingForStartle = 1,
		WaitingForIdle    = 2,
		WaitingForStation = 3,
		MAX               = 4
	};

	/**
	 * Enum OPP.EAIBoolCommandResult
	 */
	enum class EAIBoolCommandResult : uint8_t
	{
		Passed = 0,
		Failed = 1,
		MAX    = 2
	};

	/**
	 * Enum OPP.EAICommandResult
	 */
	enum class EAICommandResult : uint8_t
	{
		Started     = 0,
		Success     = 1,
		Failed      = 2,
		Interrupted = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.EPressureConsumptionType
	 */
	enum class EPressureConsumptionType : uint8_t
	{
		SpawnedBot         = 0,
		ObjectiveCompleted = 1,
		MAX                = 2
	};

	/**
	 * Enum OPP.EPressureEventType
	 */
	enum class EPressureEventType : uint8_t
	{
		Adversity          = 0,
		PressureBeat       = 1,
		ObjectiveCompleted = 2,
		MAX                = 3
	};

	/**
	 * Enum OPP.EBotCollisionType
	 */
	enum class EBotCollisionType : uint8_t
	{
		None          = 0,
		HeadToHead    = 1,
		SideCollision = 2,
		TakeOver      = 3,
		Merge         = 4,
		MAX           = 5
	};

	/**
	 * Enum OPP.EAssistType
	 */
	enum class EAssistType : uint8_t
	{
		LocationAndVelocityPrediction        = 0,
		OnlyLocation                         = 1,
		OnlyVelocityPrediction               = 2,
		AverageLocationAndVelocityPrediction = 3,
		LocationToVelocityPredictionRange    = 4,
		MAX                                  = 5
	};

	/**
	 * Enum OPP.EPlayerVisibilityState
	 */
	enum class EPlayerVisibilityState : uint8_t
	{
		None    = 0,
		Partial = 1,
		Full    = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.EPlayerAwarenessState
	 */
	enum class EPlayerAwarenessState : uint8_t
	{
		Unaware       = 0,
		ForcedUnaware = 1,
		Aware         = 2,
		ForcedAware   = 3,
		MAX           = 4
	};

	/**
	 * Enum OPP.EPlayerVisibilityType
	 */
	enum class EPlayerVisibilityType : uint8_t
	{
		NotVisible        = 0,
		CloseFull         = 1,
		ClosePartial      = 2,
		FullVisionCone    = 3,
		PartialVisionCone = 4,
		MAX               = 5
	};

	/**
	 * Enum OPP.ERBAISpawnerVersion
	 */
	enum class ERBAISpawnerVersion : uint8_t
	{
		Initial           = 0,
		WithSpawnType     = 1,
		SoftMonsterCloset = 2,
		SoftLeashPtr      = 3,
		Current           = 4,
		MAX               = 5
	};

	/**
	 * Enum OPP.EAISpawnControlType
	 */
	enum class EAISpawnControlType : uint8_t
	{
		AIDirector    = 0,
		Always        = 1,
		RandomManager = 2,
		Manual        = 3,
		Objective     = 4,
		MAX           = 5
	};

	/**
	 * Enum OPP.EAISpawnerState
	 */
	enum class EAISpawnerState : uint8_t
	{
		Inactive = 0,
		Spawned  = 1,
		Limbo    = 2,
		MAX      = 3
	};

	/**
	 * Enum OPP.EBackgroundCharacterLocomotionState
	 */
	enum class EBackgroundCharacterLocomotionState : uint8_t
	{
		Idle     = 0,
		Starting = 1,
		Moving   = 2,
		Stopping = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.EAnimLogCategory
	 */
	enum class EAnimLogCategory : uint8_t
	{
		AnimatedStart    = 0,
		AnimatedStop     = 1,
		Startled         = 2,
		StartledReaction = 3,
		Attack           = 4,
		ActiveSkills     = 5,
		Investigate      = 6,
		SpecialMove      = 7,
		Other            = 8,
		MAX              = 9
	};

	/**
	 * Enum OPP.EInterruptibilityState
	 */
	enum class EInterruptibilityState : uint8_t
	{
		EnableInterruption  = 0,
		DisableInterruption = 1,
		Custom              = 2,
		MAX                 = 3
	};

	/**
	 * Enum OPP.EPlayerCameraTargetBehavior
	 */
	enum class EPlayerCameraTargetBehavior : uint8_t
	{
		Animation = 0,
		Manual    = 1,
		Gameplay  = 2,
		LookAt    = 3,
		None      = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.EPlayerDamageSetting
	 */
	enum class EPlayerDamageSetting : uint8_t
	{
		None                  = 0,
		PulledOutOfHidingSpot = 1,
		ThrownPlayer          = 2,
		InitialCoopTrap       = 3,
		MAX                   = 4
	};

	/**
	 * Enum OPP.ESpecialMoveNotifyTriggerType
	 */
	enum class ESpecialMoveNotifyTriggerType : uint8_t
	{
		All        = 0,
		PlayerOnly = 1,
		NPCOnly    = 2,
		MAX        = 3
	};

	/**
	 * Enum OPP.ENPCHidespotPeekDistance
	 */
	enum class ENPCHidespotPeekDistance : uint8_t
	{
		Close  = 0,
		Medium = 1,
		Far    = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.EItemConsumeAnimType
	 */
	enum class EItemConsumeAnimType : uint8_t
	{
		Standing = 0,
		Crouched = 1,
		Hidespot = 2,
		MAX      = 3
	};

	/**
	 * Enum OPP.EArmWreslingTableState
	 */
	enum class EArmWreslingTableState : uint8_t
	{
		WaitingForPlayers = 0,
		MatchIntro        = 1,
		MatchInProgress   = 2,
		MatchOutro        = 3,
		MAX               = 4
	};

	/**
	 * Enum OPP.EMusicEventType
	 */
	enum class EMusicEventType : uint8_t
	{
		MusicCommand         = 0,
		PostPlayEvent        = 1,
		PostStopEvent        = 2,
		SingleShotTrackEnded = 3,
		MAX                  = 4
	};

	/**
	 * Enum OPP.EAudioEventSource
	 */
	enum class EAudioEventSource : uint8_t
	{
		None               = 0,
		Generic            = 1,
		OldBlueprintNotify = 2,
		AnimNotify         = 3,
		VONotify           = 4,
		MAX                = 5
	};

	/**
	 * Enum OPP.EEmitterUpdateDetail
	 */
	enum class EEmitterUpdateDetail : uint8_t
	{
		Irrelevant = 0,
		VeryLow    = 1,
		Low        = 2,
		Normal     = 3,
		High       = 4,
		MAX        = 5
	};

	/**
	 * Enum OPP.EGameModeTestAction
	 */
	enum class EGameModeTestAction : uint8_t
	{
		None                = 0,
		SitInChair          = 1,
		StageReady          = 2,
		TeleportToSASExit   = 3,
		CheatCompleteStage  = 4,
		TeleportToStageExit = 5,
		CompleteStage       = 6,
		ReturnToLobby       = 7,
		MAX                 = 8
	};

	/**
	 * Enum OPP.EUIAvailableTaskState
	 */
	enum class EUIAvailableTaskState : uint8_t
	{
		Started   = 0,
		Completed = 1,
		MAX       = 2
	};

	/**
	 * Enum OPP.EBackgroundDoorState
	 */
	enum class EBackgroundDoorState : uint8_t
	{
		Closed = 0,
		Open   = 1,
		MAX    = 2
	};

	/**
	 * Enum OPP.EMinorObjectiveEffetOnMajor
	 */
	enum class EMinorObjectiveEffetOnMajor : uint8_t
	{
		None                                    = 0,
		CloseMajorPrimaryActorRoom              = 1,
		DelayMajorReadyFeedbackOnMinorCompleted = 2,
		DelayMajorEndingOnMinorCompleted        = 3,
		MAX                                     = 4
	};

	/**
	 * Enum OPP.EObjectiveCoordinatorPopulatePriority
	 */
	enum class EObjectiveCoordinatorPopulatePriority : uint8_t
	{
		Rails                = 0,
		PreDoorRandomization = 1,
		Highest              = 2,
		VeryHigh             = 3,
		High                 = 4,
		Normal               = 5,
		Low                  = 6,
		VeryLow              = 7,
		Lowest               = 8,
		MAX                  = 9
	};

	/**
	 * Enum OPP.EBlockableState
	 */
	enum class EBlockableState : uint8_t
	{
		Unknown            = 0,
		Opened             = 1,
		PermanentlyBlocked = 2,
		TemporaryBlocked   = 3,
		MAX                = 4
	};

	/**
	 * Enum OPP.EBlockableLinkType
	 */
	enum class EBlockableLinkType : uint8_t
	{
		MaximumBlockedCount   = 0,
		MinimunUnblockedCount = 1,
		AlsoBlock             = 2,
		MAX                   = 3
	};

	/**
	 * Enum OPP.EPlayerCollisionType
	 */
	enum class EPlayerCollisionType : uint8_t
	{
		Normal      = 0,
		FallingOnly = 1,
		MAX         = 2
	};

	/**
	 * Enum OPP.EBoolCommandResult
	 */
	enum class EBoolCommandResult : uint8_t
	{
		Passed = 0,
		Failed = 1,
		MAX    = 2
	};

	/**
	 * Enum OPP.ERandomSwitch10
	 */
	enum class ERandomSwitch10 : uint8_t
	{
		Option1  = 0,
		Option2  = 1,
		Option3  = 2,
		Option4  = 3,
		Option5  = 4,
		Option6  = 5,
		Option7  = 6,
		Option8  = 7,
		Option9  = 8,
		Option10 = 9,
		MAX      = 10
	};

	/**
	 * Enum OPP.ERandomSwitch5
	 */
	enum class ERandomSwitch5 : uint8_t
	{
		Option1 = 0,
		Option2 = 1,
		Option3 = 2,
		Option4 = 3,
		Option5 = 4,
		MAX     = 5
	};

	/**
	 * Enum OPP.ERandomSwitch4
	 */
	enum class ERandomSwitch4 : uint8_t
	{
		Option1 = 0,
		Option2 = 1,
		Option3 = 2,
		Option4 = 3,
		MAX     = 4
	};

	/**
	 * Enum OPP.ERandomSwitch3
	 */
	enum class ERandomSwitch3 : uint8_t
	{
		Option1 = 0,
		Option2 = 1,
		Option3 = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.ERandomSwitch2
	 */
	enum class ERandomSwitch2 : uint8_t
	{
		Option1 = 0,
		Option2 = 1,
		MAX     = 2
	};

	/**
	 * Enum OPP.EAISpawnSource
	 */
	enum class EAISpawnSource : uint8_t
	{
		InitialDirectorSpawn = 0,
		SpawnWave            = 1,
		SummonedByAIDirector = 2,
		AlwaysSpawn          = 3,
		RandomManager        = 4,
		External             = 5,
		FromLimbo            = 6,
		MAX                  = 7
	};

	/**
	 * Enum OPP.EAIDebugErrorFlags
	 */
	enum class EAIDebugErrorFlags : uint8_t
	{
		TargetPlayerUnreacheable = 0,
		DestUnreacheable         = 1,
		DestNotOnNavmesh         = 2,
		NotOnNavmesh             = 3,
		MAX                      = 4
	};

	/**
	 * Enum OPP.EAIDebugConfigFlags
	 */
	enum class EAIDebugConfigFlags : uint8_t
	{
		IgnoringPlayers = 0,
		Neutral         = 1,
		AlwaysChase     = 2,
		CanChase        = 3,
		CanSeePlayers   = 4,
		CanHearPlayers  = 5,
		CanInvestigate  = 6,
		CanBeDisturbed  = 7,
		CanAttack       = 8,
		MAX             = 9
	};

	/**
	 * Enum OPP.ERotationMode
	 */
	enum class ERotationMode : uint8_t
	{
		FaceVelocity = 0,
		FaceTarget   = 1,
		Explicit     = 2,
		MAX          = 3
	};

	/**
	 * Enum OPP.EMoveFailedReason
	 */
	enum class EMoveFailedReason : uint8_t
	{
		Unknown            = 0,
		AINotOnNavMesh     = 1,
		TargetNotOnNavMesh = 2,
		NoPathToTarget     = 3,
		Aborted            = 4,
		MAX                = 5
	};

	/**
	 * Enum OPP.EMoveType
	 */
	enum class EMoveType : uint8_t
	{
		None  = 0,
		Point = 1,
		Actor = 2,
		MAX   = 3
	};

	/**
	 * Enum OPP.EMoveResult
	 */
	enum class EMoveResult : uint8_t
	{
		None        = 0,
		Success     = 1,
		Failed      = 2,
		Interrupted = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.EMoveStatus
	 */
	enum class EMoveStatus : uint8_t
	{
		Idle    = 0,
		Waiting = 1,
		Paused  = 2,
		Moving  = 3,
		MAX     = 4
	};

	/**
	 * Enum OPP.EAIScriptedState
	 */
	enum class EAIScriptedState : uint8_t
	{
		None                = 0,
		MovingToAnchor      = 1,
		LoopingIdle         = 2,
		SingleShotAnim      = 3,
		ScriptedAnimStation = 4,
		ScriptedAttack      = 5,
		ScriptedStartled    = 6,
		MAX                 = 7
	};

	/**
	 * Enum OPP.ENPCMonsterClosetInteractionState
	 */
	enum class ENPCMonsterClosetInteractionState : uint8_t
	{
		None                     = 0,
		SpawnWarning             = 1,
		DoorOpeningRequested     = 2,
		NPCInMovement            = 3,
		UnspawnWaitingForNav     = 4,
		UnspawnWaitingForDestroy = 5,
		MAX                      = 6
	};

	/**
	 * Enum OPP.ESneakState
	 */
	enum class ESneakState : uint8_t
	{
		GotoLocation = 0,
		LookAround   = 1,
		MAX          = 2
	};

	/**
	 * Enum OPP.EPlayerAvoidanceState
	 */
	enum class EPlayerAvoidanceState : uint8_t
	{
		Avoidance         = 0,
		LastSegment       = 1,
		CheckSurroundings = 2,
		MAX               = 3
	};

	/**
	 * Enum OPP.EPlayerAvoidanceType
	 */
	enum class EPlayerAvoidanceType : uint8_t
	{
		RoomPathing    = 0,
		NavDestination = 1,
		MAX            = 2
	};

	/**
	 * Enum OPP.EImperativeActionType
	 */
	enum class EImperativeActionType : uint8_t
	{
		None      = 0,
		Radio     = 1,
		Generator = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.EWaypointValidityStatus
	 */
	enum class EWaypointValidityStatus : uint8_t
	{
		Valid        = 0,
		Disabled     = 1,
		CurrentPoint = 2,
		Unavailable  = 3,
		FilteredOut  = 4,
		Unreacheable = 5,
		MAX          = 6
	};

	/**
	 * Enum OPP.EPatrolType
	 */
	enum class EPatrolType : uint8_t
	{
		None            = 0,
		Route           = 1,
		Point           = 2,
		SingleWaypoint  = 3,
		AmbientActivity = 4,
		MAX             = 5
	};

	/**
	 * Enum OPP.EBreakableObstacleAnimStyle
	 */
	enum class EBreakableObstacleAnimStyle : uint8_t
	{
		WoodPlanks = 0,
		Window     = 1,
		MAX        = 2
	};

	/**
	 * Enum OPP.EBreakableLedgeMarkerBehavior
	 */
	enum class EBreakableLedgeMarkerBehavior : uint8_t
	{
		None           = 0,
		EnableOnBreak  = 1,
		DisableOnBreak = 2,
		MAX            = 3
	};

	/**
	 * Enum OPP.EWindowJumpOverType
	 */
	enum class EWindowJumpOverType : uint8_t
	{
		None       = 0,
		WalkToLand = 1,
		RunToLand  = 2,
		RunToFall  = 3,
		MAX        = 4
	};

	/**
	 * Enum OPP.ECustomizationInteractionType
	 */
	enum class ECustomizationInteractionType : uint8_t
	{
		ShopNone                   = 0,
		ShopBuy                    = 1,
		ShopNoneCantAfford         = 2,
		LockerEquip                = 3,
		LockerNoneForSale          = 4,
		LockerNoneCantAfford       = 5,
		NoneLocked                 = 6,
		LockerEquipAcquiredOptions = 7,
		ShopBuyMissingOptions      = 8,
		LockerNone                 = 9,
		ViewDLCContentPack         = 10,
		MAX                        = 11
	};

	/**
	 * Enum OPP.EDebugWorldOctreeObjectType
	 */
	enum class EDebugWorldOctreeObjectType : uint8_t
	{
		LedgeMarker              = 0,
		InteractionZoneComponent = 1,
		Triggerable              = 2,
		MAX                      = 3
	};

	/**
	 * Enum OPP.EDisplayDebugModifier
	 */
	enum class EDisplayDebugModifier : uint8_t
	{
		None             = 0,
		AnimInstance     = 1,
		AIConfig         = 2,
		AIPointSelection = 3,
		VO               = 4,
		MAX              = 5
	};

	/**
	 * Enum OPP.EFullScreenDebugInfoType
	 */
	enum class EFullScreenDebugInfoType : uint8_t
	{
		None                     = 0,
		Player                   = 1,
		AI                       = 2,
		PlayerAndAI              = 3,
		Physics                  = 4,
		TQ                       = 5,
		ActorInView              = 6,
		VO                       = 7,
		SoundEnvironment         = 8,
		AudioEvents              = 9,
		Music                    = 10,
		RTPC                     = 11,
		Streaming                = 12,
		Online                   = 13,
		Overseer                 = 14,
		WhoWasWhere              = 15,
		Objectives               = 16,
		GameplayAttributes       = 17,
		PlayerCustomization      = 18,
		ItemSpawning             = 19,
		Variators                = 20,
		AnimUsage                = 21,
		NPCRandomization         = 22,
		MovementNetwork          = 23,
		BackgroundCharacters     = 24,
		Rooms                    = 25,
		DoorRandomization        = 26,
		BlockableRandomization   = 27,
		HidespotRandomization    = 28,
		SpecialRooms             = 29,
		DarknessDetection        = 30,
		VoiceChat                = 31,
		PlayerStats              = 32,
		GameplayRandomization    = 33,
		SwitchMatchRandomization = 34,
		QuickGraphs              = 35,
		ChunkInstall             = 36,
		ModifiedOptions          = 37,
		UI                       = 38,
		SafeZone                 = 39,
		LobbyGameChess           = 40,
		MAX                      = 41
	};

	/**
	 * Enum OPP.ECollisionDebugViewType
	 */
	enum class ECollisionDebugViewType : uint8_t
	{
		None            = 0,
		SimpleLineDraw  = 1,
		SimpleMeshDraw  = 2,
		ComplexMeshDraw = 3,
		MAX             = 4
	};

	/**
	 * Enum OPP.EChessGamePlayerAnimState
	 */
	enum class EChessGamePlayerAnimState : uint8_t
	{
		WaitForOpponent  = 0,
		WaitForTurn      = 1,
		PlayTurn         = 2,
		RevertMove       = 3,
		MovePiece        = 4,
		TapChessClock    = 5,
		EndRoundReaction = 6,
		MAX              = 7
	};

	/**
	 * Enum OPP.EChessActionType
	 */
	enum class EChessActionType : uint8_t
	{
		Invalid     = 0,
		Move        = 1,
		Take        = 2,
		EnPassant   = 3,
		SmallCastle = 4,
		LongCastle  = 5,
		MAX         = 6
	};

	/**
	 * Enum OPP.ERBChunkRuleMode
	 */
	enum class ERBChunkRuleMode : uint8_t
	{
		Include = 0,
		Exclude = 1,
		MAX     = 2
	};

	/**
	 * Enum OPP.ECollectibleType
	 */
	enum class ECollectibleType : uint8_t
	{
		Document = 0,
		Photo    = 1,
		MAX      = 2
	};

	/**
	 * Enum OPP.EContainerPopulatedState
	 */
	enum class EContainerPopulatedState : uint8_t
	{
		Unpopulated = 0,
		Used        = 1,
		Empty       = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.EContainerSpawningType
	 */
	enum class EContainerSpawningType : uint8_t
	{
		StageOnly      = 0,
		RewardOnly     = 1,
		StageAndReward = 2,
		PuzzleRoom     = 3,
		ReviveStation  = 4,
		MAX            = 5
	};

	/**
	 * Enum OPP.EContainerSpawnLocationPriority
	 */
	enum class EContainerSpawnLocationPriority : uint8_t
	{
		Low    = 0,
		Normal = 1,
		High   = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.EPlayerBreathType
	 */
	enum class EPlayerBreathType : uint8_t
	{
		Run       = 0,
		Exhausted = 1,
		Pain      = 2,
		Crawl     = 3,
		MAX       = 4
	};

	/**
	 * Enum OPP.ESpectatorMode
	 */
	enum class ESpectatorMode : uint8_t
	{
		RequestedByPlayer  = 0,
		PlayingUnavailable = 1,
		PlayerDead         = 2,
		Cheat              = 3,
		Replay             = 4,
		MAX                = 5
	};

	/**
	 * Enum OPP.EDeadRepulsionType
	 */
	enum class EDeadRepulsionType : uint8_t
	{
		Box    = 0,
		Spline = 1,
		MAX    = 2
	};

	/**
	 * Enum OPP.EDestructibleActionType
	 */
	enum class EDestructibleActionType : uint8_t
	{
		AddDisplacement = 0,
		BreakInSphere   = 1,
		MAX             = 2
	};

	/**
	 * Enum OPP.EDisplayMessageViewMode
	 */
	enum class EDisplayMessageViewMode : uint8_t
	{
		WithOrWithoutNV = 0,
		OnlyNV          = 1,
		OnlyWithoutNV   = 2,
		MAX             = 3
	};

	/**
	 * Enum OPP.EDisplayMessagePriority
	 */
	enum class EDisplayMessagePriority : uint8_t
	{
		None        = 0,
		Low         = 1,
		BelowNormal = 2,
		Normal      = 3,
		AboveNormal = 4,
		High        = 5,
		MAX         = 6
	};

	/**
	 * Enum OPP.EDoorCollisionType
	 */
	enum class EDoorCollisionType : uint8_t
	{
		Full       = 0,
		Window     = 1,
		SeeThrough = 2,
		MAX        = 3
	};

	/**
	 * Enum OPP.EAudioDoorType
	 */
	enum class EAudioDoorType : uint8_t
	{
		SW_Door_Wood        = 0,
		SW_Door_Wood_Window = 1,
		SW_Door_MetalSolid  = 2,
		SW_Door_MetalGate   = 3,
		SW_Door_Type_Planks = 4,
		SW_Door_MAX         = 5
	};

	/**
	 * Enum OPP.EDoorRandomization
	 */
	enum class EDoorRandomization : uint8_t
	{
		Blockable        = 0,
		ReplaceableFront = 1,
		ReplaceableBack  = 2,
		TrappableFront   = 3,
		TrappableBack    = 4,
		Lockable         = 5,
		OpenCloseFront   = 6,
		OpenCloseBack    = 7,
		RewardRoomDoor   = 8,
		MAX              = 9
	};

	/**
	 * Enum OPP.EDoorLockerRandomAction
	 */
	enum class EDoorLockerRandomAction : uint8_t
	{
		UnlockDoor  = 0,
		LockDoor    = 1,
		UnblockDoor = 2,
		BlockDoor   = 3,
		RemoveLock  = 4,
		MAX         = 5
	};

	/**
	 * Enum OPP.EMapCheckType
	 */
	enum class EMapCheckType : uint8_t
	{
		EditorRoaming         = 0,
		EditorSelected        = 1,
		EditorErrored         = 2,
		EditorErroredSelected = 3,
		BuildMapCheck         = 4,
		MAX                   = 5
	};

	/**
	 * Enum OPP.EElectricFloorTrapState
	 */
	enum class EElectricFloorTrapState : uint8_t
	{
		Hidden               = 0,
		ActiveInitialization = 1,
		ActiveOff            = 2,
		ActiveWarning        = 3,
		ActiveOn             = 4,
		ActiveTriggered      = 5,
		Inactive             = 6,
		Broken               = 7,
		MAX                  = 8
	};

	/**
	 * Enum OPP.EElectrocutionSwitchState
	 */
	enum class EElectrocutionSwitchState : uint8_t
	{
		Idle              = 0,
		Intro             = 1,
		Starting          = 2,
		Active            = 3,
		ActiveOverloading = 4,
		Overloaded        = 5,
		MAX               = 6
	};

	/**
	 * Enum OPP.ENPCSpecificGesture
	 */
	enum class ENPCSpecificGesture : uint8_t
	{
		Neutral     = 0,
		Angry       = 1,
		Sad         = 2,
		Pain        = 3,
		PainIntense = 4,
		Struggle    = 5,
		Happy       = 6,
		Surprised   = 7,
		Tired       = 8,
		MAX         = 9
	};

	/**
	 * Enum OPP.ENPCBaseEmotion
	 */
	enum class ENPCBaseEmotion : uint8_t
	{
		Relaxed    = 0,
		Suspicious = 1,
		Alerted    = 2,
		Chase      = 3,
		MAX        = 4
	};

	/**
	 * Enum OPP.EPlayerInjuryLevel
	 */
	enum class EPlayerInjuryLevel : uint8_t
	{
		NotInjured        = 0,
		SlightlyInjured   = 1,
		ModeratelyInjured = 2,
		HighlyInjured     = 3,
		MAX               = 4
	};

	/**
	 * Enum OPP.EPlayerSpecificGesture
	 */
	enum class EPlayerSpecificGesture : uint8_t
	{
		Default     = 0,
		Neutral     = 1,
		Content     = 2,
		Angry       = 3,
		Sad         = 4,
		Pain        = 5,
		PainIntense = 6,
		Tired       = 7,
		Struggle    = 8,
		Smile       = 9,
		Surprised   = 10,
		Bored       = 11,
		MAX         = 12
	};

	/**
	 * Enum OPP.EGridType
	 */
	enum class EGridType : uint8_t
	{
		Relative = 0,
		World    = 1,
		MAX      = 2
	};

	/**
	 * Enum OPP.EGlobalAIEvaluationType
	 */
	enum class EGlobalAIEvaluationType : uint8_t
	{
		SingleBot = 0,
		AnyBot    = 1,
		MAX       = 2
	};

	/**
	 * Enum OPP.EMainMenuButton
	 */
	enum class EMainMenuButton : uint8_t
	{
		EnterLobby     = 0,
		ReplayTutorial = 1,
		Options        = 2,
		Credits        = 3,
		Quit           = 4,
		MAX            = 5
	};

	/**
	 * Enum OPP.EGameplayTriggerType
	 */
	enum class EGameplayTriggerType : uint8_t
	{
		Pushable = 0,
		NPC      = 1,
		MAX      = 2
	};

	/**
	 * Enum OPP.ETriggerType
	 */
	enum class ETriggerType : uint8_t
	{
		Trigger   = 0,
		Untrigger = 1,
		MAX       = 2
	};

	/**
	 * Enum OPP.EOptionsErrorCode
	 */
	enum class EOptionsErrorCode : uint8_t
	{
		Default          = 0,
		NvidiaCard       = 1,
		RaytracingReboot = 2,
		MainMenuOnly     = 3,
		None             = 4,
		MAX              = 5
	};

	/**
	 * Enum OPP.EOptionsMenuOption
	 */
	enum class EOptionsMenuOption : uint8_t
	{
		None                             = 0,
		WindowMode                       = 1,
		Resolution                       = 2,
		ResolutionScale                  = 3,
		VSync                            = 4,
		RefreshRate                      = 5,
		DisplayDevice                    = 6,
		FrameLimit                       = 7,
		CalibrationScreen                = 8,
		Brightness                       = 9,
		HDREnabled                       = 10,
		HDRPeakBrightness                = 11,
		HDRPaperwhite                    = 12,
		HDRUserInterfaceBrightness       = 13,
		QualityPreset                    = 14,
		ViewDistance                     = 15,
		Shadows                          = 16,
		AntiAliasing                     = 17,
		Texture                          = 18,
		Effects                          = 19,
		Reflections                      = 20,
		Volumetrics                      = 21,
		AutoDetectQuality                = 22,
		Direct3DVersion                  = 23,
		MotionBlur                       = 24,
		DLSS                             = 25,
		FSR2                             = 26,
		EnableRT                         = 27,
		RTShadows                        = 28,
		RTReflections                    = 29,
		MasterVolume                     = 30,
		MusicVolume                      = 31,
		EffectsVolume                    = 32,
		EnableVoiceChat                  = 33,
		VoiceChatPartyOnly               = 34,
		VoiceChatInputDevice             = 35,
		VoiceChatVolume                  = 36,
		MicrophoneVolume                 = 37,
		PushToTalk                       = 38,
		VoiceActivityDetectorAuto        = 39,
		VoiceActivityDetectorHangover    = 40,
		VoiceActivityDetectorSensitivity = 41,
		VoiceActivityDetectorNoiseFloor  = 42,
		MicTest                          = 43,
		LookSensitivityMouse             = 44,
		LookSensitivityControllerYaw     = 45,
		LookSensitivityControllerPitch   = 46,
		ToggleRun                        = 47,
		AutoHideItemInHand               = 48,
		InputBindings                    = 49,
		InvertXAxis                      = 50,
		InvertYAxis                      = 51,
		GamepadControlScheme             = 52,
		ResetMenuTutorials               = 53,
		ResetNonMenuTutorials            = 54,
		Crossplay                        = 55,
		Region                           = 56,
		InterfacePreset                  = 57,
		HealthDisplay                    = 58,
		StaminaDisplay                   = 59,
		SanityDisplay                    = 60,
		NoiseDisplay                     = 61,
		DarknessDisplay                  = 62,
		InventoryDisplay                 = 63,
		ObjectiveDisplay                 = 64,
		CrosshairDisplay                 = 65,
		TeammateStatusHUDDisplay         = 66,
		TeammateStatusInWorldDisplay     = 67,
		TeammateStatusOutsideViewDisplay = 68,
		FriendsOnlineStatusNotifications = 69,
		AllowFriendRequestNotifications  = 70,
		AllowPartyInviteNotifications    = 71,
		AudioLanguage                    = 72,
		TextLanguage                     = 73,
		SubtitlesEnabled                 = 74,
		SubtitlesLanguage                = 75,
		SubtitlesFontSize                = 76,
		SubtitlesBackground              = 77,
		HeadBobbingEnabled               = 78,
		TinnitusFilter                   = 79,
		Max                              = 80
	};

	/**
	 * Enum OPP.EPlayerBarState
	 */
	enum class EPlayerBarState : uint8_t
	{
		Default = 0,
		Base    = 1,
		Upper   = 2,
		Boost   = 3,
		Temp    = 4,
		Damage  = 5,
		MAX     = 6
	};

	/**
	 * Enum OPP.ECustomGhostFinishState
	 */
	enum class ECustomGhostFinishState : uint8_t
	{
		Success = 0,
		Failed  = 1,
		MAX     = 2
	};

	/**
	 * Enum OPP.EHackQuadrantState
	 */
	enum class EHackQuadrantState : uint8_t
	{
		Failure = 0,
		Neutral = 1,
		Success = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.EHidespotVerticalDirection
	 */
	enum class EHidespotVerticalDirection : uint8_t
	{
		Forward       = 0,
		ForwardRight  = 1,
		Right         = 2,
		BackwardRight = 3,
		Backward      = 4,
		BackwardLeft  = 5,
		Left          = 6,
		ForwardLeft   = 7,
		MAX           = 8
	};

	/**
	 * Enum OPP.EAdjustmentType
	 */
	enum class EAdjustmentType : uint8_t
	{
		None                = 0,
		LocationAndRotation = 1,
		LocationOnly        = 2,
		RotationOnly        = 3,
		LookAtWithDistance  = 4,
		LookAtOnPlace       = 5,
		MAX                 = 6
	};

	/**
	 * Enum OPP.EInteractionPriority
	 */
	enum class EInteractionPriority : uint8_t
	{
		None        = 0,
		Low         = 1,
		BelowNormal = 2,
		Normal      = 3,
		AboveNormal = 4,
		High        = 5,
		MAX         = 6
	};

	/**
	 * Enum OPP.EInvestigationRotationAlignBehavior
	 */
	enum class EInvestigationRotationAlignBehavior : uint8_t
	{
		None                      = 0,
		LookAtThisPoint           = 1,
		LookAtTarget              = 2,
		LookInDirection           = 3,
		LookInAxisEitherDirection = 4,
		LookInPlayerDirection     = 5,
		MAX                       = 6
	};

	/**
	 * Enum OPP.EItemProgressionCategory
	 */
	enum class EItemProgressionCategory : uint8_t
	{
		None                = 0,
		ActiveSkill         = 1,
		ActiveSkillUpgrade  = 2,
		Perk                = 3,
		CharacterUpgrade    = 4,
		CustomizationOption = 5,
		CellItem            = 6,
		Count               = 7,
		MAX                 = 8
	};

	/**
	 * Enum OPP.EItemSpawningManagerState
	 */
	enum class EItemSpawningManagerState : uint8_t
	{
		Unpopulated                           = 0,
		RemoveContainersOutsideTrial          = 1,
		GatherItemRemovingActors              = 2,
		SetupReviveContainers                 = 3,
		PopulatingReviveContainers            = 4,
		RemoveContainersCloseToObjectives     = 5,
		RemoveContainersCloseToRandomHelpers  = 6,
		RemoveContainersBlockedByHidespot     = 7,
		SortActors                            = 8,
		SetupRewardRooms                      = 9,
		PopulatingRewardRoomsFirstCurrency    = 10,
		PopulatingRewardRooms                 = 11,
		SetupStageContainers                  = 12,
		SetupContainerLocks                   = 13,
		PopulatingMandatoryLockedPrimaryItems = 14,
		PopulatingLockedPrimaryItems          = 15,
		PopulatingLockedSecondaryItems        = 16,
		PopulatingStageContainers             = 17,
		SetupContainerTraps                   = 18,
		PopulatingContainerTraps              = 19,
		Populated                             = 20,
		MAX                                   = 21
	};

	/**
	 * Enum OPP.EItemLockType
	 */
	enum class EItemLockType : uint8_t
	{
		AllowedSecondaryItem    = 0,
		CannotBeLocked          = 1,
		PrimaryAndSecondaryItem = 2,
		PrimaryItemOnly         = 3,
		MandatoryPrimaryItem    = 4,
		MAX                     = 5
	};

	/**
	 * Enum OPP.EJumpScareFlags
	 */
	enum class EJumpScareFlags : uint8_t
	{
		InvalidIfRunning         = 0,
		InvalidIfWalking         = 1,
		InvalidIfCrouched        = 2,
		InvalidIfChased          = 3,
		InvalidIfKnockedDown     = 4,
		InvalidIfInDifferentRoom = 5,
		TriggerOnLineOfSight     = 6,
		UseRoomVolume            = 7,
		MAX                      = 8
	};

	/**
	 * Enum OPP.ELeashType
	 */
	enum class ELeashType : uint8_t
	{
		CantLeave = 0,
		CantEnter = 1,
		MAX       = 2
	};

	/**
	 * Enum OPP.ELedgeCoopMoveType
	 */
	enum class ELedgeCoopMoveType : uint8_t
	{
		None           = 0,
		CoopWall       = 1,
		CoopThrowCatch = 2,
		CoopClimbOver  = 3,
		MAX            = 4
	};

	/**
	 * Enum OPP.EHybridLightChannel
	 */
	enum class EHybridLightChannel : uint8_t
	{
		None  = 0,
		Red   = 1,
		Blue  = 2,
		Green = 3,
		MAX   = 4
	};

	/**
	 * Enum OPP.EMuffleLevel
	 */
	enum class EMuffleLevel : uint8_t
	{
		Off  = 0,
		Low  = 1,
		High = 2,
		MAX  = 3
	};

	/**
	 * Enum OPP.ERBMicrophoneTestState
	 */
	enum class ERBMicrophoneTestState : uint8_t
	{
		Disabled   = 0,
		Connecting = 1,
		Connected  = 2,
		MAX        = 3
	};

	/**
	 * Enum OPP.EMinigameState
	 */
	enum class EMinigameState : uint8_t
	{
		Deactivated             = 0,
		ActivatedNotStarted     = 1,
		ActivatedNotCompleted   = 2,
		ActivatedPrizeAvailable = 3,
		Completed               = 4,
		MAX                     = 5
	};

	/**
	 * Enum OPP.EMonsterClosetState
	 */
	enum class EMonsterClosetState : uint8_t
	{
		Closed = 0,
		Open   = 1,
		Moving = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ERBSpecialMoveDesyncType
	 */
	enum class ERBSpecialMoveDesyncType : uint8_t
	{
		None               = 0,
		Timestamp          = 1,
		SpecialMoveIndex   = 2,
		SpecialMoveType    = 3,
		LocomotionMoveType = 4,
		Interactible       = 5,
		Stamina            = 6,
		Direction          = 7,
		Location           = 8,
		Prediction         = 9,
		MAX                = 10
	};

	/**
	 * Enum OPP.ENetworkSyncType
	 */
	enum class ENetworkSyncType : uint8_t
	{
		ForwardOnce  = 0,
		BackwardOnce = 1,
		PingPong     = 2,
		PingPongSine = 3,
		ForwardLoop  = 4,
		BackwardLoop = 5,
		Noise        = 6,
		MAX          = 7
	};

	/**
	 * Enum OPP.ENPCInterruptActionType
	 */
	enum class ENPCInterruptActionType : uint8_t
	{
		None                  = 0,
		LightBulbExplodeReact = 1,
		ThrowableBody         = 2,
		ThrowableHead         = 3,
		Shove                 = 4,
		HealSlowdown          = 5,
		BlindMine             = 6,
		AmpHit                = 7,
		Amp                   = 8,
		MAX                   = 9
	};

	/**
	 * Enum OPP.ENPCAnimSetStyle
	 */
	enum class ENPCAnimSetStyle : uint8_t
	{
		HH  = 0,
		H1  = 1,
		H2  = 2,
		MAX = 3
	};

	/**
	 * Enum OPP.ENPCCustomizationSlot
	 */
	enum class ENPCCustomizationSlot : uint8_t
	{
		Hair      = 0,
		Head      = 1,
		Watch     = 2,
		UpperBody = 3,
		LowerBody = 4,
		None      = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.ESeparatorTubeState
	 */
	enum class ESeparatorTubeState : uint8_t
	{
		AllClosed   = 0,
		OpenOutside = 1,
		OpenInside  = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.ENVState
	 */
	enum class ENVState : uint8_t
	{
		Off         = 0,
		OnPowered   = 1,
		OnUnPowered = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.ENVSoundType
	 */
	enum class ENVSoundType : uint8_t
	{
		TurnOn           = 0,
		TurnOnLowBattery = 1,
		OutOfBattery     = 2,
		Repowered        = 3,
		TurnOff          = 4,
		MAX              = 5
	};

	/**
	 * Enum OPP.EObjectiveGroupCompletionLogic
	 */
	enum class EObjectiveGroupCompletionLogic : uint8_t
	{
		AllObjectivesCompleted      = 0,
		AnyObjectiveCompleted       = 1,
		SpecificObjectivesCompleted = 2,
		MAX                         = 3
	};

	/**
	 * Enum OPP.EOptionsMenuValueType
	 */
	enum class EOptionsMenuValueType : uint8_t
	{
		None     = 0,
		Bool     = 1,
		Int      = 2,
		Float    = 3,
		IntPoint = 4,
		String   = 5,
		MAX      = 6
	};

	/**
	 * Enum OPP.EControlSchemeActionType
	 */
	enum class EControlSchemeActionType : uint8_t
	{
		None                = 0,
		Aim                 = 1,
		UseItem_Throw       = 2,
		PeekLeft            = 3,
		PeekRight           = 4,
		Run                 = 5,
		Move                = 6,
		Camera              = 7,
		Ping_TalkWheel      = 8,
		InventoryScrollUp   = 9,
		InventoryScrollDown = 10,
		Trade_Drop          = 11,
		Trade               = 12,
		Drop                = 13,
		NightVision         = 14,
		Interact            = 15,
		Crouch_Toggle       = 16,
		Jump                = 17,
		Menu                = 18,
		Objective           = 19,
		MAX                 = 20
	};

	/**
	 * Enum OPP.EOptionsTabType
	 */
	enum class EOptionsTabType : uint8_t
	{
		None     = 0,
		General  = 1,
		Controls = 2,
		Graphics = 3,
		Audio    = 4,
		Network  = 5,
		MAX      = 6
	};

	/**
	 * Enum OPP.EPawnSearchFlags
	 */
	enum class EPawnSearchFlags : uint8_t
	{
		None              = 0,
		IgnoreBots        = 1,
		IgnorePlayers     = 2,
		FavorBots         = 3,
		FavorPlayers      = 4,
		PrioritizeBots    = 5,
		PrioritizePlayers = 6,
		IgnoreSpectre     = 7,
		MAX               = 8
	};

	/**
	 * Enum OPP.ETraversalLedgeAngleType
	 */
	enum class ETraversalLedgeAngleType : uint8_t
	{
		Flat          = 0,
		Angled45Right = 1,
		Angled45Left  = 2,
		MAX           = 3
	};

	/**
	 * Enum OPP.EDizzinessType
	 */
	enum class EDizzinessType : uint8_t
	{
		Unspecified = 0,
		Psychosis   = 1,
		Screamer    = 2,
		Scripted    = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.ELandOntoLedgeType
	 */
	enum class ELandOntoLedgeType : uint8_t
	{
		Land25    = 0,
		RunJump25 = 1,
		Land50    = 2,
		Land100   = 3,
		MAX       = 4
	};

	/**
	 * Enum OPP.ECantShoveReason
	 */
	enum class ECantShoveReason : uint8_t
	{
		Cooldown = 0,
		MAX      = 1
	};

	/**
	 * Enum OPP.EShowItemCategory
	 */
	enum class EShowItemCategory : uint8_t
	{
		Fist        = 0,
		SmallWeapon = 1,
		HealthItem  = 2,
		Utility     = 3,
		All         = 4,
		MAX         = 5
	};

	/**
	 * Enum OPP.ECameraShakeType
	 */
	enum class ECameraShakeType : uint8_t
	{
		Gameplay            = 0,
		Scripted            = 1,
		Psychosis           = 2,
		Pushable            = 3,
		Sliding             = 4,
		GruntFootstep       = 5,
		StumblingDownStairs = 6,
		Screamer            = 7,
		MAX                 = 8
	};

	/**
	 * Enum OPP.EPlayerCustomizationSexQueryType
	 */
	enum class EPlayerCustomizationSexQueryType : uint8_t
	{
		All    = 0,
		Male   = 1,
		Female = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ECustomizationItemAvailability
	 */
	enum class ECustomizationItemAvailability : uint8_t
	{
		None                = 0,
		ForSale             = 1,
		Locked              = 2,
		LockedRequiresDLC   = 3,
		Acquired            = 4,
		CantAfford          = 5,
		SomeOptionsAcquired = 6,
		MAX                 = 7
	};

	/**
	 * Enum OPP.EPlayerGameSessionTransitionType
	 */
	enum class EPlayerGameSessionTransitionType : uint8_t
	{
		None                    = 0,
		JoiningParty            = 1,
		JoiningPartyGameSession = 2,
		FindingNewLobbyForParty = 3,
		WaitingForNewLobby      = 4,
		ReturningToLobby        = 5,
		MAX                     = 6
	};

	/**
	 * Enum OPP.EMenuUpgradeItemState
	 */
	enum class EMenuUpgradeItemState : uint8_t
	{
		Locked                  = 0,
		Available               = 1,
		AvailableNoRessources   = 2,
		Acquired                = 3,
		LockedGeneric           = 4,
		LockedNeedPlayerLevelUp = 5,
		LockedNeedItem          = 6,
		LockedNeedUnlock        = 7,
		MAX                     = 8
	};

	/**
	 * Enum OPP.ERespawnerState
	 */
	enum class ERespawnerState : uint8_t
	{
		Available               = 0,
		WaitingForPlayerToSpawn = 1,
		OpeningDoors            = 2,
		WaitingForPlayerToExit  = 3,
		ClosingDoors            = 4,
		MAX                     = 5
	};

	/**
	 * Enum OPP.EPlayerStatContextType
	 */
	enum class EPlayerStatContextType : uint8_t
	{
		Global    = 0,
		Character = 1,
		Trial     = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.EPlayerTrialRating
	 */
	enum class EPlayerTrialRating : uint8_t
	{
		F       = 0,
		D       = 1,
		DPlus   = 2,
		CMinus  = 3,
		C       = 4,
		CPlus   = 5,
		BMinus  = 6,
		B       = 7,
		BPlus   = 8,
		AMinus  = 9,
		A       = 10,
		APlus   = 11,
		Invalid = 12,
		MAX     = 13
	};

	/**
	 * Enum OPP.EPlayerBadgeThresholdOperator
	 */
	enum class EPlayerBadgeThresholdOperator : uint8_t
	{
		Greater      = 0,
		GreaterEqual = 1,
		Lower        = 2,
		LowerEqual   = 3,
		Equal        = 4,
		MAX          = 5
	};

	/**
	 * Enum OPP.EPlayerStatAggregationType
	 */
	enum class EPlayerStatAggregationType : uint8_t
	{
		Increment = 0,
		Minimum   = 1,
		Maximum   = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.EPlayerTriggerType
	 */
	enum class EPlayerTriggerType : uint8_t
	{
		SelectCondition        = 0,
		AllPlayer              = 1,
		HalfOfAllPlayer        = 2,
		SpecificNumberOfPlayer = 3,
		MAX                    = 4
	};

	/**
	 * Enum OPP.EPressureValveType
	 */
	enum class EPressureValveType : uint8_t
	{
		Unspecified          = 0,
		ActiveConnected      = 1,
		ActiveDisconnected   = 2,
		InactiveConnected    = 3,
		InactiveDisconnected = 4,
		MAX                  = 5
	};

	/**
	 * Enum OPP.EProximityDetectorDeviceType
	 */
	enum class EProximityDetectorDeviceType : uint8_t
	{
		TriggerOnly        = 0,
		DetectorOnly       = 1,
		DetectorAndTrigger = 2,
		MAX                = 3
	};

	/**
	 * Enum OPP.EProximityDetectorZLevelState
	 */
	enum class EProximityDetectorZLevelState : uint8_t
	{
		None         = 0,
		TargeLeveled = 1,
		TargetAbove  = 2,
		TargetBelow  = 3,
		MAX          = 4
	};

	/**
	 * Enum OPP.EProximityDetectorDeviceState
	 */
	enum class EProximityDetectorDeviceState : uint8_t
	{
		Off         = 0,
		DetectedOff = 1,
		Charging    = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.EPsychosisMineState
	 */
	enum class EPsychosisMineState : uint8_t
	{
		None      = 0,
		Deployed  = 1,
		Activated = 2,
		Broken    = 3,
		Expired   = 4,
		Finished  = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.EPushableDirection
	 */
	enum class EPushableDirection : uint8_t
	{
		Forward  = 0,
		Backward = 1,
		Right    = 2,
		Left     = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.ERandomAmbientSoundType
	 */
	enum class ERandomAmbientSoundType : uint8_t
	{
		Small  = 0,
		Medium = 1,
		Large  = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ERandomGroupIgnoreRule
	 */
	enum class ERandomGroupIgnoreRule : uint8_t
	{
		RandomGroup    = 0,
		AnyRandomActor = 1,
		AllRandomActor = 2,
		MAX            = 3
	};

	/**
	 * Enum OPP.ERandomState
	 */
	enum class ERandomState : uint8_t
	{
		None   = 0,
		StateA = 1,
		StateB = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ELedgeMarkerSetup
	 */
	enum class ELedgeMarkerSetup : uint8_t
	{
		EnabledWhenHidden  = 0,
		EnabledWhenVisible = 1,
		MAX                = 2
	};

	/**
	 * Enum OPP.ESoundConnectorSetup
	 */
	enum class ESoundConnectorSetup : uint8_t
	{
		ActiveOpen   = 0,
		ActiveClosed = 1,
		Inactive     = 2,
		MAX          = 3
	};

	/**
	 * Enum OPP.ERandomManagerUpdatingPriority
	 */
	enum class ERandomManagerUpdatingPriority : uint8_t
	{
		High   = 0,
		Normal = 1,
		Low    = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ERandomManagerPopulatingOrder
	 */
	enum class ERandomManagerPopulatingOrder : uint8_t
	{
		Gates = 0,
		Traps = 1,
		MAX   = 2
	};

	/**
	 * Enum OPP.ERandomManagerExecutionOrder
	 */
	enum class ERandomManagerExecutionOrder : uint8_t
	{
		First                     = 0,
		Rails                     = 1,
		Gates                     = 2,
		Earlier                   = 3,
		SomewhatEarlier           = 4,
		Normal                    = 5,
		SomewhatLater             = 6,
		Later                     = 7,
		Last                      = 8,
		UsePopulatingOrderInstead = 9,
		MAX                       = 10
	};

	/**
	 * Enum OPP.ERepulsionReactionFilter
	 */
	enum class ERepulsionReactionFilter : uint8_t
	{
		All         = 0,
		OnlyPlayers = 1,
		OnlyNPCs    = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.ERepulsionReactionType
	 */
	enum class ERepulsionReactionType : uint8_t
	{
		None  = 0,
		Light = 1,
		Heavy = 2,
		MAX   = 3
	};

	/**
	 * Enum OPP.ERepulsionRuleType
	 */
	enum class ERepulsionRuleType : uint8_t
	{
		All            = 0,
		SpecificActors = 1,
		Others         = 2,
		AllPlayers     = 3,
		AllNPCs        = 4,
		Except         = 5,
		None           = 6,
		MAX            = 7
	};

	/**
	 * Enum OPP.ERepulsionShape
	 */
	enum class ERepulsionShape : uint8_t
	{
		Box      = 0,
		Cylinder = 1,
		MAX      = 2
	};

	/**
	 * Enum OPP.ERepulsionDirectionFlags
	 */
	enum class ERepulsionDirectionFlags : uint8_t
	{
		Forward  = 0,
		Backward = 1,
		Right    = 2,
		Left     = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.ERoomSize
	 */
	enum class ERoomSize : uint8_t
	{
		VerySmall = 0,
		Small     = 1,
		Medium    = 2,
		Large     = 3,
		MAX       = 4
	};

	/**
	 * Enum OPP.ERoomType
	 */
	enum class ERoomType : uint8_t
	{
		Normal   = 0,
		CoopOnly = 1,
		MAX      = 2
	};

	/**
	 * Enum OPP.ERoomConnectionType
	 */
	enum class ERoomConnectionType : uint8_t
	{
		Normal      = 0,
		Coop        = 1,
		CrouchUnder = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.ERoomConnectionState
	 */
	enum class ERoomConnectionState : uint8_t
	{
		Open              = 0,
		Closed            = 1,
		ClosedTemporarily = 2,
		ClosedForQuery    = 3,
		MAX               = 4
	};

	/**
	 * Enum OPP.ESASTransitionDirection
	 */
	enum class ESASTransitionDirection : uint8_t
	{
		Invalid     = 0,
		MapEntrance = 1,
		MapExit     = 2,
		Random      = 3,
		Deprecated  = 4,
		MAX         = 5
	};

	/**
	 * Enum OPP.AutoDoorState
	 */
	enum class EAutoDoorState : uint8_t
	{
		AutoDoorState_Closed                = 0,
		AutoDoorState_Open                  = 1,
		AutoDoorState_WaitingForPlayerEnter = 2,
		AutoDoorState_WaitingForPlayerExit  = 3,
		AutoDoorState_AutoDoorState_MAX     = 4
	};

	/**
	 * Enum OPP.EScriptedAnimSlotType
	 */
	enum class EScriptedAnimSlotType : uint8_t
	{
		Disabled     = 0,
		NPC          = 1,
		AnimatedMesh = 2,
		MAX          = 3
	};

	/**
	 * Enum OPP.ESimpleObjectiveType
	 */
	enum class ESimpleObjectiveType : uint8_t
	{
		Custom            = 0,
		GotoTriggerVolume = 1,
		Interact          = 2,
		Operate           = 3,
		Trigger           = 4,
		MoveObjectTo      = 5,
		UseOnObject       = 6,
		MAX               = 7
	};

	/**
	 * Enum OPP.EDoorLockType
	 */
	enum class EDoorLockType : uint8_t
	{
		SlidingLock      = 0,
		DoubleDoorPlanks = 1,
		MetalBar         = 2,
		MAX              = 3
	};

	/**
	 * Enum OPP.ESocialMenuSceneActorType
	 */
	enum class ESocialMenuSceneActorType : uint8_t
	{
		Invalid     = 0,
		SocialMenu  = 1,
		PhotoFinish = 2,
		MAX         = 3
	};

	/**
	 * Enum OPP.ESocialMenuSceneActorSlot
	 */
	enum class ESocialMenuSceneActorSlot : uint8_t
	{
		Single = 0,
		Party1 = 1,
		Party2 = 2,
		Party3 = 3,
		Party4 = 4,
		MAX    = 5
	};

	/**
	 * Enum OPP.ERBSocialMenuEntryFlag
	 */
	enum class ERBSocialMenuEntryFlag : uint8_t
	{
		IsSelf                           = 0,
		InCurrentGame                    = 1,
		PartyOwner                       = 2,
		PartyMember                      = 3,
		PendingPartyInvite               = 4,
		Friend                           = 5,
		PlatformFriend                   = 6,
		PendingFriendRequest             = 7,
		PendingSentFriendRequest         = 8,
		PlatformPendingFriendRequest     = 9,
		PlatformPendingSentFriendRequest = 10,
		PlatformBlocked                  = 11,
		MAX                              = 12
	};

	/**
	 * Enum OPP.ERBSocialMenuEntryListType
	 */
	enum class ERBSocialMenuEntryListType : uint8_t
	{
		Unknown           = 0,
		Party             = 1,
		Friends           = 2,
		RecentExperiments = 3,
		Lobby             = 4,
		Blocked           = 5,
		PartyInvite       = 6,
		MAX               = 7
	};

	/**
	 * Enum OPP.ESoundTrapActivator
	 */
	enum class ESoundTrapActivator : uint8_t
	{
		NPC        = 0,
		Player     = 1,
		Projectile = 2,
		MAX        = 3
	};

	/**
	 * Enum OPP.ESoundVolumeType
	 */
	enum class ESoundVolumeType : uint8_t
	{
		ST_Volume_Interior = 0,
		ST_Volume_Exterior = 1,
		ST_Volume_MAX      = 2
	};

	/**
	 * Enum OPP.EAreaExitPointType
	 */
	enum class EAreaExitPointType : uint8_t
	{
		None  = 0,
		Point = 1,
		Line  = 2,
		Door  = 3,
		MAX   = 4
	};

	/**
	 * Enum OPP.EStalkingObjectiveType
	 */
	enum class EStalkingObjectiveType : uint8_t
	{
		StealthStalk = 0,
		PackHunt     = 1,
		MAX          = 2
	};

	/**
	 * Enum OPP.EStreamingCommandType
	 */
	enum class EStreamingCommandType : uint8_t
	{
		PrepareMapChange       = 0,
		CancelPendingMapChange = 1,
		UnloadLevels           = 2,
		CommitMapChange        = 3,
		MAX                    = 4
	};

	/**
	 * Enum OPP.EFlipSwitchState
	 */
	enum class EFlipSwitchState : uint8_t
	{
		None    = 0,
		Removed = 1,
		On      = 2,
		Off     = 3,
		Hidden  = 4,
		MAX     = 5
	};

	/**
	 * Enum OPP.ESwitchPanelPartType
	 */
	enum class ESwitchPanelPartType : uint8_t
	{
		Toggle        = 0,
		LookAt        = 1,
		InputRotation = 2,
		MAX           = 3
	};

	/**
	 * Enum OPP.ETaskState
	 */
	enum class ETaskState : uint8_t
	{
		Pending    = 0,
		InProgress = 1,
		Completed  = 2,
		MAX        = 3
	};

	/**
	 * Enum OPP.ETaskProgressionDisplayType
	 */
	enum class ETaskProgressionDisplayType : uint8_t
	{
		None    = 0,
		Counter = 1,
		MAX     = 2
	};

	/**
	 * Enum OPP.ETaskType
	 */
	enum class ETaskType : uint8_t
	{
		Daily  = 0,
		Weekly = 1,
		MAX    = 2
	};

	/**
	 * Enum OPP.ERBTextChatType
	 */
	enum class ERBTextChatType : uint8_t
	{
		Notification       = 0,
		PartyNotification  = 1,
		FriendNotification = 2,
		TalkWheel          = 3,
		MAX                = 4
	};

	/**
	 * Enum OPP.ETrapScenarioState
	 */
	enum class ETrapScenarioState : uint8_t
	{
		Removed = 0,
		Added   = 1,
		MAX     = 2
	};

	/**
	 * Enum OPP.ELinkedMarkersActivationLogic
	 */
	enum class ELinkedMarkersActivationLogic : uint8_t
	{
		ActivateOnTriggered     = 0,
		DeactivateOnTriggered   = 1,
		ActivateOnUntriggered   = 2,
		DeactivateOnUntriggered = 3,
		MAX                     = 4
	};

	/**
	 * Enum OPP.EOverrideOperatorAction
	 */
	enum class EOverrideOperatorAction : uint8_t
	{
		DoNothing              = 0,
		OverrideOnActivation   = 1,
		OverrideOnDeactivation = 2,
		MAX                    = 3
	};

	/**
	 * Enum OPP.ENPCBlendOutCondition
	 */
	enum class ENPCBlendOutCondition : uint8_t
	{
		None     = 0,
		Chase    = 1,
		Running  = 2,
		Retiring = 3,
		Always   = 4,
		MAX      = 5
	};

	/**
	 * Enum OPP.ESubtitlePriority
	 */
	enum class ESubtitlePriority : uint8_t
	{
		Low         = 0,
		BelowNormal = 1,
		Normal      = 2,
		AboveNormal = 3,
		High        = 4,
		MAX         = 5
	};

	/**
	 * Enum OPP.ELandingType
	 */
	enum class ELandingType : uint8_t
	{
		Hard      = 0,
		Medium    = 1,
		Normal    = 2,
		Knockdown = 3,
		Dead      = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.EHitReactionState
	 */
	enum class EHitReactionState : uint8_t
	{
		DisableHitReaction = 0,
		EnableHitReaction  = 1,
		CustomHitReaction  = 2,
		MAX                = 3
	};

	/**
	 * Enum OPP.EThrowableWeaponGameplayFlag
	 */
	enum class EThrowableWeaponGameplayFlag : uint8_t
	{
		None                       = 0,
		CanCauseKnockdownReaction  = 1,
		CanInteruptActions         = 2,
		CanInterruptGroundAndPound = 3,
		CanBreakWindows            = 4,
		CanBreakTraps              = 5,
		All                        = 6,
		MAX                        = 7
	};

	/**
	 * Enum OPP.EStaminaCostType
	 */
	enum class EStaminaCostType : uint8_t
	{
		None     = 0,
		Minimum  = 1,
		Small    = 2,
		Medium   = 3,
		High     = 4,
		VeryHigh = 5,
		Maximum  = 6,
		MAX      = 7
	};

	/**
	 * Enum OPP.EPickupType
	 */
	enum class EPickupType : uint8_t
	{
		Normal       = 0,
		Consume      = 1,
		TradeNormal  = 2,
		TradeConsume = 3,
		MAX          = 4
	};

	/**
	 * Enum OPP.EJumpType
	 */
	enum class EJumpType : uint8_t
	{
		Standing = 0,
		Walking  = 1,
		Backward = 2,
		Running  = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.EGraphicsRHI
	 */
	enum class EGraphicsRHI : uint8_t
	{
		DefaultGraphicsRHI_Default = 0,
		DefaultGraphicsRHI_DX11    = 1,
		DefaultGraphicsRHI_DX12    = 2,
		DefaultGraphicsRHI_Vulkan  = 3,
		DefaultGraphicsRHI_MAX     = 4
	};

	/**
	 * Enum OPP.ENarrativeScreenDataTableLogic
	 */
	enum class ENarrativeScreenDataTableLogic : uint8_t
	{
		PlaySingleRow             = 0,
		PlaySingleRandomRow       = 1,
		PlayAllRowsInOrder        = 2,
		PlayAllRowsInOrderAndLoop = 3,
		PlayAllRowsRandom         = 4,
		MAX                       = 5
	};

	/**
	 * Enum OPP.EClientTravelSource
	 */
	enum class EClientTravelSource : uint8_t
	{
		Unknown        = 0,
		MainMenu       = 1,
		Tutorial       = 2,
		Lobby          = 3,
		Experiment     = 4,
		ExperimentFail = 5,
		Release        = 6,
		ReleaseFail    = 7,
		MAX            = 8
	};

	/**
	 * Enum OPP.EUIFontSize
	 */
	enum class EUIFontSize : uint8_t
	{
		Small  = 0,
		Medium = 1,
		Large  = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ELoadoutCantEquipReason
	 */
	enum class ELoadoutCantEquipReason : uint8_t
	{
		None       = 0,
		NoFreeSlot = 1,
		MAX        = 2
	};

	/**
	 * Enum OPP.EHoldDurationType
	 */
	enum class EHoldDurationType : uint8_t
	{
		None     = 0,
		Short    = 1,
		Long     = 2,
		Progress = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.EGhostAnimEvent
	 */
	enum class EGhostAnimEvent : uint8_t
	{
		Attach = 0,
		Detach = 1,
		Action = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.ECategoryButtonState
	 */
	enum class ECategoryButtonState : uint8_t
	{
		Locked    = 0,
		Available = 1,
		Acquired  = 2,
		Empty     = 3,
		Invalid   = 4,
		MAX       = 5
	};

	/**
	 * Enum OPP.EPawnAnimQuality
	 */
	enum class EPawnAnimQuality : uint8_t
	{
		VeryHigh = 0,
		High     = 1,
		Med      = 2,
		Low      = 3,
		VeryLow  = 4,
		MAX      = 5
	};

	/**
	 * Enum OPP.EDoorInvestigationType
	 */
	enum class EDoorInvestigationType : uint8_t
	{
		None                  = 0,
		OpenInvestigateSide   = 1,
		OpenInvestigateWide   = 2,
		ClosedInvestigatePeek = 3,
		ClosedInvestigateSide = 4,
		ClosedInvestigateWide = 5,
		LockedInvestigate     = 6,
		MAX                   = 7
	};

	/**
	 * Enum OPP.EVOBehavior
	 */
	enum class EVOBehavior : uint8_t
	{
		Queue           = 0,
		InterruptIfBusy = 1,
		SkipIfBusy      = 2,
		MAX             = 3
	};

	/**
	 * Enum OPP.EVOPriority
	 */
	enum class EVOPriority : uint8_t
	{
		VeryLow  = 0,
		Low      = 1,
		Normal   = 2,
		High     = 3,
		VeryHigh = 4,
		MAX      = 5
	};

	/**
	 * Enum OPP.EFullTurnDirection
	 */
	enum class EFullTurnDirection : uint8_t
	{
		Forward = 0,
		Right   = 1,
		Right01 = 2,
		Right02 = 3,
		Right03 = 4,
		Left    = 5,
		Left01  = 6,
		Left02  = 7,
		Left03  = 8,
		MAX     = 9
	};

	/**
	 * Enum OPP.ELocomotionTurnDirection
	 */
	enum class ELocomotionTurnDirection : uint8_t
	{
		Forward = 0,
		Right   = 1,
		Right01 = 2,
		Left    = 3,
		Left01  = 4,
		MAX     = 5
	};

	/**
	 * Enum OPP.ELocomotionMovementSpeed
	 */
	enum class ELocomotionMovementSpeed : uint8_t
	{
		Stopped = 0,
		Walk    = 1,
		Stride  = 2,
		Jog     = 3,
		Run     = 4,
		Combat  = 5,
		MAX     = 6
	};

	/**
	 * Enum OPP.ETriggerableActionBehavior
	 */
	enum class ETriggerableActionBehavior : uint8_t
	{
		ActivateAndDeactivate = 0,
		OnlyActivate          = 1,
		OnlyDeactivate        = 2,
		MAX                   = 3
	};

	/**
	 * Enum OPP.EMatchCancelationReason
	 */
	enum class EMatchCancelationReason : uint8_t
	{
		Manual             = 0,
		PartyChanged       = 1,
		WaitForMatchFailed = 2,
		WaitForPartyFailed = 3,
		Error              = 4,
		MAX                = 5
	};

	/**
	 * Enum OPP.EPlayerSpawnType
	 */
	enum class EPlayerSpawnType : uint8_t
	{
		NewPlayer    = 0,
		StageReset   = 1,
		EndOfStage   = 2,
		StageRespawn = 3,
		Rejoined     = 4,
		Cheat        = 5,
		MAX          = 6
	};

	/**
	 * Enum OPP.EHudMode
	 */
	enum class EHudMode : uint8_t
	{
		NoHUD            = 0,
		DebugDisplay     = 1,
		InGameExperiment = 2,
		Spectator        = 3,
		Menu             = 4,
		Loading          = 5,
		Cinematic        = 6,
		InGameLobby      = 7,
		SAS              = 8,
		StageIntro       = 9,
		Invalid          = 10,
		MAX              = 11
	};

	/**
	 * Enum OPP.EPlayerTargetPriority
	 */
	enum class EPlayerTargetPriority : uint8_t
	{
		Normal = 0,
		High   = 1,
		MAX    = 2
	};

	/**
	 * Enum OPP.EUniqueVariatorType
	 */
	enum class EUniqueVariatorType : uint8_t
	{
		Invalid                              = 0,
		NPCBashDamageMultiplier              = 1,
		OnlyBigGrunts                        = 2,
		ForcedStartingHealth                 = 3,
		NoRigs                               = 4,
		ForcedExtraLivesCount                = 5,
		EnemiesPsychosisAura                 = 6,
		EnemiesStaminaDrainAura              = 7,
		NoRunning                            = 8,
		PlayerDamageLeash                    = 9,
		NoRadioVoiceChat                     = 10,
		Hardcore                             = 11,
		PeriodicGas                          = 12,
		NPCPopulation_Low                    = 13,
		NPCPopulation_High                   = 14,
		NPCPopulation_VeryHigh               = 15,
		ObjectiveDiscoveryDistanceMultiplier = 16,
		TrapReactionDelayMultiplier          = 17,
		NumberOfLockedContainersMultiplier   = 18,
		ExtraPsychosisOnDamage               = 19,
		NoDeaths                             = 20,
		ExitRush                             = 21,
		BadTrip                              = 22,
		HideOverheadInfo                     = 23,
		LimitPlayerUpgrades                  = 24,
		LimitRigUpgrades                     = 25,
		LimitPerks                           = 26,
		GlassDamage                          = 27,
		RunningProhibited                    = 28,
		NoRevive                             = 29,
		VoiceDisturbance                     = 30,
		NPCChaseRedEyes                      = 31,
		NPCHeightenedStimuli                 = 32,
		MAX                                  = 33
	};

	/**
	 * Enum OPP.ETriggerComponentNetType
	 */
	enum class ETriggerComponentNetType : uint8_t
	{
		ServerOnly       = 0,
		ClientOnly       = 1,
		ServerAndClients = 2,
		MAX              = 3
	};

	/**
	 * Enum OPP.EActiveSkillState
	 */
	enum class EActiveSkillState : uint8_t
	{
		None      = 0,
		Placed    = 1,
		Deployed  = 2,
		Activated = 3,
		Expired   = 4,
		Finished  = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.EQuestGiverMenuCategory
	 */
	enum class EQuestGiverMenuCategory : uint8_t
	{
		Tasks   = 0,
		Upgrade = 1,
		Shop    = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.EMetaNPCType
	 */
	enum class EMetaNPCType : uint8_t
	{
		Engineer    = 0,
		Pharmacist  = 1,
		ShadowyDame = 2,
		Director    = 3,
		Count       = 4,
		None        = 5,
		MAX         = 6
	};

	/**
	 * Enum OPP.EProfileUpgradeCategory
	 */
	enum class EProfileUpgradeCategory : uint8_t
	{
		Core     = 0,
		PerkSlot = 1,
		Count    = 2,
		None     = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.ERadialWheelType
	 */
	enum class ERadialWheelType : uint8_t
	{
		None      = 0,
		Talk      = 1,
		Inventory = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.EMainObjectiveType
	 */
	enum class EMainObjectiveType : uint8_t
	{
		Main     = 0,
		Prologue = 1,
		Epilogue = 2,
		MAX      = 3
	};

	/**
	 * Enum OPP.EGameEventImportanceLevel
	 */
	enum class EGameEventImportanceLevel : uint8_t
	{
		Low    = 0,
		Normal = 1,
		High   = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.EGameEvent
	 */
	enum class EGameEvent : uint8_t
	{
		None                           = 0,
		StageStarted                   = 1,
		EndOfStageReached              = 2,
		EndOfStageStats                = 3,
		CompletedObjectiveCoordinator  = 4,
		CompletedSingleObjective       = 5,
		PlayerIncapacitated            = 6,
		PlayerRevived                  = 7,
		PlayerKilled                   = 8,
		PlayerLeftGame                 = 9,
		PlayerRespawned                = 10,
		PlayerDruggedByPusher          = 11,
		PlayerEnteredSAS               = 12,
		PlayerExitedSAS                = 13,
		GaveItem                       = 14,
		UsedItem                       = 15,
		PickupItem                     = 16,
		BotKnockedOut                  = 17,
		BotKnockedOutByDynamicObstacle = 18,
		BotKilled                      = 19,
		CoopDoorBash                   = 20,
		CoopLedgeCatch                 = 21,
		CoopLegUp                      = 22,
		CoopLedgePull                  = 23,
		PouncersSpawned                = 24,
		SpecialBotSpawned              = 25,
		SpawnWave                      = 26,
		AIDirector                     = 27,
		MAX                            = 28
	};

	/**
	 * Enum OPP.EDoorPassType
	 */
	enum class EDoorPassType : uint8_t
	{
		None           = 0,
		Walkthrough    = 1,
		OpenToClosed   = 2,
		OpenToLocked   = 3,
		ClosedToOpen   = 4,
		ClosedToClosed = 5,
		ClosedToLocked = 6,
		LockedToOpen   = 7,
		LockedToClosed = 8,
		MAX            = 9
	};

	/**
	 * Enum OPP.EAIMusicState
	 */
	enum class EAIMusicState : uint8_t
	{
		Unset          = 0,
		None           = 1,
		Unaware        = 2,
		Suspicious     = 3,
		Alerted        = 4,
		Chase          = 5,
		ChaseProximity = 6,
		MAX            = 7
	};

	/**
	 * Enum OPP.ETutorialType
	 */
	enum class ETutorialType : uint8_t
	{
		Custom       = 0,
		Interaction  = 1,
		EquippedItem = 2,
		Objective    = 3,
		Inventory    = 4,
		MAX          = 5
	};

	/**
	 * Enum OPP.ELargeObjectType
	 */
	enum class ELargeObjectType : uint8_t
	{
		None           = 0,
		Default        = 1,
		LargeBox30     = 2,
		LargeBox60     = 3,
		Diaporama      = 4,
		Bucket         = 5,
		TeddyBear      = 6,
		ChildMannequin = 7,
		HotPotato      = 8,
		CocainePackage = 9,
		AcidBottle     = 10,
		Bomb           = 11,
		GasCanister    = 12,
		FileBox        = 13,
		SeveredHead    = 14,
		MAX            = 15
	};

	/**
	 * Enum OPP.EHidespotCategory
	 */
	enum class EHidespotCategory : uint8_t
	{
		StandingLeft     = 0,
		StandingRight    = 1,
		LyingDownLeft    = 2,
		LyingDownRight   = 3,
		Crouched         = 4,
		InsideHorizontal = 5,
		InsideVertical   = 6,
		CarTrunk         = 7,
		MAX              = 8
	};

	/**
	 * Enum OPP.EPlayerMessageType
	 */
	enum class EPlayerMessageType : uint8_t
	{
		None                           = 0,
		Tutorial                       = 1,
		Custom                         = 2,
		ObjectInteraction              = 3,
		ObjectCannotStopInteraction    = 4,
		HelpPlayerUp                   = 5,
		HelpingPlayerUp                = 6,
		BeingHelpedUp                  = 7,
		RevivePlayer                   = 8,
		RevivingPlayer                 = 9,
		PyschosisPlayer                = 10,
		BeingRevived                   = 11,
		OfferHighJump                  = 12,
		OfferingHighJump               = 13,
		AcceptHighJump                 = 14,
		OfferLongJump                  = 15,
		OfferingLongJump               = 16,
		AcceptLongJump                 = 17,
		WakeUp                         = 18,
		SavePlayerFromGroundAndPound   = 19,
		SavePlayerFromFatality         = 20,
		Shove                          = 21,
		GroundAndPoundNoItemCounter    = 22,
		GroundAndPoundThrowableCounter = 23,
		DoorBashInteract               = 24,
		DoorBashBlocked                = 25,
		DropLargeObject                = 26,
		AimingThrowable                = 27,
		CoopTrapHelper                 = 28,
		CoopTrapVictimFreeYourself     = 29,
		CoopTrapHelperFreeFriend       = 30,
		OfferingTrade                  = 31,
		AcceptTrade                    = 32,
		MessageZone                    = 33,
		InvestigationDone              = 34,
		ItemHoldAction                 = 35,
		CantOperateDoorWithLargeObject = 36,
		EnterSpectator                 = 37,
		Respawn                        = 38,
		UseSelfRevive                  = 39,
		MAX                            = 40
	};

	/**
	 * Enum OPP.ERandomStateSetup
	 */
	enum class ERandomStateSetup : uint8_t
	{
		Random        = 0,
		StateA        = 1,
		StateB        = 2,
		NotApplicable = 3,
		MAX           = 4
	};

	/**
	 * Enum OPP.ERBFoleyType
	 */
	enum class ERBFoleyType : uint8_t
	{
		PantShort  = 0,
		PantLong   = 1,
		ClothShort = 2,
		ClothLong  = 3,
		MAX        = 4
	};

	/**
	 * Enum OPP.ESwitchPanelPartVariant
	 */
	enum class ESwitchPanelPartVariant : uint8_t
	{
		NoRotation = 0,
		Rotated90  = 1,
		Rotated180 = 2,
		Rotated270 = 3,
		MAX        = 4
	};

	/**
	 * Enum OPP.EDestructibleMaterialType
	 */
	enum class EDestructibleMaterialType : uint8_t
	{
		Wood       = 0,
		WoodenDoor = 1,
		Concrete   = 2,
		Mannequin  = 3,
		MAX        = 4
	};

	/**
	 * Enum OPP.EFallingReason
	 */
	enum class EFallingReason : uint8_t
	{
		Normal      = 0,
		Death       = 1,
		Spawning    = 2,
		WalkJumping = 3,
		RunJumping  = 4,
		JumpOver    = 5,
		Combat      = 6,
		MAX         = 7
	};

	/**
	 * Enum OPP.ENPCHitReactionType
	 */
	enum class ENPCHitReactionType : uint8_t
	{
		None      = 0,
		Flinch    = 1,
		Twitch    = 2,
		Stagger   = 3,
		Stumble   = 4,
		Knockdown = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.EGrabType
	 */
	enum class EGrabType : uint8_t
	{
		None             = 0,
		Stand            = 1,
		Crouch           = 2,
		Above            = 3,
		HidingStandLeft  = 4,
		HidingStandRight = 5,
		HidingProneLeft  = 6,
		HidingProneRight = 7,
		HidingCrouch     = 8,
		HidingContainer  = 9,
		HidingBarrel     = 10,
		MAX              = 11
	};

	/**
	 * Enum OPP.ETraversalNotifyType
	 */
	enum class ETraversalNotifyType : uint8_t
	{
		IntroDone       = 0,
		OutroDone       = 1,
		ConditionalFall = 2,
		ConditionalLand = 3,
		Repulsion       = 4,
		MAX             = 5
	};

	/**
	 * Enum OPP.EWeaponType
	 */
	enum class EWeaponType : uint8_t
	{
		None       = 0,
		Fist       = 1,
		Slash      = 2,
		Chop       = 3,
		LightBlunt = 4,
		HeavyBlunt = 5,
		MAX        = 6
	};

	/**
	 * Enum OPP.EItemAnimType
	 */
	enum class EItemAnimType : uint8_t
	{
		EmptyHanded      = 0,
		OneHanded        = 1,
		TwoHanded        = 2,
		Syringe          = 3,
		PainKiller       = 4,
		Bandage          = 5,
		Potion           = 6,
		RadioTransmitter = 7,
		Gun              = 8,
		AsthmaPump       = 9,
		MAX              = 10
	};

	/**
	 * Enum OPP.ERollingGateVariatorType
	 */
	enum class ERollingGateVariatorType : uint8_t
	{
		None                        = 0,
		TimedOpenedClosed           = 1,
		ClosesAfterNumberOfPassages = 2,
		ToasterDetector             = 3,
		Unlockable                  = 4,
		SoundDetector               = 5,
		StageRandomMax              = 6,
		RailObjectiveUnlockable     = 7,
		MAX                         = 8
	};

	/**
	 * Enum OPP.ERoomAssociationType
	 */
	enum class ERoomAssociationType : uint8_t
	{
		Default                  = 0,
		Container                = 1,
		Hidespot                 = 2,
		JumpScare                = 3,
		MonsterCloset            = 4,
		Investigation            = 5,
		TrapGroup                = 6,
		Trap                     = 7,
		PuzzleRoomNumberDecal    = 8,
		PuzzleRoomLights         = 9,
		PuzzleRoomLargePickupBox = 10,
		PuzzleRoomBlacklight     = 11,
		Max                      = 12
	};

	/**
	 * Enum OPP.EStageVariatorType
	 */
	enum class EStageVariatorType : uint8_t
	{
		SecondaryObjective = 0,
		Obstacle           = 1,
		RollingGate        = 2,
		SAS                = 3,
		MAX                = 4
	};

	/**
	 * Enum OPP.ETriggeringStimulusType
	 */
	enum class ETriggeringStimulusType : uint8_t
	{
		MinorAudio        = 0,
		NormalAudio       = 1,
		ObviousAudio      = 2,
		HighPriorityAudio = 3,
		Invalid           = 4,
		MAX               = 5
	};

	/**
	 * Enum OPP.ERetirementReason
	 */
	enum class ERetirementReason : uint8_t
	{
		None                        = 0,
		RequestedByAIDirector       = 1,
		ExplicitCommand             = 2,
		TeleportFlee                = 3,
		ReturnToLeashVolume         = 4,
		SpecialistActivityCompleted = 5,
		HitByProjectile             = 6,
		HitByActiveSkill            = 7,
		MAX                         = 8
	};

	/**
	 * Enum OPP.ENPCFlavor
	 */
	enum class ENPCFlavor : uint8_t
	{
		Normal = 0,
		Light  = 1,
		Heavy  = 2,
		MAX    = 3
	};

	/**
	 * Enum OPP.EDesiredRelativePressure
	 */
	enum class EDesiredRelativePressure : uint8_t
	{
		NoChange       = 0,
		LowerPressure  = 1,
		HigherPressure = 2,
		MAX            = 3
	};

	/**
	 * Enum OPP.EPlayerRushingStatus
	 */
	enum class EPlayerRushingStatus : uint8_t
	{
		None     = 0,
		Prudent  = 1,
		Variable = 2,
		Rushing  = 3,
		MAX      = 4
	};

	/**
	 * Enum OPP.EPlayerProximityStatus
	 */
	enum class EPlayerProximityStatus : uint8_t
	{
		None        = 0,
		Isolated    = 1,
		Variable    = 2,
		Accompanied = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.ESpecialBotInitialBehavior
	 */
	enum class ESpecialBotInitialBehavior : uint8_t
	{
		Default                            = 0,
		RandomPatrol                       = 1,
		FullyRandomInvestigation           = 2,
		MethodicalInvestigation            = 3,
		ForceChaseTargetPlayerUntilContact = 4,
		InvestigateAtTargetPlayerLocation  = 5,
		MAX                                = 6
	};

	/**
	 * Enum OPP.EConditionalRetirementEvent
	 */
	enum class EConditionalRetirementEvent : uint8_t
	{
		KilledAPlayer                 = 0,
		KnockedDownAPlayer            = 1,
		GiveUpChase                   = 2,
		UnsuccesfulAwareInvestigation = 3,
		FinishedPatrolWaypoint        = 4,
		PusherGasAttack               = 5,
		IdleFallback                  = 6,
		MAX                           = 7
	};

	/**
	 * Enum OPP.ENPCInvestigationAnimCategory
	 */
	enum class ENPCInvestigationAnimCategory : uint8_t
	{
		None   = 0,
		Narrow = 1,
		Wide   = 2,
		Broad  = 3,
		Ground = 4,
		MAX    = 5
	};

	/**
	 * Enum OPP.ENPCInvestigationAnimIntensity
	 */
	enum class ENPCInvestigationAnimIntensity : uint8_t
	{
		None        = 0,
		Unaware     = 1,
		Suspicious  = 2,
		Investigate = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.EStartleSpeed
	 */
	enum class EStartleSpeed : uint8_t
	{
		Fast = 0,
		Slow = 1,
		MAX  = 2
	};

	/**
	 * Enum OPP.EStartleType
	 */
	enum class EStartleType : uint8_t
	{
		Alerted = 0,
		Relaxed = 1,
		MAX     = 2
	};

	/**
	 * Enum OPP.EMonsterClosetSelectionMode
	 */
	enum class EMonsterClosetSelectionMode : uint8_t
	{
		Random        = 0,
		Quiet         = 1,
		CloseToTarget = 2,
		Explicit      = 3,
		MAX           = 4
	};

	/**
	 * Enum OPP.EBotDoorPassBehavior
	 */
	enum class EBotDoorPassBehavior : uint8_t
	{
		NeverClose            = 0,
		NeverUnlockNeverClose = 1,
		RandomCloseNeverLock  = 2,
		AlwaysCloseUnlocked   = 3,
		AlwaysCloseLocked     = 4,
		AlwaysCloseRandomLock = 5,
		Random                = 6,
		MAX                   = 7
	};

	/**
	 * Enum OPP.EGuardAttackType
	 */
	enum class EGuardAttackType : uint8_t
	{
		Attack         = 0,
		Push           = 1,
		GroundAndPound = 2,
		Kill           = 3,
		MAX            = 4
	};

	/**
	 * Enum OPP.EChaseMoveDestination
	 */
	enum class EChaseMoveDestination : uint8_t
	{
		Invalid        = 0,
		Player         = 1,
		AnticipatedPos = 2,
		LastKnownPos   = 3,
		HidingSpot     = 4,
		SnipingSpot    = 5,
		Pushable       = 6,
		ForcedLocation = 7,
		PathBlocking   = 8,
		MAX            = 9
	};

	/**
	 * Enum OPP.EChaseSpecialState
	 */
	enum class EChaseSpecialState : uint8_t
	{
		None         = 0,
		PathBlocking = 1,
		Yielding     = 2,
		GivingUp     = 3,
		MAX          = 4
	};

	/**
	 * Enum OPP.ENPCType
	 */
	enum class ENPCType : uint8_t
	{
		Grunt           = 0,
		Ambient         = 1,
		BigGrunt        = 2,
		PitcherSniper   = 3,
		SleeperScreamer = 4,
		Pouncer         = 5,
		Pusher          = 6,
		GroundPitcher   = 7,
		Berserker       = 8,
		Imposter        = 9,
		NightHunter     = 10,
		Spectre         = 11,
		ThrowableTarget = 12,
		StalkerTarget   = 13,
		Gooseberry      = 14,
		Coyle           = 15,
		Scientist       = 16,
		Guard           = 17,
		MAX             = 18
	};

	/**
	 * Enum OPP.ENPCAnimStyle
	 */
	enum class ENPCAnimStyle : uint8_t
	{
		Relaxed    = 0,
		Suspicious = 1,
		Alerted    = 2,
		Chase      = 3,
		Combat     = 4,
		MAX        = 5
	};

	/**
	 * Enum OPP.EAlertedInvestigationPhase
	 */
	enum class EAlertedInvestigationPhase : uint8_t
	{
		InvestigatingStimulusSource       = 0,
		InvestigatingAround               = 1,
		Idle                              = 2,
		WaitingForValidInvestigationState = 3,
		Startle                           = 4,
		Invalid                           = 5,
		MAX                               = 6
	};

	/**
	 * Enum OPP.EStimulusType
	 */
	enum class EStimulusType : uint8_t
	{
		None                    = 0,
		PartialPlayerVisibility = 1,
		FullPlayerVisibility    = 2,
		LostChasedPlayer        = 3,
		MinorAudio              = 4,
		NormalAudio             = 5,
		ObviousAudio            = 6,
		HighPriorityEvent       = 7,
		SurfaceMovement         = 8,
		MAX                     = 9
	};

	/**
	 * Enum OPP.EAILogVerbosity
	 */
	enum class EAILogVerbosity : uint8_t
	{
		Verbose = 0,
		Log     = 1,
		Event   = 2,
		Error   = 3,
		MAX     = 4
	};

	/**
	 * Enum OPP.EVOEventResultType
	 */
	enum class EVOEventResultType : uint8_t
	{
		Undefined                = 0,
		Played                   = 1,
		NoMapping                = 2,
		TooSoonAfterAnyVO        = 3,
		TooSoonAfterSimilarVO    = 4,
		TooSoonAfterSameVOOnPawn = 5,
		TooSoonAfterSameVOGlobal = 6,
		SkippedSelfInterrupt     = 7,
		SkippedLowerPrio         = 8,
		ConditionsFailed         = 9,
		Queued                   = 10,
		NoLine                   = 11,
		MAX                      = 12
	};

	/**
	 * Enum OPP.EVOContext
	 */
	enum class EVOContext : uint8_t
	{
		Undefined                           = 0,
		ReactToSoundDisturbanceAware        = 1,
		ReactToSoundDisturbanceUnaware      = 2,
		ReactToVisualDisturbanceAware       = 3,
		ReactToVisualDisturbanceUnaware     = 4,
		ReactToMajorDisturbance             = 5,
		ReactToSensingDisturbance           = 6,
		InvestigateDisturbanceAware         = 7,
		InvestigateDisturbanceUnaware       = 8,
		InvestigatePoint                    = 9,
		ReachedInvestigationPoint           = 10,
		FinishedInvestigatingPoint          = 11,
		InvestigationGiveUp                 = 12,
		SuspiciousGiveUp                    = 13,
		AlertedGiveUp                       = 14,
		SawPlayerEnterHidingSpot            = 15,
		FoundHiddenPlayer                   = 16,
		SearchForOtherPlayersAfterKnockDown = 17,
		PullOutFromHidespot                 = 18,
		ReactToPlayerBeforeChase            = 19,
		ReactToMultiplePlayersBeforeChase   = 20,
		StartChaseAfterReaction             = 21,
		StartChaseNoReaction                = 22,
		StartMoveToIncapacitatedPlayer      = 23,
		ChaseReachedLeashLimit              = 24,
		ChaseStartGiveUp                    = 25,
		ChaseGiveUp                         = 26,
		ChaseStartYielding                  = 27,
		ChaseYield                          = 28,
		ChaseChangedTarget                  = 29,
		ChaseTaunt                          = 30,
		LostSightOfPlayer                   = 31,
		StartMoveToLostSight                = 32,
		ReachedLastKnownPosition            = 33,
		UnawarePlayerProximity              = 34,
		ChasePlayerProximity                = 35,
		ReachedPatrolWaypoint               = 36,
		PassUnderDynamicObstacle            = 37,
		EnterDarknessZone                   = 38,
		EnterLightZone                      = 39,
		AttackPlayer                        = 40,
		GuardingAttack                      = 41,
		PushPlayer                          = 42,
		ImposterCharge                      = 43,
		PusherAttack                        = 44,
		PairedAttackConnecting              = 45,
		KnockedDownPlayer                   = 46,
		StartFinishingIncapacitatedPlayer   = 47,
		FinishIncapacitatedPlayer           = 48,
		DealtDamage                         = 49,
		KilledPlayer                        = 50,
		AttackOtherNPC                      = 51,
		AttackedByOtherNPC                  = 52,
		ThrowProjectile                     = 53,
		ThrownProjectileHit                 = 54,
		ThrownProjectileMiss                = 55,
		TakeDamage                          = 56,
		HitByProjectile                     = 57,
		PairedAttackInterrupted             = 58,
		HitReaction_Low                     = 59,
		HitReaction_Med                     = 60,
		HitReaction_High                    = 61,
		DelayedHitReaction                  = 62,
		ShovedByPlayerAware                 = 63,
		ShovedByPlayerUnaware               = 64,
		ShovePunish                         = 65,
		KnockedOut                          = 66,
		GetUpFromKnockOut                   = 67,
		Killed                              = 68,
		ProvocationWarning                  = 69,
		ProvokedByPlayer                    = 70,
		ReactToImperativeDisturbance        = 71,
		TurnOffImperativeDisturbance        = 72,
		SignalTackle                        = 73,
		FailedTackle                        = 74,
		SuccessfulTackle                    = 75,
		FinishedGroundAndPound              = 76,
		PlayerAvoidanceStart                = 77,
		PlayerAvoidanceRepath               = 78,
		AcknowledgePlayer                   = 79,
		AcknowledgeOtherNPC                 = 80,
		ZoneDefenseBecomeAlert              = 81,
		ZoneDefenseBlown                    = 82,
		ReactToCloseGrenade                 = 83,
		AffectedByStunGrenade               = 84,
		RecoverFromStunGrenade              = 85,
		AffectedByBlindPaint                = 86,
		AffectedByHealSlowdown              = 87,
		SleeperDisturbed                    = 88,
		SleeperScream                       = 89,
		StartRetirement                     = 90,
		Scripted                            = 91,
		AnimNotify                          = 92,
		PawnState                           = 93,
		Announcer                           = 94,
		ContinuousVO                        = 95,
		ExitedMonsterCloset                 = 96,
		ReactToSoundDisturbance             = 97,
		ReactToVisualDisturbance            = 98,
		InvestigateDisturbance              = 99,
		FirstAttack                         = 100,
		AttackAny                           = 101,
		PassiveRandom                       = 102,
		InvestigateRandomAware              = 103,
		InvestigateRandomUnaware            = 104,
		InvestigateRandom                   = 105,
		ChaseRandom                         = 106,
		MAX                                 = 107
	};

	/**
	 * Enum OPP.EInvestigationPointSelectionMode
	 */
	enum class EInvestigationPointSelectionMode : uint8_t
	{
		SelectionCriteria = 0,
		FullyRandom       = 1,
		StrictOrder       = 2,
		MAX               = 3
	};

	/**
	 * Enum OPP.EInvestigationPointIrrelevanceReason
	 */
	enum class EInvestigationPointIrrelevanceReason : uint8_t
	{
		NoWeight                 = 0,
		TooClose                 = 1,
		FilteredOut              = 2,
		FindingPlayerNotAllowed  = 3,
		NotFindingPlayerThisTime = 4,
		ObstacleInPath           = 5,
		TooCloseToOtherBot       = 6,
		TooCloseToChasedPlayer   = 7,
		ProhibitedByKismet       = 8,
		DynamicStateIrrelevant   = 9,
		MAX                      = 10
	};

	/**
	 * Enum OPP.EInvestigationPointType
	 */
	enum class EInvestigationPointType : uint8_t
	{
		None               = 0,
		SimpleLocation     = 1,
		InvestigationPoint = 2,
		Door               = 3,
		HideSpot           = 4,
		SimpleInteract     = 5,
		LedgeDrop          = 6,
		MAX                = 7
	};

	/**
	 * Enum OPP.EPatrolWaypointSelectionMode
	 */
	enum class EPatrolWaypointSelectionMode : uint8_t
	{
		Random           = 0,
		PingPong         = 1,
		IncrementingLoop = 2,
		IncrementingOnce = 3,
		DecrementingLoop = 4,
		DecrementingOnce = 5,
		MAX              = 6
	};

	/**
	 * Enum OPP.EAICommandType
	 */
	enum class EAICommandType : uint8_t
	{
		None                = 0,
		GotoLocation        = 1,
		GotoWaypoint        = 2,
		Patrol              = 3,
		Investigate         = 4,
		PlayLoopingIdle     = 5,
		PlaySingleShotAnim  = 6,
		ScriptedAnimStation = 7,
		GotoAmbientMarker   = 8,
		MAX                 = 9
	};

	/**
	 * Enum OPP.EAISpectreVisualType
	 */
	enum class EAISpectreVisualType : uint8_t
	{
		None        = 0,
		CloseRange  = 1,
		MediumRange = 2,
		FarRange    = 3,
		MAX         = 4
	};

	/**
	 * Enum OPP.EAIActivity
	 */
	enum class EAIActivity : uint8_t
	{
		None                  = 0,
		Idle                  = 1,
		Ambient               = 2,
		Patrol                = 3,
		Retirement            = 4,
		Sneak                 = 5,
		SeekingHidingSpot     = 6,
		Investigate           = 7,
		InvestigateAggressive = 8,
		Chase                 = 9,
		PlayerAvoidance       = 10,
		ImperativeAction      = 11,
		Ambush                = 12,
		MonsterCloset         = 13,
		GroundAndPound        = 14,
		Knockout              = 15,
		Scripted              = 16,
		Dead                  = 17,
		MAX                   = 18
	};

	/**
	 * Enum OPP.EAIAwarenessStateType
	 */
	enum class EAIAwarenessStateType : uint8_t
	{
		None       = 0,
		Scripted   = 1,
		Ambient    = 2,
		Unaware    = 3,
		Suspicious = 4,
		Chase      = 5,
		Alerted    = 6,
		Sneak      = 7,
		MAX        = 8
	};

	/**
	 * Enum OPP.EQuestItemType
	 */
	enum class EQuestItemType : uint8_t
	{
		TypeA = 0,
		TypeB = 1,
		TypeC = 2,
		TypeD = 3,
		MAX   = 4
	};

	/**
	 * Enum OPP.EPipeJunctionType
	 */
	enum class EPipeJunctionType : uint8_t
	{
		Cross               = 0,
		DoubleCurveLeft     = 1,
		DoubleCurveRight    = 2,
		OverUnderVertical   = 3,
		OverUnderHorizontal = 4,
		Straight            = 5,
		StraightBroken      = 6,
		MAX                 = 7
	};

	/**
	 * Enum OPP.ERBVoiceChatMode
	 */
	enum class ERBVoiceChatMode : uint8_t
	{
		Party = 0,
		Game  = 1,
		MAX   = 2
	};

	/**
	 * Enum OPP.ERBVoiceChatEngineState
	 */
	enum class ERBVoiceChatEngineState : uint8_t
	{
		Disconnected = 0,
		Connecting   = 1,
		Connected    = 2,
		MAX          = 3
	};

	/**
	 * Enum OPP.EContinuousSoundNPCState
	 */
	enum class EContinuousSoundNPCState : uint8_t
	{
		None                 = 0,
		Hiding               = 1,
		Unaware              = 2,
		Suspicious           = 3,
		Alerted              = 4,
		Chase                = 5,
		AffectedByBrainAmp   = 6,
		Normal               = 7,
		AffectedBySpineAmp   = 8,
		AffectedByRagePaint  = 9,
		AffectedByBlindPaint = 10,
		MAX                  = 11
	};

	/**
	 * Enum OPP.RBWaypointVersion
	 */
	enum class ERBWaypointVersion : uint8_t
	{
		RBWaypointVersion_Initial               = 0,
		RBWaypointVersion_MinMaxWaitTime        = 1,
		RBWaypointVersion_Current               = 2,
		RBWaypointVersion_RBWaypointVersion_MAX = 3
	};

	/**
	 * Enum OPP.ETrapBatteryState
	 */
	enum class ETrapBatteryState : uint8_t
	{
		Armed     = 0,
		Disarmed  = 1,
		Destroyed = 2,
		MAX       = 3
	};

	/**
	 * Enum OPP.EWorldPopulatingStepClient
	 */
	enum class EWorldPopulatingStepClient : uint8_t
	{
		None                                    = 0,
		WorldPopulate_Start                     = 1,
		PopulateInterfaceObjectWorldFullyLoaded = 2,
		BuildRegisterNavmeshActorList           = 3,
		RegisterNavmeshActors                   = 4,
		InitializeRoomData                      = 5,
		BuildRoomCaches                         = 6,
		LinkRoomConnectors                      = 7,
		AssociateRooms                          = 8,
		BuildRoomGroupsCaches                   = 9,
		ApplyRandomizedSharedStates             = 10,
		PopulateInterfaceObjectPostPopulate     = 11,
		RemovingNavigationBuildingLock          = 12,
		BuildingRoomPaths                       = 13,
		PopulateLedgeMarkers                    = 14,
		WorldPopulate_Done                      = 15,
		MAX                                     = 16
	};

	/**
	 * Enum OPP.EWorldPopulatingStep
	 */
	enum class EWorldPopulatingStep : uint8_t
	{
		None                                    = 0,
		WorldPopulate_Start                     = 1,
		PopulateInterfaceObjectWorldFullyLoaded = 2,
		BuildRegisterNavmeshActorList           = 3,
		RegisterNavmeshActors                   = 4,
		PopulateGameMode                        = 5,
		InitializeRoomData                      = 6,
		BuildRoomCaches                         = 7,
		LinkRoomConnectors                      = 8,
		AssociateRooms                          = 9,
		BuildRoomGroupsCaches                   = 10,
		PrepareMissionRoomGroups                = 11,
		PopulateMissionRoomGroups               = 12,
		PopulateObjectiveManager                = 13,
		SortRandomizedArrays                    = 14,
		PrepareRandomManager                    = 15,
		PrepareObjectiveCoordinators            = 16,
		Editor_ValidateBlockable                = 17,
		RandomizeObjectiveRails                 = 18,
		RandomizeObjectiveClosedRooms           = 19,
		PopulatePuzzleRooms                     = 20,
		PopulateRewardRooms                     = 21,
		RandomizeManagers_Gates                 = 22,
		RandomizeBlockableStage                 = 23,
		RandomizeBlockableRoomGroups            = 24,
		RandomizeDoorsStage                     = 25,
		RandomizeDoorsRoomGroups                = 26,
		RandomizeRollingGateVariator            = 27,
		PopulateRollingGateVariator             = 28,
		PopulateObjectiveCoordinators           = 29,
		SetupObjectiveCoordinators              = 30,
		RandomizeHidespotsStage                 = 31,
		RandomizeHidespotsRoomGroups            = 32,
		ComputeObjectiveProximity               = 33,
		RandomizeManagers_Traps                 = 34,
		ComputeObstacleCount                    = 35,
		TrapGroups                              = 36,
		ObstacleVariatorTraps                   = 37,
		PopulateRandomManagers                  = 38,
		ApplyRandomizedSharedStates             = 39,
		PopulateActors                          = 40,
		PopulateItemManagers                    = 41,
		PopulateInterfaceObjectPostPopulate     = 42,
		RemovingNavigationBuildingLock          = 43,
		BuildingRoomPaths                       = 44,
		WaitingForNavMeshBuild                  = 45,
		PopulateLedgeMarkers                    = 46,
		PopulateWaypointGroups                  = 47,
		PopulateAISpawnersInit                  = 48,
		PopulatingAIDirector                    = 49,
		PopulateAISpawnersSpawn                 = 50,
		PopulateWaitForServerConfiguration      = 51,
		WorldPopulate_Done                      = 52,
		MAX                                     = 53
	};

	/**
	 * Enum OPP.EWWWPlaybackSpeed
	 */
	enum class EWWWPlaybackSpeed : uint8_t
	{
		Speed1x  = 0,
		Speed2x  = 1,
		Speed4x  = 2,
		Speed8x  = 3,
		Speed16x = 4,
		Speed32x = 5,
		MAX      = 6
	};

	/**
	 * Enum OPP.EWWWTrackDrawLength
	 */
	enum class EWWWTrackDrawLength : uint8_t
	{
		Unlimited = 0,
		Last5s    = 1,
		Last10s   = 2,
		Last30s   = 3,
		LastMin   = 4,
		Last5Min  = 5,
		MAX       = 6
	};

	/**
	 * Enum OPP.EWWWTrackDrawSelection
	 */
	enum class EWWWTrackDrawSelection : uint8_t
	{
		All     = 0,
		Focused = 1,
		None    = 2,
		MAX     = 3
	};

	/**
	 * Enum OPP.ERelationshipErrorCodes
	 */
	enum class ERelationshipErrorCodes : uint8_t
	{
		MissingBaseServiceUrl               = 0,
		MaximumFriendsReached               = 1,
		MaximumSentFriendRequestsReached    = 2,
		MaximumPendingFriendRequestsReached = 3,
		FriendRequestNotFound               = 4,
		InvalidRelationship                 = 5,
		MAX                                 = 6
	};

	/**
	 * Enum OPP.ERTAErrorCodes
	 */
	enum class ERTAErrorCodes : uint8_t
	{
		MissingBaseServiceUrl        = 0,
		ConnectionFailed             = 1,
		ConnectionClosed             = 2,
		InvalidIncomingMessageFormat = 3,
		MAX                          = 4
	};

	/**
	 * Enum OPP.EStatsErrorCodes
	 */
	enum class EStatsErrorCodes : uint8_t
	{
		Dummy = 0,
		MAX   = 1
	};

	/**
	 * Enum OPP.EStoreErrorCodes
	 */
	enum class EStoreErrorCodes : uint8_t
	{
		OrderFailed_Generic                            = 0,
		OrderFailed_NotApprovedByUser                  = 1,
		OrderFailed_UserNotLoggedIn                    = 2,
		OrderFailed_AccountUnavailable                 = 3,
		OrderFailed_TransactionDenied                  = 4,
		OrderFailed_TransactionDeniedRestrictedCountry = 5,
		OrderFailed_InsufficientFunds                  = 6,
		OrderFailed_FinalizationTimeLimitExceeded      = 7,
		OrderFailed_AccountDisabled                    = 8,
		OrderFailed_AccountNotAllowedPurchase          = 9,
		OrderFailed_TransactionDeniedFraudDetection    = 10,
		OrderFailed_NoCachedPaymentMethod              = 11,
		OrderFailed_MAX                                = 12
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct OPP.RBActiveSkillSettings
	 * Size -> 0x002C
	 */
	struct FRBActiveSkillSettings
	{
	public:
		EActiveSkillType                                           ActiveSkillType;                                         // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VRFU[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CooldownBetweenCharges;                                  // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TriggerRadius;                                           // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TriggerDelay;                                            // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ChargeDuration;                                          // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Effect;                                                  // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EffectRadius;                                            // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EffectDuration;                                          // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PrimeAssetEffectDurationMultiplier;                      // 0x0020(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EffectDuration2;                                         // 0x0024(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DistractionRange;                                        // 0x0028(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.RBGameplayAttribute
	 * Size -> 0x0030
	 */
	struct FRBGameplayAttribute
	{
	public:
		EGameplayAttributeType                                     AttributeType;                                           // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1CZT[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DefaultValue;                                            // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             Owner;                                                   // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Value;                                                   // 0x0010(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VR90[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnAttributeValueChanged;                                 // 0x0018(0x0010) ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OEQD[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.ItemDefinition
	 * Size -> 0x0048
	 */
	struct FItemDefinition
	{
	public:
		class UClass*                                              ItemClass;                                               // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemCategory                                              ItemCategory;                                            // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemType                                                  ItemType;                                                // 0x0009(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSupportsHolster;                                        // 0x000A(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSupportsInstantUse;                                     // 0x000B(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AHFH[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTexture2D*                                          Icon;                                                    // 0x0010(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                DisplayName;                                             // 0x0018(0x0018) Edit, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic
		bool                                                       bOverrideCategoryColor;                                  // 0x0030(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D186[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FLinearColor                                        InventoryItemColor;                                      // 0x0034(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EJY3[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.ConfigurableValue
	 * Size -> 0x0038
	 */
	struct FConfigurableValue
	{
	public:
		EConfigValueType                                           ValueType;                                               // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XSSG[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              ValueName;                                               // 0x0008(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              DefaultName;                                             // 0x0018(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCustomName;                                             // 0x0028(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SQ71[0xF];                                   // 0x0029(0x000F) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.InternalFloatByDifficulty
	 * Size -> 0x0020
	 */
	struct FInternalFloatByDifficulty
	{
	public:
		bool                                                       bOverrideEasyLocalValue;                                 // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D59E[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      EasyLocalValue;                                          // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideNormalLocalValue;                               // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SIR0[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      NormalLocalValue;                                        // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideHardLocalValue;                                 // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_34MA[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HardLocalValue;                                          // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideInsaneLocalValue;                               // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EV3F[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InsaneLocalValue;                                        // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.ConfigurableFloat
	 * Size -> 0x0090 (FullSize[0x00C8] - InheritedSize[0x0038])
	 */
	struct FConfigurableFloat : public FConfigurableValue
	{
	public:
		struct FInternalFloatByDifficulty                          DefaultValues;                                           // 0x0038(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLocalOverrideFor1P;                                     // 0x0058(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WHY8[0x3];                                   // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FInternalFloatByDifficulty                          Values1P;                                                // 0x005C(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLocalOverrideFor2P;                                     // 0x007C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MRFT[0x3];                                   // 0x007D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FInternalFloatByDifficulty                          Values2P;                                                // 0x0080(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLocalOverrideFor3P;                                     // 0x00A0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BLXE[0x3];                                   // 0x00A1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FInternalFloatByDifficulty                          Values3P;                                                // 0x00A4(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1TTT[0x4];                                   // 0x00C4(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.RBConfigurableGameplayAttributeModifier
	 * Size -> 0x00D0
	 */
	struct FRBConfigurableGameplayAttributeModifier
	{
	public:
		EGameplayAttributeType                                     AttributeType;                                           // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EGameplayAttributeModifierType                             ModifierType;                                            // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PTEU[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FConfigurableFloat                                  Value;                                                   // 0x0008(0x00C8) Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.HUDTutorialTextData
	 * Size -> 0x0040
	 */
	struct FHUDTutorialTextData
	{
	public:
		class FText                                                Title;                                                   // 0x0000(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class FText                                                Text;                                                    // 0x0018(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class FName                                                TutorialId;                                              // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxDisplayCount;                                         // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RepeatDelay;                                             // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.TutorialTextData
	 * Size -> 0x0020
	 */
	struct FTutorialTextData
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		float                                                      showDuration;                                            // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8PPF[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.ScheduledProperty
	 * Size -> 0x0068
	 */
	struct FScheduledProperty
	{
	public:
		unsigned char                                              UnknownData_ZPP1[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                PropertyName;                                            // 0x0008(0x0008) ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             Owner;                                                   // 0x0010(0x0008) ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              ActorOwner;                                              // 0x0018(0x0008) ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              NetRoleOverrideActor;                                    // 0x0020(0x0008) ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SetValue_ServerTimestamp;                                // 0x0028(0x0004) ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EE6A[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnValueChanged;                                          // 0x0030(0x0010) ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, RepSkip, NativeAccessSpecifierPublic
		float                                                      DesiredTargetTime;                                       // 0x0040(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bScheduled;                                              // 0x0044(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_48AN[0x13];                                  // 0x0045(0x0013) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptDelegate                                      ApplyDesiredStateCallback;                               // 0x0058(0x0010) ZeroConstructor, InstancedReference, NoDestructor, Protected, NativeAccessSpecifierProtected
	};

	enum class EForceFeedbackDataType : uint8_t
	{
		None = 0,
		GenericLow = 1,
		GenericMedium = 2,
		GenericHigh = 3,
		LoopingLow = 4,
		LoopingMedium = 5,
		LoopingHigh = 6,
		Death = 7,
		Revive = 8,
		MAX = 9
	};


	/**
	* 
	* 
	 * ScriptStruct OPP.ScheduledUObject
	 * Size -> 0x0020 (FullSize[0x0088] - InheritedSize[0x0068])
	 */
	struct FScheduledUObject : public FScheduledProperty
	{
	public:
		class UObject*                                             InitialValue;                                            // 0x0068(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             LastValue;                                               // 0x0070(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             CurrentValue;                                            // 0x0078(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             DesiredValue;                                            // 0x0080(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.ScheduledInt
	 * Size -> 0x0010 (FullSize[0x0078] - InheritedSize[0x0068])
	 */
	struct FScheduledInt : public FScheduledProperty
	{
	public:
		int32_t                                                    InitialValue;                                            // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    LastValue;                                               // 0x006C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CurrentValue;                                            // 0x0070(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DesiredValue;                                            // 0x0074(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.ScheduledBool
	 * Size -> 0x0008 (FullSize[0x0070] - InheritedSize[0x0068])
	 */
	struct FScheduledBool : public FScheduledProperty
	{
	public:
		bool                                                       InitialValue;                                            // 0x0068(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LastValue;                                               // 0x0069(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CurrentValue;                                            // 0x006A(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       DesiredValue;                                            // 0x006B(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QBN6[0x4];                                   // 0x006C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.ScheduledTransform
	 * Size -> 0x00C8 (FullSize[0x0130] - InheritedSize[0x0068])
	 */
	struct FScheduledTransform : public FScheduledProperty
	{
	public:
		unsigned char                                              UnknownData_NVWC[0x8];                                   // 0x0068(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          InitialValue;                                            // 0x0070(0x0030) Edit, BlueprintVisible, IsPlainOldData, RepSkip, NoDestructor, NativeAccessSpecifierPublic
		struct FTransform                                          LastValue;                                               // 0x00A0(0x0030) BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, RepSkip, NoDestructor, NativeAccessSpecifierPublic
		struct FTransform                                          CurrentValue;                                            // 0x00D0(0x0030) BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, RepSkip, NoDestructor, NativeAccessSpecifierPublic
		struct FTransform                                          DesiredValue;                                            // 0x0100(0x0030) Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.InvestigationPoint
	 * Size -> 0x00C0
	 */
	struct FInvestigationPoint
	{
	public:
		unsigned char                                              UnknownData_MAOX[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ARBInvestigationPoint*                               InvPoint;                                                // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ARBDoor*                                             door;                                                    // 0x0018(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class URBHidespotComponent*                                hidespotComponent;                                       // 0x0020(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ARBInteractible*                                     interactible;                                            // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ARBLedgeMarker*                                      LedgeMarker;                                             // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PH6A[0x88];                                  // 0x0038(0x0088) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.NPCInvestigationSelectedAnimData
	 * Size -> 0x0030
	 */
	struct FNPCInvestigationSelectedAnimData
	{
	public:
		bool                                                       bValid;                                                  // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RSRQ[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequence*                                       AnimSequence;                                            // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENPCInvestigationAnimIntensity                             Intensity;                                               // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENPCInvestigationAnimCategory                              Category;                                                // 0x0011(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnterInMotion;                                          // 0x0012(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P9WA[0x1];                                   // 0x0013(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      EntrySpeed;                                              // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EntryPhase;                                              // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bGreatFit;                                               // 0x001C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L42R[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class URBNPCInterestPointComponent*>                InterestPoints;                                          // 0x0020(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.InvestigationInterestPointData
	 * Size -> 0x0028
	 */
	struct FInvestigationInterestPointData
	{
	public:
		class URBNPCInterestPointComponent*                        InterestPoint;                                           // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ExplicitInterestLocation;                                // 0x0008(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Score;                                                   // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bClearLineCheck;                                         // 0x0018(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4QTN[0xB];                                   // 0x0019(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LookDuration;                                            // 0x0024(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.AIStimulusInfo
	 * Size -> 0x0020
	 */
	struct FAIStimulusInfo
	{
	public:
		float                                                      OccuranceTimestamp;                                      // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Location;                                                // 0x0004(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              SourceActor;                                             // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EStimulusType                                              Type;                                                    // 0x0018(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UJY8[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StimulusStrengthMultiplier;                              // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.InternalIntByDifficulty
	 * Size -> 0x0020
	 */
	struct FInternalIntByDifficulty
	{
	public:
		bool                                                       bOverrideEasyLocalValue;                                 // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JDP3[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    EasyLocalValue;                                          // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideNormalLocalValue;                               // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E1HQ[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    NormalLocalValue;                                        // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideHardLocalValue;                                 // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NQN4[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    HardLocalValue;                                          // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideInsaneLocalValue;                               // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4CQI[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    InsaneLocalValue;                                        // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.ConfigurableInt
	 * Size -> 0x0090 (FullSize[0x00C8] - InheritedSize[0x0038])
	 */
	struct FConfigurableInt : public FConfigurableValue
	{
	public:
		struct FInternalIntByDifficulty                            DefaultValues;                                           // 0x0038(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLocalOverrideFor1P;                                     // 0x0058(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1KEE[0x3];                                   // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FInternalIntByDifficulty                            Values1P;                                                // 0x005C(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLocalOverrideFor2P;                                     // 0x007C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YVCA[0x3];                                   // 0x007D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FInternalIntByDifficulty                            Values2P;                                                // 0x0080(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLocalOverrideFor3P;                                     // 0x00A0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9CXA[0x3];                                   // 0x00A1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FInternalIntByDifficulty                            Values3P;                                                // 0x00A4(0x0020) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MOIC[0x4];                                   // 0x00C4(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIGlobalConfig
	 * Size -> 0x0048
	 */
	struct FAIGlobalConfig
	{
	public:
		ENPCFlavor                                                 NPCFlavor;                                               // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_NPCFlavor : 1;                                 // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnorePlayers;                                          // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bIgnorePlayers : 1;                            // 0x0003(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bStartNeutral;                                           // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bStartNeutral : 1;                             // 0x0005(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bChasePlayers;                                           // 0x0006(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bChasePlayers : 1;                             // 0x0007(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAlwaysChase;                                            // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bAlwaysChase : 1;                              // 0x0009(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAlwaysIntense;                                          // 0x000A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bAlwaysIntense : 1;                            // 0x000B(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanPlayLookAts;                                         // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bCanPlayLookAts : 1;                           // 0x000D(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanTakeDamage;                                          // 0x000E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bCanTakeDamage : 1;                            // 0x000F(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BaseHealth;                                              // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BaseHealth : 1;                                // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENPCWeapon                                                 Weapon;                                                  // 0x0015(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_Weapon : 1;                                    // 0x0016(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRelevantForMusic;                                       // 0x0017(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bRelevantForMusic : 1;                         // 0x0018(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WK61[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxClimbHeight;                                          // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxClimbHeight : 1;                            // 0x0020(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LWG6[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxDropHeight;                                           // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxDropHeight : 1;                             // 0x0028(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBotDoorPassBehavior                                       DoorPassBehavior;                                        // 0x0029(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DoorPassBehavior : 1;                          // 0x002A(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Y9LZ[0x1];                                   // 0x002B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DoorCloseProbability;                                    // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DoorCloseProbability : 1;                      // 0x0030(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2B9L[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DoorLockProbability;                                     // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DoorLockProbability : 1;                       // 0x0038(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YKDV[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PairedMoveInterruptUnawareTime;                          // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PairedMoveInterruptUnawareTime : 1;            // 0x0040(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENPCHitReactionType                                        InterruptionReactionType;                                // 0x0041(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_InterruptionReactionType : 1;                  // 0x0042(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENPCHitReactionType                                        UpgradedInterruptionReactionType;                        // 0x0043(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_UpgradedInterruptionReactionType : 1;          // 0x0044(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENPCHitReactionType                                        FallingReactionType;                                     // 0x0045(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_FallingReactionType : 1;                       // 0x0046(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9TAV[0x1];                                   // 0x0047(0x0001) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIClosetConfig
	 * Size -> 0x0030
	 */
	struct FAIClosetConfig
	{
	public:
		float                                                      DistanceScoreContribution;                               // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DistanceScoreContribution : 1;                 // 0x0004(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UMXX[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxDistanceForPoints;                                    // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxDistanceForPoints : 1;                      // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GHYT[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxDistanceForPathedPoints;                              // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxDistanceForPathedPoints : 1;                // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0X2D[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RandomScoreContribution;                                 // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RandomScoreContribution : 1;                   // 0x001C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EMQA[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      UntriedDestinationScoreContribution;                     // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_UntriedDestinationScoreContribution : 1;       // 0x0024(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RIB1[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SpawnLocationScoreContribution;                          // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SpawnLocationScoreContribution : 1;            // 0x002C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OYMW[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AISpeedConfig
	 * Size -> 0x0130
	 */
	struct FAISpeedConfig
	{
	public:
		float                                                      BaseSpeed;                                               // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BaseSpeed : 1;                                 // 0x0004(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7B2P[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ChaseSpeed;                                              // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_ChaseSpeed : 1;                                // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NLLF[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InvestigationSpeedAware;                                 // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_InvestigationSpeedAware : 1;                   // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_INHY[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InvestigationSpeedUnaware;                               // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_InvestigationSpeedUnaware : 1;                 // 0x001C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X9S6[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RetirementSpeed;                                         // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RetirementSpeed : 1;                           // 0x0024(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4JBK[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PlayerAvoidanceSpeed;                                    // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PlayerAvoidanceSpeed : 1;                      // 0x002C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L0YM[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BehaviorAccelRate;                                       // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BehaviorAccelRate : 1;                         // 0x0034(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3K98[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BehaviorDecelRate;                                       // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BehaviorDecelRate : 1;                         // 0x003C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInstantAccel;                                           // 0x003D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bInstantAccel : 1;                             // 0x003E(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInstantDecel;                                           // 0x003F(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bInstantDecel : 1;                             // 0x0040(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J2DK[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DarknessFactor;                                          // 0x0044(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DarknessFactor : 1;                            // 0x0048(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableSprint;                                           // 0x0049(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bEnableSprint : 1;                             // 0x004A(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4LUY[0x1];                                   // 0x004B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxSprintSpeedGain;                                      // 0x004C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxSprintSpeedGain : 1;                        // 0x0050(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O2QT[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SprintAcceleration;                                      // 0x0054(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SprintAcceleration : 1;                        // 0x0058(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AEGH[0x3];                                   // 0x0059(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SprintDeceleration;                                      // 0x005C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SprintDeceleration : 1;                        // 0x0060(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9HER[0x3];                                   // 0x0061(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinSpeedForSprint;                                       // 0x0064(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinSpeedForSprint : 1;                         // 0x0068(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NQDK[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinStraightDistForSprintAccel;                           // 0x006C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinStraightDistForSprintAccel : 1;             // 0x0070(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_F6DO[0x3];                                   // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinStraightDistForSprintKeep;                            // 0x0074(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinStraightDistForSprintKeep : 1;              // 0x0078(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableNPCStamina;                                       // 0x0079(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bEnableNPCStamina : 1;                         // 0x007A(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BK8Y[0x1];                                   // 0x007B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxStaminaSpeedLoss;                                     // 0x007C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxStaminaSpeedLoss : 1;                       // 0x0080(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GBWM[0x3];                                   // 0x0081(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StaminaLevelForStartSlowdown;                            // 0x0084(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_StaminaLevelForStartSlowdown : 1;              // 0x0088(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_95XC[0x3];                                   // 0x0089(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinSpeedForStaminaConsumption;                           // 0x008C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinSpeedForStaminaConsumption : 1;             // 0x0090(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S2Q6[0x3];                                   // 0x0091(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxSpeedForStaminaConsumption;                           // 0x0094(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxSpeedForStaminaConsumption : 1;             // 0x0098(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T92D[0x3];                                   // 0x0099(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxStaminaComsumptionRate;                               // 0x009C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxStaminaComsumptionRate : 1;                 // 0x00A0(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q3A6[0x3];                                   // 0x00A1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StaminaRecoveryRate;                                     // 0x00A4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_StaminaRecoveryRate : 1;                       // 0x00A8(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SUB9[0x3];                                   // 0x00A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FaceOffAdjustSpeedBoost;                                 // 0x00AC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_FaceOffAdjustSpeedBoost : 1;                   // 0x00B0(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V19Z[0x3];                                   // 0x00B1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AttackMercyFactor;                                       // 0x00B4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_AttackMercyFactor : 1;                         // 0x00B8(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VY29[0x3];                                   // 0x00B9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AttackMercyDuration;                                     // 0x00BC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_AttackMercyDuration : 1;                       // 0x00C0(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V4OS[0x3];                                   // 0x00C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      GroupChasingRestartSpeedDuration;                        // 0x00C4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_GroupChasingRestartSpeedDuration : 1;          // 0x00C8(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2ODA[0x3];                                   // 0x00C9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ChaseNoVisibilityFactor;                                 // 0x00CC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_ChaseNoVisibilityFactor : 1;                   // 0x00D0(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_19XW[0x3];                                   // 0x00D1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SightlessChaseSlowdownDuration;                          // 0x00D4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SightlessChaseSlowdownDuration : 1;            // 0x00D8(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNoVisibleRubberBandingSlowDown;                         // 0x00D9(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bNoVisibleRubberBandingSlowDown : 1;           // 0x00DA(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRubberBandingRequiresPlayerRun;                         // 0x00DB(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bRubberBandingRequiresPlayerRun : 1;           // 0x00DC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RNO0[0x3];                                   // 0x00DD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RubberBandingDelay;                                      // 0x00E0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RubberBandingDelay : 1;                        // 0x00E4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7XZX[0x3];                                   // 0x00E5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RubberBandingMinDist;                                    // 0x00E8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RubberBandingMinDist : 1;                      // 0x00EC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AL05[0x3];                                   // 0x00ED(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RubberBandingMaxDist;                                    // 0x00F0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RubberBandingMaxDist : 1;                      // 0x00F4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1JOV[0x3];                                   // 0x00F5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RubberBandingFactorMinDist;                              // 0x00F8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RubberBandingFactorMinDist : 1;                // 0x00FC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0V2K[0x3];                                   // 0x00FD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RubberBandingFactorMaxDist;                              // 0x0100(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RubberBandingFactorMaxDist : 1;                // 0x0104(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNoAdjustmentForSlopes;                                  // 0x0105(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bNoAdjustmentForSlopes : 1;                    // 0x0106(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MQMH[0x1];                                   // 0x0107(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxSpeedPenaltyForUpSlope;                               // 0x0108(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxSpeedPenaltyForUpSlope : 1;                 // 0x010C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XKCI[0x3];                                   // 0x010D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxSpeedGainForDownSlope;                                // 0x0110(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxSpeedGainForDownSlope : 1;                  // 0x0114(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R3SR[0x3];                                   // 0x0115(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SpeedCapForLowHealth;                                    // 0x0118(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SpeedCapForLowHealth : 1;                      // 0x011C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IAQ5[0x3];                                   // 0x011D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LowHealthForSpeedCap;                                    // 0x0120(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_LowHealthForSpeedCap : 1;                      // 0x0124(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BZ3E[0x3];                                   // 0x0125(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HealthForSpeedCapStart;                                  // 0x0128(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_HealthForSpeedCapStart : 1;                    // 0x012C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_30IA[0x3];                                   // 0x012D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIAdvancedSpeedConfig
	 * Size -> 0x00A0
	 */
	struct FAIAdvancedSpeedConfig
	{
	public:
		float                                                      AccelCoeffNormal;                                        // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_AccelCoeffNormal : 1;                          // 0x0004(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P1DD[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AccelCoeffAfterTurn;                                     // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_AccelCoeffAfterTurn : 1;                       // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZITR[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DecelCoeffNormal;                                        // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DecelCoeffNormal : 1;                          // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A1TC[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DecelCoeffSharpTurn;                                     // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DecelCoeffSharpTurn : 1;                       // 0x001C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WQZ2[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DecelCoeffApproachDest;                                  // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DecelCoeffApproachDest : 1;                    // 0x0024(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8DYS[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DestApprochTargetDecel;                                  // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DestApprochTargetDecel : 1;                    // 0x002C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3ATV[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SmallRotationSpeed;                                      // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SmallRotationSpeed : 1;                        // 0x0034(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HX5R[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HighRotationSpeed;                                       // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_HighRotationSpeed : 1;                         // 0x003C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8DEJ[0x3];                                   // 0x003D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SpeedForRotationSlowDown;                                // 0x0040(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SpeedForRotationSlowDown : 1;                  // 0x0044(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_25H9[0x3];                                   // 0x0045(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SpeedForMaxRotationSlowDown;                             // 0x0048(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SpeedForMaxRotationSlowDown : 1;               // 0x004C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BMZX[0x3];                                   // 0x004D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SlowedDownSpeedForRotation;                              // 0x0050(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SlowedDownSpeedForRotation : 1;                // 0x0054(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LLKM[0x3];                                   // 0x0055(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TurnApproachDistForStartSlowDown;                        // 0x0058(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TurnApproachDistForStartSlowDown : 1;          // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ER6O[0x3];                                   // 0x005D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TurnApproachDistForMaxSlowDown;                          // 0x0060(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TurnApproachDistForMaxSlowDown : 1;            // 0x0064(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RG41[0x3];                                   // 0x0065(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinAnticipatedAngleForSlowDown;                          // 0x0068(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinAnticipatedAngleForSlowDown : 1;            // 0x006C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OZ5H[0x3];                                   // 0x006D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxAnticipatedAngleForSlowDown;                          // 0x0070(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxAnticipatedAngleForSlowDown : 1;            // 0x0074(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YDBT[0x3];                                   // 0x0075(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxPlayerAwaySpeedForSlowdown;                           // 0x0078(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxPlayerAwaySpeedForSlowdown : 1;             // 0x007C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NO3G[0x3];                                   // 0x007D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinDistToObstacle;                                       // 0x0080(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinDistToObstacle : 1;                         // 0x0084(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_653O[0x3];                                   // 0x0085(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxDistToObstacle;                                       // 0x0088(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxDistToObstacle : 1;                         // 0x008C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U9VS[0x3];                                   // 0x008D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SlowDownAfterTurnDuration;                               // 0x0090(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SlowDownAfterTurnDuration : 1;                 // 0x0094(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MFYE[0x3];                                   // 0x0095(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxReasonableGroundSpeed;                                // 0x0098(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxReasonableGroundSpeed : 1;                  // 0x009C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZO16[0x3];                                   // 0x009D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIHealthConfig
	 * Size -> 0x0024
	 */
	struct FAIHealthConfig
	{
	public:
		bool                                                       bRegenHealth;                                            // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bRegenHealth : 1;                              // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BMC2[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RegenDelay;                                              // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RegenDelay : 1;                                // 0x0008(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_94OO[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RegenRate;                                               // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RegenRate : 1;                                 // 0x0010(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanBeKnockedOut;                                        // 0x0011(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bCanBeKnockedOut : 1;                          // 0x0012(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5U6S[0x1];                                   // 0x0013(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinKnockoutDuration;                                     // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinKnockoutDuration : 1;                       // 0x0018(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6066[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxKnockoutDuration;                                     // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxKnockoutDuration : 1;                       // 0x0020(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_C51F[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIVisionCone
	 * Size -> 0x0030
	 */
	struct FAIVisionCone
	{
	public:
		float                                                      MaxForwardDistance;                                      // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxForwardDistance : 1;                        // 0x0004(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_05OQ[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxPeripheralDistance;                                   // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxPeripheralDistance : 1;                     // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_83JN[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InnerHorzAngle;                                          // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_InnerHorzAngle : 1;                            // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UZUR[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OuterHorzAngle;                                          // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_OuterHorzAngle : 1;                            // 0x001C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XRCO[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InnerVertAngle;                                          // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_InnerVertAngle : 1;                            // 0x0024(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YJ3P[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OuterVertAngle;                                          // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_OuterVertAngle : 1;                            // 0x002C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5QUK[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIVisionConfig
	 * Size -> 0x0158
	 */
	struct FAIVisionConfig
	{
	public:
		bool                                                       bCanSeePlayers;                                          // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bCanSeePlayers : 1;                            // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAlwaysSeePlayers;                                       // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bAlwaysSeePlayers : 1;                         // 0x0003(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreDarkness;                                         // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bIgnoreDarkness : 1;                           // 0x0005(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X5A6[0x2];                                   // 0x0006(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIVisionCone                                       FullVisibilityCone;                                      // 0x0008(0x0030) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_FullVisibilityCone : 1;                        // 0x0038(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OI65[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIVisionCone                                       PartialVisibilityCone;                                   // 0x003C(0x0030) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PartialVisibilityCone : 1;                     // 0x006C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GP2F[0x3];                                   // 0x006D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIVisionCone                                       DarknessFullVisibilityCone;                              // 0x0070(0x0030) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DarknessFullVisibilityCone : 1;                // 0x00A0(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RCRA[0x3];                                   // 0x00A1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIVisionCone                                       DarknessPartialVisibilityCone;                           // 0x00A4(0x0030) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DarknessPartialVisibilityCone : 1;             // 0x00D4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SH9U[0x3];                                   // 0x00D5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CloseDistance_FullVisibility;                            // 0x00D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_CloseDistance_FullVisibility : 1;              // 0x00DC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L1HB[0x3];                                   // 0x00DD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CloseDistance_PartialVisibility;                         // 0x00E0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_CloseDistance_PartialVisibility : 1;           // 0x00E4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_736Y[0x3];                                   // 0x00E5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SeeOnlyEyesVisionMultiplier;                             // 0x00E8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SeeOnlyEyesVisionMultiplier : 1;               // 0x00EC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OOJU[0x3];                                   // 0x00ED(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SeeOnlyTorsoVisionMultiplier;                            // 0x00F0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SeeOnlyTorsoVisionMultiplier : 1;              // 0x00F4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BRCT[0x3];                                   // 0x00F5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DarknessVisionMultiplier;                                // 0x00F8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DarknessVisionMultiplier : 1;                  // 0x00FC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_75ZB[0x3];                                   // 0x00FD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CloseRangeVisionMultiplier;                              // 0x0100(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_CloseRangeVisionMultiplier : 1;                // 0x0104(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TTVH[0x3];                                   // 0x0105(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StandingStillVisionMultiplier;                           // 0x0108(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_StandingStillVisionMultiplier : 1;             // 0x010C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RFMR[0x3];                                   // 0x010D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WalkingVisionMultiplier;                                 // 0x0110(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_WalkingVisionMultiplier : 1;                   // 0x0114(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KRZO[0x3];                                   // 0x0115(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RunningVisionMultiplier;                                 // 0x0118(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_RunningVisionMultiplier : 1;                   // 0x011C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_F6WF[0x3];                                   // 0x011D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CrouchingVisionMultiplier;                               // 0x0120(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_CrouchingVisionMultiplier : 1;                 // 0x0124(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AITL[0x3];                                   // 0x0125(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HidespotPeekingVisionMultiplier;                         // 0x0128(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_HidespotPeekingVisionMultiplier : 1;           // 0x012C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TS7Y[0x3];                                   // 0x012D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HidespotHiddenVisionMultiplier;                          // 0x0130(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_HidespotHiddenVisionMultiplier : 1;            // 0x0134(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_F77C[0x3];                                   // 0x0135(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinimumVisionMultiplierToBeSeen;                         // 0x0138(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinimumVisionMultiplierToBeSeen : 1;           // 0x013C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BZVR[0x3];                                   // 0x013D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FullVisToPartialVisVisionMultiplierThreshold;            // 0x0140(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_FullVisToPartialVisVisionMultiplierThreshold : 1; // 0x0144(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IOVE[0x3];                                   // 0x0145(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BotVisionCheckSlicing;                                   // 0x0148(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BotVisionCheckSlicing : 1;                     // 0x014C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SVUE[0x3];                                   // 0x014D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    TotalNumberOfClearChecks;                                // 0x0150(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TotalNumberOfClearChecks : 1;                  // 0x0154(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1K2Y[0x3];                                   // 0x0155(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIHearingConfig
	 * Size -> 0x001C
	 */
	struct FAIHearingConfig
	{
	public:
		bool                                                       bCanHearPlayers;                                         // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bCanHearPlayers : 1;                           // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XQJT[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FullHearingDistance;                                     // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_FullHearingDistance : 1;                       // 0x0008(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1E12[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxHearingDistance;                                      // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxHearingDistance : 1;                        // 0x0010(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HAEK[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AudioPerceptionScaling;                                  // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_AudioPerceptionScaling : 1;                    // 0x0018(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8AVB[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIStimulusValueConfig
	 * Size -> 0x0040
	 */
	struct FAIStimulusValueConfig
	{
	public:
		float                                                      PartialPlayerVisibilityValue;                            // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PartialPlayerVisibilityValue : 1;              // 0x0004(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S618[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FullPlayerVisibilityValue;                               // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_FullPlayerVisibilityValue : 1;                 // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2G41[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LostChasedPlayerValue;                                   // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_LostChasedPlayerValue : 1;                     // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8M24[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinorAudioValue;                                         // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinorAudioValue : 1;                           // 0x001C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FGOG[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      NormalAudioValue;                                        // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_NormalAudioValue : 1;                          // 0x0024(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9HG7[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ObviousAudioValue;                                       // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_ObviousAudioValue : 1;                         // 0x002C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IFR0[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SurfaceMovementValue;                                    // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SurfaceMovementValue : 1;                      // 0x0034(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GKF3[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HighPriorityEventValue;                                  // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_HighPriorityEventValue : 1;                    // 0x003C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P47I[0x3];                                   // 0x003D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AIStimulusOptionConfig
	 * Size -> 0x0010
	 */
	struct FAIStimulusOptionConfig
	{
	public:
		bool                                                       bPartialPlayerVisibility;                                // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bPartialPlayerVisibility : 1;                  // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bFullPlayerVisibility;                                   // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bFullPlayerVisibility : 1;                     // 0x0003(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLostChasedPlayer;                                       // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bLostChasedPlayer : 1;                         // 0x0005(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bMinorAudio;                                             // 0x0006(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bMinorAudio : 1;                               // 0x0007(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNormalAudio;                                            // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bNormalAudio : 1;                              // 0x0009(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bObviousAudio;                                           // 0x000A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bObviousAudio : 1;                             // 0x000B(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSurfaceMovement;                                        // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bSurfaceMovement : 1;                          // 0x000D(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bHighPriorityEvent;                                      // 0x000E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bHighPriorityEvent : 1;                        // 0x000F(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct OPP.AIAwarenessConfig
	 * Size -> 0x01C0
	 */
	struct FAIAwarenessConfig
	{
	public:
		bool                                                       bAllowAwarenessLoop;                                     // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bAllowAwarenessLoop : 1;                       // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bConvertHighPriorityToObvious;                           // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bConvertHighPriorityToObvious : 1;             // 0x0003(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanEnterSuspicious;                                     // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bCanEnterSuspicious : 1;                       // 0x0005(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAlwaysAlerted;                                          // 0x0006(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bAlwaysAlerted : 1;                            // 0x0007(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AlertedFromUnawareStartingMeter;                         // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_AlertedFromUnawareStartingMeter : 1;           // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XC8V[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinimumStimulusStrenght;                                 // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinimumStimulusStrenght : 1;                   // 0x0014(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_31BN[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinDelayBetweenInvestigationTargetSwitch;                // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinDelayBetweenInvestigationTargetSwitch : 1;  // 0x001C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SSRL[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinDistanceForInvestigationTargetSwitch;                 // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinDistanceForInvestigationTargetSwitch : 1;   // 0x0024(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZJYY[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinAngleForInvestigationTargetSwitch;                    // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MinAngleForInvestigationTargetSwitch : 1;      // 0x002C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2P1C[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIStimulusValueConfig                              UnawareStimulusMeterValues;                              // 0x0030(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_UnawareStimulusMeterValues : 1;                // 0x0070(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4NZH[0x3];                                   // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TimeBeforeUnawareMeterDecay;                             // 0x0074(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TimeBeforeUnawareMeterDecay : 1;               // 0x0078(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YWAY[0x3];                                   // 0x0079(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      UnawareMeterDecaySpeed;                                  // 0x007C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_UnawareMeterDecaySpeed : 1;                    // 0x0080(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9JIO[0x3];                                   // 0x0081(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TimeBeforeExitingChaseAfterLostSight;                    // 0x0084(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TimeBeforeExitingChaseAfterLostSight : 1;      // 0x0088(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OYKO[0x3];                                   // 0x0089(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TimeBeforeExitingChaseAfterInvalidExecute;               // 0x008C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TimeBeforeExitingChaseAfterInvalidExecute : 1; // 0x0090(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAIStimulusOptionConfig                             DirectToAlertedFromUnawareStimulus;                      // 0x0091(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DirectToAlertedFromUnawareStimulus : 1;        // 0x00A1(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3NAR[0x2];                                   // 0x00A2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIStimulusValueConfig                              SuspiciousStimulusMeterValues;                           // 0x00A4(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_SuspiciousStimulusMeterValues : 1;             // 0x00E4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RZBP[0x3];                                   // 0x00E5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxSuspiciousInvestigationTime;                          // 0x00E8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxSuspiciousInvestigationTime : 1;            // 0x00EC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAIStimulusOptionConfig                             StimulusForProgressiveAlertedMeter;                      // 0x00ED(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_StimulusForProgressiveAlertedMeter : 1;        // 0x00FD(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UX3C[0x2];                                   // 0x00FE(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIStimulusValueConfig                              ProgressiveAlertedMeterValues;                           // 0x0100(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_ProgressiveAlertedMeterValues : 1;             // 0x0140(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1ZTM[0x3];                                   // 0x0141(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxAlertedSourceInvestigationTime;                       // 0x0144(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxAlertedSourceInvestigationTime : 1;         // 0x0148(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_602P[0x3];                                   // 0x0149(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIStimulusValueConfig                              StimuliPriorities;                                       // 0x014C(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_StimuliPriorities : 1;                         // 0x018C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XO0M[0x3];                                   // 0x018D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxQueuedStimulusTime;                                   // 0x0190(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxQueuedStimulusTime : 1;                     // 0x0194(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBreakChaseForHighPriorityEvent;                         // 0x0195(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bBreakChaseForHighPriorityEvent : 1;           // 0x0196(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XT0U[0x1];                                   // 0x0197(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DistanceToBreakChaseForHighPriorityEvent;                // 0x0198(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DistanceToBreakChaseForHighPriorityEvent : 1;  // 0x019C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V9Q8[0x3];                                   // 0x019D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DistanceFromHighPriorityToResumeChase;                   // 0x01A0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DistanceFromHighPriorityToResumeChase : 1;     // 0x01A4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LWJF[0x3];                                   // 0x01A5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxLastSeenDistFromHidingSpotForGuess;                   // 0x01A8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxLastSeenDistFromHidingSpotForGuess : 1;     // 0x01AC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PUOM[0x3];                                   // 0x01AD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxHidingSpotDistFromOtherSpotForGuess;                  // 0x01B0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_MaxHidingSpotDistFromOtherSpotForGuess : 1;    // 0x01B4(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q97Y[0x3];                                   // 0x01B5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BerserkerMaxDistanceForInstantAttack;                    // 0x01B8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BerserkerMaxDistanceForInstantAttack : 1;      // 0x01BC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RLFT[0x3];                                   // 0x01BD(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct OPP.AITargettingConfig
	 * Size -> 0x0074
	 */
	struct FAITargettingConfig
	{
	public:
		bool                                                       bAlwaysTargetLastAttacker;                               // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bAlwaysTargetLastAttacker : 1;                 // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSwitchTargetAfterAttack;                                // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_bSwitchTargetAfterAttack : 1;                  // 0x0003(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TimeForSwitchTargetAfterAttack;                          // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TimeForSwitchTargetAfterAttack : 1;            // 0x0008(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DJJX[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TimeForSwitchTargetAfterBeingAttacked;                   // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TimeForSwitchTargetAfterBeingAttacked : 1;     // 0x0010(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DA54[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TimeForLastSwitchTargetBias;                             // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TimeForLastSwitchTargetBias : 1;               // 0x0018(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B6KG[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LastSwitchTargetBias;                                    // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_LastSwitchTargetBias : 1;                      // 0x0020(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R3SI[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BackDistanceMultiplier;                                  // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BackDistanceMultiplier : 1;                    // 0x0028(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BC3O[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      HeightDistanceMultiplier;                                // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_HeightDistanceMultiplier : 1;                  // 0x0030(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9703[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PlayerIncapacitatedBias;                                 // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PlayerIncapacitatedBias : 1;                   // 0x0038(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AL24[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PlayerOutsideLeashBias;                                  // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PlayerOutsideLeashBias : 1;                    // 0x0040(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K8KM[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PlayerNotVisibleBias;                                    // 0x0044(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PlayerNotVisibleBias : 1;                      // 0x0048(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2A8I[0x3];                                   // 0x0049(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PlayerIsHighPriorityBias;                                // 0x004C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_PlayerIsHighPriorityBias : 1;                  // 0x0050(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UE3L[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CurrentTargetBias;                                       // 0x0054(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
