#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.OnRep_ToggledOff
	 */
	struct AParent_DestructibleDoorWindow_BP_C_OnRep_ToggledOff_Params
	{	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.Update Broken Window
	 */
	struct AParent_DestructibleDoorWindow_BP_C_Update_Broken_Window_Params
	{	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDamaged__DelegateSignature
	 */
	struct AParent_DestructibleDoorWindow_BP_C_BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDamaged__DelegateSignature_Params
	{
	public:
		class URBDamageableComponent*                              DamageableComponent;                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       IsDestroyed;                                             // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.Event_OnResetStage
	 */
	struct AParent_DestructibleDoorWindow_BP_C_Event_OnResetStage_Params
	{	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.Event_SnapToState
	 */
	struct AParent_DestructibleDoorWindow_BP_C_Event_SnapToState_Params
	{	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableReset__DelegateSignature
	 */
	struct AParent_DestructibleDoorWindow_BP_C_BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableReset__DelegateSignature_Params
	{
	public:
		class URBDamageableComponent*                              DamageableComponent;                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.PostToggled
	 */
	struct AParent_DestructibleDoorWindow_BP_C_PostToggled_Params
	{
	public:
		bool                                                       bToggleEnabled;                                          // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.BndEvt__Parent_DestructibleDoorWindow_BP_DamageableComponent_K2Node_ComponentBoundEvent_2_OnDamageableEvent__DelegateSignature
	 */
	struct AParent_DestructibleDoorWindow_BP_C_BndEvt__Parent_DestructibleDoorWindow_BP_DamageableComponent_K2Node_ComponentBoundEvent_2_OnDamageableEvent__DelegateSignature_Params
	{
	public:
		class URBDamageableComponent*                              DamageableComponent;                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C.ExecuteUbergraph_Parent_DestructibleDoorWindow_BP
	 */
	struct AParent_DestructibleDoorWindow_BP_C_ExecuteUbergraph_Parent_DestructibleDoorWindow_BP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
