#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Finished_1B7ED78D47D24A29ECB5FF94734C6C40
	 */
	struct UPartyInviteHudWidget_C_Finished_1B7ED78D47D24A29ECB5FF94734C6C40_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_Show
	 */
	struct UPartyInviteHudWidget_C_Event_Show_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_UpdateDisplayTime
	 */
	struct UPartyInviteHudWidget_C_Event_UpdateDisplayTime_Params
	{
	public:
		float                                                      DisplayTime;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      totalDisplayTime;                                        // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_Hide
	 */
	struct UPartyInviteHudWidget_C_Event_Hide_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_Accepted
	 */
	struct UPartyInviteHudWidget_C_Event_Accepted_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_Refused
	 */
	struct UPartyInviteHudWidget_C_Event_Refused_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.PreConstruct
	 */
	struct UPartyInviteHudWidget_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_InputSourceChanged
	 */
	struct UPartyInviteHudWidget_C_Event_InputSourceChanged_Params
	{
	public:
		bool                                                       bIsGamepad;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_0_OnAcceptedButtonClicked__DelegateSignature
	 */
	struct UPartyInviteHudWidget_C_BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_0_OnAcceptedButtonClicked__DelegateSignature_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_1_OnDeclinedButtonClicked__DelegateSignature
	 */
	struct UPartyInviteHudWidget_C_BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_1_OnDeclinedButtonClicked__DelegateSignature_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_Blocked
	 */
	struct UPartyInviteHudWidget_C_Event_Blocked_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_2_OnBlockButtonClicked__DelegateSignature
	 */
	struct UPartyInviteHudWidget_C_BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_2_OnBlockButtonClicked__DelegateSignature_Params
	{	};

	/**
	 * Function PartyInviteHudWidget.PartyInviteHudWidget_C.ExecuteUbergraph_PartyInviteHudWidget
	 */
	struct UPartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
