#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass player_3P_AnimBP.player_3P_AnimBP_C
	 * Size -> 0xD27C (FullSize[0xE3CC] - InheritedSize[0x1150])
	 */
	class Uplayer_3P_AnimBP_C : public URBAnimInstancePlayer3P
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x1150(0x0008) ZeroConstructor, Transient, DuplicateTransient
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_6;                                    // 0x1158(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_5;                                    // 0x11A0(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_8;                        // 0x11E8(0x00C0)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_7;                        // 0x12A8(0x00C0)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_9;                          // 0x1368(0x0158)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_19;                          // 0x14C0(0x0028)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_8;                          // 0x14E8(0x0158)
		struct FAnimNode_LegIK                                     AnimGraphNode_LegIK_4;                                   // 0x1640(0x00F8)
		struct FAnimNode_LegIK                                     AnimGraphNode_LegIK_3;                                   // 0x1738(0x00F8)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_5;                              // 0x1830(0x0108)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_6;                   // 0x1938(0x0020)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_6;                   // 0x1958(0x0020)
		struct FAnimNode_CopyPoseFromMesh                          AnimGraphNode_CopyPoseFromMesh_3;                        // 0x1978(0x01D8) ContainsInstancedReference
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_7;                          // 0x1B50(0x0158)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_5;                   // 0x1CA8(0x0020)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_158;                      // 0x1CC8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_157;                      // 0x1CF0(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_109;                        // 0x1D18(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_108;                        // 0x1D98(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_29;                        // 0x1E18(0x00A8)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_6;                        // 0x1EC0(0x00C0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_18;                          // 0x1F80(0x0028)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_4;                           // 0x1FA8(0x00C8)
		struct FAnimNode_BlendSpaceEvaluator                       AnimGraphNode_BlendSpaceEvaluator_3;                     // 0x2070(0x00F0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_28;                        // 0x2160(0x00A8)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_3;                           // 0x2208(0x00C8)
		struct FAnimNode_BlendSpaceEvaluator                       AnimGraphNode_BlendSpaceEvaluator_2;                     // 0x22D0(0x00F0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_17;                          // 0x23C0(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_90;                            // 0x23E8(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_16;                          // 0x2418(0x0028)
		struct FAnimNode_RotationOffsetBlendSpace                  AnimGraphNode_RotationOffsetBlendSpace;                  // 0x2440(0x0190)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_89;                            // 0x25D0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_16;                           // 0x2600(0x00B0)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_5;                        // 0x26B0(0x00C0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_15;                          // 0x2770(0x0028)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_6;                          // 0x2798(0x0158)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_5;                          // 0x28F0(0x0158)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_14;                          // 0x2A48(0x0028)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_4;                                    // 0x2A70(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_4;                        // 0x2AB8(0x00C0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_107;                        // 0x2B78(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_106;                        // 0x2BF8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_27;                        // 0x2C78(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_26;                        // 0x2D20(0x00A8)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_13;                          // 0x2DC8(0x0028)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_3;                                    // 0x2DF0(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_4;                          // 0x2E38(0x0158)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_12;                          // 0x2F90(0x0028)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_11;                          // 0x2FB8(0x0028)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_2;                                    // 0x2FE0(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_25;                        // 0x3028(0x00A8)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_156;                      // 0x30D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_155;                      // 0x30F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_154;                      // 0x3120(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_153;                      // 0x3148(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_105;                        // 0x3170(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_88;                            // 0x31F0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_104;                        // 0x3220(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_87;                            // 0x32A0(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_10;                          // 0x32D0(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_86;                            // 0x32F8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_15;                           // 0x3328(0x00B0)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_3;                          // 0x33D8(0x0158)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_152;                      // 0x3530(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_151;                      // 0x3558(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_150;                      // 0x3580(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_149;                      // 0x35A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_148;                      // 0x35D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_147;                      // 0x35F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_146;                      // 0x3620(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_145;                      // 0x3648(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_144;                      // 0x3670(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_143;                      // 0x3698(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_142;                      // 0x36C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_141;                      // 0x36E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_140;                      // 0x3710(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_139;                      // 0x3738(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_138;                      // 0x3760(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_137;                      // 0x3788(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_136;                      // 0x37B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_135;                      // 0x37D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_134;                      // 0x3800(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_133;                      // 0x3828(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_132;                      // 0x3850(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_131;                      // 0x3878(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_130;                      // 0x38A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_129;                      // 0x38C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_128;                      // 0x38F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_127;                      // 0x3918(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_126;                      // 0x3940(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_125;                      // 0x3968(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_124;                      // 0x3990(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_123;                      // 0x39B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_122;                      // 0x39E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_121;                      // 0x3A08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_120;                      // 0x3A30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_119;                      // 0x3A58(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_118;                      // 0x3A80(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_117;                      // 0x3AA8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_116;                      // 0x3AD0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_115;                      // 0x3AF8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_114;                      // 0x3B20(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_113;                      // 0x3B48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_112;                      // 0x3B70(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_103;                        // 0x3B98(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_85;                            // 0x3C18(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_102;                        // 0x3C48(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_84;                            // 0x3CC8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_101;                        // 0x3CF8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_83;                            // 0x3D78(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_100;                        // 0x3DA8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_82;                            // 0x3E28(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_99;                         // 0x3E58(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_81;                            // 0x3ED8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_98;                         // 0x3F08(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_80;                            // 0x3F88(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_97;                         // 0x3FB8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_79;                            // 0x4038(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_96;                         // 0x4068(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_78;                            // 0x40E8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_95;                         // 0x4118(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_77;                            // 0x4198(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_94;                         // 0x41C8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_93;                         // 0x4248(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_24;                        // 0x42C8(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_76;                            // 0x4370(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_24;                       // 0x43A0(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_75;                            // 0x4488(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_9;                           // 0x44B8(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_74;                            // 0x44E0(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_23;                       // 0x4510(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_73;                            // 0x45F8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_14;                           // 0x4628(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_72;                            // 0x46D8(0x0030)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_5;                   // 0x4708(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_4;                   // 0x4728(0x0020)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_4;                              // 0x4748(0x0108)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_92;                         // 0x4850(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_71;                            // 0x48D0(0x0030)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_4;                   // 0x4900(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_3;                   // 0x4920(0x0020)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_3;                              // 0x4940(0x0108)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_23;                        // 0x4A48(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_22;                       // 0x4AF0(0x00E8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_91;                         // 0x4BD8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_70;                            // 0x4C58(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_22;                        // 0x4C88(0x00A8)
		struct FAnimNode_BlendSpaceEvaluator                       AnimGraphNode_BlendSpaceEvaluator;                       // 0x4D30(0x00F0)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_8;                       // 0x4E20(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_69;                            // 0x4E70(0x0030)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_7;                       // 0x4EA0(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_68;                            // 0x4EF0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_90;                         // 0x4F20(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_67;                            // 0x4FA0(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_21;                       // 0x4FD0(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_66;                            // 0x50B8(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_111;                      // 0x50E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_110;                      // 0x5110(0x0028)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_6;                       // 0x5138(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_65;                            // 0x5188(0x0030)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_5;                       // 0x51B8(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_64;                            // 0x5208(0x0030)
		struct FAnimNode_RefPose                                   AnimGraphNode_LocalRefPose_2;                            // 0x5238(0x0018)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_63;                            // 0x5250(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_13;                           // 0x5280(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_62;                            // 0x5330(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_8;                           // 0x5360(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_61;                            // 0x5388(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_12;                           // 0x53B8(0x00B0)
		struct FAnimNode_LinkedAnimGraph                           AnimGraphNode_LinkedAnimGraph;                           // 0x5468(0x00A0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_89;                         // 0x5508(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_2;                          // 0x5588(0x0158)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot;                                      // 0x56E0(0x0048)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_109;                      // 0x5728(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_108;                      // 0x5750(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_107;                      // 0x5778(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_106;                      // 0x57A0(0x0028)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_21;                        // 0x57C8(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_88;                         // 0x5870(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_87;                         // 0x58F0(0x0080)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_3;                   // 0x5970(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_2;                   // 0x5990(0x0020)
		struct FAnimNode_TwoBoneIK                                 AnimGraphNode_TwoBoneIK_2;                               // 0x59B0(0x01E0)
		struct FAnimNode_TwoBoneIK                                 AnimGraphNode_TwoBoneIK;                                 // 0x5B90(0x01E0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_60;                            // 0x5D70(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_105;                      // 0x5DA0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_104;                      // 0x5DC8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_103;                      // 0x5DF0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_102;                      // 0x5E18(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_101;                      // 0x5E40(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_100;                      // 0x5E68(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_99;                       // 0x5E90(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_98;                       // 0x5EB8(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_86;                         // 0x5EE0(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_20;                        // 0x5F60(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_85;                         // 0x6008(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_59;                            // 0x6088(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_7;                           // 0x60B8(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_58;                            // 0x60E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_84;                         // 0x6110(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_57;                            // 0x6190(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_97;                       // 0x61C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_96;                       // 0x61E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_95;                       // 0x6210(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_94;                       // 0x6238(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_93;                       // 0x6260(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_92;                       // 0x6288(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_91;                       // 0x62B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_90;                       // 0x62D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_89;                       // 0x6300(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_88;                       // 0x6328(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_87;                       // 0x6350(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_86;                       // 0x6378(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_85;                       // 0x63A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_84;                       // 0x63C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_83;                       // 0x63F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_82;                       // 0x6418(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_81;                       // 0x6440(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_80;                       // 0x6468(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_79;                       // 0x6490(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_78;                       // 0x64B8(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_83;                         // 0x64E0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_56;                            // 0x6560(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_82;                         // 0x6590(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_55;                            // 0x6610(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_81;                         // 0x6640(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_54;                            // 0x66C0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_80;                         // 0x66F0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_79;                         // 0x6770(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_19;                        // 0x67F0(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_53;                            // 0x6898(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_78;                         // 0x68C8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_52;                            // 0x6948(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_77;                         // 0x6978(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_51;                            // 0x69F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_76;                         // 0x6A28(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_50;                            // 0x6AA8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_75;                         // 0x6AD8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_49;                            // 0x6B58(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_74;                         // 0x6B88(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_48;                            // 0x6C08(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_73;                         // 0x6C38(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_47;                            // 0x6CB8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_72;                         // 0x6CE8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_46;                            // 0x6D68(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_71;                         // 0x6D98(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_45;                            // 0x6E18(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_18;                        // 0x6E48(0x00A8)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_3;                        // 0x6EF0(0x00C0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_70;                         // 0x6FB0(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_6;                           // 0x7030(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_69;                         // 0x7058(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_44;                            // 0x70D8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_68;                         // 0x7108(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_43;                            // 0x7188(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_11;                           // 0x71B8(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_42;                            // 0x7268(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_67;                         // 0x7298(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_41;                            // 0x7318(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_10;                           // 0x7348(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_40;                            // 0x73F8(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_5;                           // 0x7428(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_39;                            // 0x7450(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_9;                            // 0x7480(0x00B0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_77;                       // 0x7530(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_76;                       // 0x7558(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_75;                       // 0x7580(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_74;                       // 0x75A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_73;                       // 0x75D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_72;                       // 0x75F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_71;                       // 0x7620(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_70;                       // 0x7648(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_69;                       // 0x7670(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_66;                         // 0x7698(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_38;                            // 0x7718(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_65;                         // 0x7748(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_37;                            // 0x77C8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_64;                         // 0x77F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_36;                            // 0x7878(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_63;                         // 0x78A8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_62;                         // 0x7928(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_17;                        // 0x79A8(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_35;                            // 0x7A50(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_61;                         // 0x7A80(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_16;                        // 0x7B00(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_60;                         // 0x7BA8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_34;                            // 0x7C28(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_4;                           // 0x7C58(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_33;                            // 0x7C80(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_8;                            // 0x7CB0(0x00B0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_3;                           // 0x7D60(0x0028)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose;                            // 0x7D88(0x0158)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_2;                        // 0x7EE0(0x00C0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_68;                       // 0x7FA0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_67;                       // 0x7FC8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_66;                       // 0x7FF0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_65;                       // 0x8018(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_64;                       // 0x8040(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_63;                       // 0x8068(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_62;                       // 0x8090(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_61;                       // 0x80B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_60;                       // 0x80E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_59;                       // 0x8108(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_58;                       // 0x8130(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_57;                       // 0x8158(0x0028)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_20;                       // 0x8180(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_19;                       // 0x8268(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_18;                       // 0x8350(0x00E8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_59;                         // 0x8438(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_5;                         // 0x84B8(0x00B8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_32;                            // 0x8570(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_58;                         // 0x85A0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_57;                         // 0x8620(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_56;                         // 0x86A0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_55;                         // 0x8720(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_4;                         // 0x87A0(0x00B8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_17;                       // 0x8858(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_16;                       // 0x8940(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_15;                       // 0x8A28(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_14;                       // 0x8B10(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_3;                         // 0x8BF8(0x00B8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_2;                         // 0x8CB0(0x00B8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum;                           // 0x8D68(0x00B8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_54;                         // 0x8E20(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_31;                            // 0x8EA0(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_15;                        // 0x8ED0(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_13;                       // 0x8F78(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_12;                       // 0x9060(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_30;                            // 0x9148(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_56;                       // 0x9178(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_55;                       // 0x91A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_54;                       // 0x91C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_53;                       // 0x91F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_52;                       // 0x9218(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_51;                       // 0x9240(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_50;                       // 0x9268(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_49;                       // 0x9290(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_48;                       // 0x92B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_47;                       // 0x92E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_46;                       // 0x9308(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_45;                       // 0x9330(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_44;                       // 0x9358(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_43;                       // 0x9380(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_42;                       // 0x93A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_41;                       // 0x93D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_40;                       // 0x93F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_39;                       // 0x9420(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_38;                       // 0x9448(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_37;                       // 0x9470(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_36;                       // 0x9498(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_35;                       // 0x94C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_34;                       // 0x94E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_33;                       // 0x9510(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_32;                       // 0x9538(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_31;                       // 0x9560(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_30;                       // 0x9588(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_29;                       // 0x95B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_28;                       // 0x95D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_27;                       // 0x9600(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_26;                       // 0x9628(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_25;                       // 0x9650(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_24;                       // 0x9678(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_23;                       // 0x96A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_22;                       // 0x96C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_21;                       // 0x96F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_20;                       // 0x9718(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_19;                       // 0x9740(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_18;                       // 0x9768(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_17;                       // 0x9790(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_16;                       // 0x97B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_15;                       // 0x97E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14;                       // 0x9808(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_13;                       // 0x9830(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_12;                       // 0x9858(0x0028)
		struct FAnimNode_RefPose                                   AnimGraphNode_LocalRefPose;                              // 0x9880(0x0018)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_29;                            // 0x9898(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_53;                         // 0x98C8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_28;                            // 0x9948(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_52;                         // 0x9978(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_27;                            // 0x99F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_51;                         // 0x9A28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_50;                         // 0x9AA8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_49;                         // 0x9B28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_48;                         // 0x9BA8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_47;                         // 0x9C28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_46;                         // 0x9CA8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_45;                         // 0x9D28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_44;                         // 0x9DA8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_43;                         // 0x9E28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_42;                         // 0x9EA8(0x0080)
		struct FAnimNode_BlendListByInt                            AnimGraphNode_BlendListByInt_3;                          // 0x9F28(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_26;                            // 0x9FD0(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11;                       // 0xA000(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_10;                       // 0xA028(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_41;                         // 0xA050(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_40;                         // 0xA0D0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_39;                         // 0xA150(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_38;                         // 0xA1D0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_37;                         // 0xA250(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_36;                         // 0xA2D0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_35;                         // 0xA350(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_34;                         // 0xA3D0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_33;                         // 0xA450(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_32;                         // 0xA4D0(0x0080)
		struct FAnimNode_BlendListByInt                            AnimGraphNode_BlendListByInt_2;                          // 0xA550(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_25;                            // 0xA5F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_31;                         // 0xA628(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_30;                         // 0xA6A8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_29;                         // 0xA728(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_28;                         // 0xA7A8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_27;                         // 0xA828(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_26;                         // 0xA8A8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_25;                         // 0xA928(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_24;                         // 0xA9A8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_23;                         // 0xAA28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_22;                         // 0xAAA8(0x0080)
		struct FAnimNode_BlendListByInt                            AnimGraphNode_BlendListByInt;                            // 0xAB28(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_24;                            // 0xABD0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_7;                            // 0xAC00(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_23;                            // 0xACB0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_21;                         // 0xACE0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_22;                            // 0xAD60(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_20;                         // 0xAD90(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_21;                            // 0xAE10(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9;                        // 0xAE40(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_19;                         // 0xAE68(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_20;                            // 0xAEE8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_18;                         // 0xAF18(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_19;                            // 0xAF98(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_17;                         // 0xAFC8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_18;                            // 0xB048(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_16;                         // 0xB078(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_17;                            // 0xB0F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_15;                         // 0xB128(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_14;                        // 0xB1A8(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_14;                         // 0xB250(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_16;                            // 0xB2D0(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8;                        // 0xB300(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7;                        // 0xB328(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_13;                         // 0xB350(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_13;                        // 0xB3D0(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_11;                       // 0xB478(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_12;                        // 0xB560(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_10;                       // 0xB608(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_15;                            // 0xB6F0(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_11;                        // 0xB720(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_12;                         // 0xB7C8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_11;                         // 0xB848(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_14;                            // 0xB8C8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_6;                            // 0xB8F8(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_13;                            // 0xB9A8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10;                         // 0xB9D8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_10;                        // 0xBA58(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9;                          // 0xBB00(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_12;                            // 0xBB80(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_9;                         // 0xBBB0(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8;                          // 0xBC58(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7;                          // 0xBCD8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_8;                         // 0xBD58(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_9;                        // 0xBE00(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_11;                            // 0xBEE8(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6;                        // 0xBF18(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5;                        // 0xBF40(0x0028)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_8;                        // 0xBF68(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_7;                        // 0xC050(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_7;                         // 0xC138(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_10;                            // 0xC1E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6;                          // 0xC210(0x0080)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_4;                       // 0xC290(0x0050)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_3;                       // 0xC2E0(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_6;                         // 0xC330(0x00A8)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_2;                           // 0xC3D8(0x00C8)
		struct FAnimNode_MakeDynamicAdditive                       AnimGraphNode_MakeDynamicAdditive_2;                     // 0xC4A0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5;                          // 0xC4D8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_9;                             // 0xC558(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_5;                            // 0xC588(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_8;                             // 0xC638(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_4;                            // 0xC668(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_7;                             // 0xC718(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4;                        // 0xC748(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3;                        // 0xC770(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2;                        // 0xC798(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult;                          // 0xC7C0(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4;                          // 0xC7E8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_6;                             // 0xC868(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_6;                        // 0xC898(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_5;                        // 0xC980(0x00E8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_2;                             // 0xCA68(0x00C8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend;                               // 0xCB30(0x00C8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_4;                        // 0xCBF8(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_3;                        // 0xCCE0(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_2;                        // 0xCDC8(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_5;                         // 0xCEB0(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_4;                         // 0xCF58(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_3;                         // 0xD000(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer;                          // 0xD0A8(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_5;                             // 0xD190(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3;                          // 0xD1C0(0x0080)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_2;                       // 0xD240(0x0050)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator;                         // 0xD290(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_2;                         // 0xD2E0(0x00A8)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive;                             // 0xD388(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2;                          // 0xD450(0x0080)
		struct FAnimNode_MakeDynamicAdditive                       AnimGraphNode_MakeDynamicAdditive;                       // 0xD4D0(0x0038)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_4;                             // 0xD508(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_3;                            // 0xD538(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_3;                             // 0xD5E8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_2;                            // 0xD618(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_2;                             // 0xD6C8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer;                            // 0xD6F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult;                               // 0xD778(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine;                              // 0xD7A8(0x00B0)
		struct FAnimNode_Root                                      AnimGraphNode_Root;                                      // 0xD858(0x0030)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_2;                   // 0xD888(0x0020)
		struct FAnimNode_RBRotateRelative                          AnimGraphNode_RBRotateRelative;                          // 0xD8A8(0x00F8)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_2;                           // 0xD9A0(0x0028)
		struct FAnimNode_CopyPoseFromMesh                          AnimGraphNode_CopyPoseFromMesh_2;                        // 0xD9C8(0x01D8) ContainsInstancedReference
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend;                          // 0xDBA0(0x00C0)
		struct FAnimNode_LegIK                                     AnimGraphNode_LegIK_2;                                   // 0xDC60(0x00F8)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace;                     // 0xDD58(0x0020)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool;                           // 0xDD78(0x00A8)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose;                             // 0xDE20(0x0028)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace;                     // 0xDE48(0x0020)
		struct FAnimNode_LegIK                                     AnimGraphNode_LegIK;                                     // 0xDE68(0x00F8)
		struct FAnimNode_CopyPoseFromMesh                          AnimGraphNode_CopyPoseFromMesh;                          // 0xDF60(0x01D8) ContainsInstancedReference
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_2;                              // 0xE138(0x0108)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone;                                // 0xE240(0x0108)
		bool                                                       IsAFK;                                                   // 0xE348(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_2S3V[0x7];                                   // 0xE349(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTimerHandle                                        IdleTimer;                                               // 0xE350(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash
		bool                                                       IsShopping;                                              // 0xE358(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_XJ76[0x3];                                   // 0xE359(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    AFKStyle;                                                // 0xE35C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DelayedPeek;                                             // 0xE360(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LookBlend;                                               // 0xE364(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TMap<EItemType, class UAnimSequenceBase*>                  ItemTypeStyle;                                           // 0xE368(0x0050) Edit, BlueprintVisible, DisableEditOnInstance
		float                                                      PickUpBlend;                                             // 0xE3B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_50Q4[0x4];                                   // 0xE3BC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequenceBase*                                   PickUpHand;                                              // 0xE3C0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    IdleStyle;                                               // 0xE3C8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash

	public:
		void AnimGraph(struct FPoseLink* AnimGraph);
		void ToggleAFK();
		bool ShouldIgnoreLookAround();
		void AnimNotify_IsGone();
		void AnimNotify_IsIdle();
		void AnimNotify_IsBack();
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void AnimNotify_Dead();
		void AnimNotify_Alive();
		void AnimNotify_IdleBreaker();
		void AnimNotify_StartPush_Left();
		void AnimNotify_StopPush_Left();
		void ExecuteUbergraph_player_3P_AnimBP(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
