#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass player_1P_AnimBP.player_1P_AnimBP_C
	 * Size -> 0xD860 (FullSize[0xE96C] - InheritedSize[0x110C])
	 */
	class Uplayer_1P_AnimBP_C : public URBAnimInstancePlayer
	{
	public:
		unsigned char                                              UnknownData_Z7U9[0x4];                                   // 0x110C(0x0004) Fix Super Size
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x1110(0x0008) ZeroConstructor, Transient, DuplicateTransient
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_31;                        // 0x1118(0x00A8)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_5;                                    // 0x11C0(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_9;                          // 0x1208(0x0158)
		struct FAnimNode_LegIK                                     AnimGraphNode_LegIK_2;                                   // 0x1360(0x00F8)
		struct FAnimNode_LegIK                                     AnimGraphNode_LegIK;                                     // 0x1458(0x00F8)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_5;                              // 0x1550(0x0108)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_8;                   // 0x1658(0x0020)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_98;                         // 0x1678(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_8;                          // 0x16F8(0x0158)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_157;                      // 0x1850(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_156;                      // 0x1878(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_155;                      // 0x18A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_154;                      // 0x18C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_153;                      // 0x18F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_152;                      // 0x1918(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_151;                      // 0x1940(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_150;                      // 0x1968(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_149;                      // 0x1990(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_97;                         // 0x19B8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_94;                            // 0x1A38(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_148;                      // 0x1A68(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_147;                      // 0x1A90(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_146;                      // 0x1AB8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_145;                      // 0x1AE0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_144;                      // 0x1B08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_143;                      // 0x1B30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_142;                      // 0x1B58(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_96;                         // 0x1B80(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_95;                         // 0x1C00(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_30;                        // 0x1C80(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_29;                        // 0x1D28(0x00A8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_8;                             // 0x1DD0(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_94;                         // 0x1E98(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_93;                         // 0x1F18(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_93;                            // 0x1F98(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_22;                          // 0x1FC8(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_92;                            // 0x1FF0(0x0030)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_7;                             // 0x2020(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_92;                         // 0x20E8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_91;                         // 0x2168(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_91;                            // 0x21E8(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_141;                      // 0x2218(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_140;                      // 0x2240(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_139;                      // 0x2268(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_138;                      // 0x2290(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_137;                      // 0x22B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_136;                      // 0x22E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_135;                      // 0x2308(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_134;                      // 0x2330(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_133;                      // 0x2358(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_132;                      // 0x2380(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_131;                      // 0x23A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_130;                      // 0x23D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_129;                      // 0x23F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_128;                      // 0x2420(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_127;                      // 0x2448(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_126;                      // 0x2470(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_125;                      // 0x2498(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_124;                      // 0x24C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_123;                      // 0x24E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_122;                      // 0x2510(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_121;                      // 0x2538(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_90;                         // 0x2560(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_90;                            // 0x25E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_89;                         // 0x2610(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_9;                           // 0x2690(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_88;                         // 0x2758(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_89;                            // 0x27D8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_87;                         // 0x2808(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_88;                            // 0x2888(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_86;                         // 0x28B8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_85;                         // 0x2938(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_28;                        // 0x29B8(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_87;                            // 0x2A60(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_84;                         // 0x2A90(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_86;                            // 0x2B10(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_83;                         // 0x2B40(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_85;                            // 0x2BC0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_82;                         // 0x2BF0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_84;                            // 0x2C70(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_81;                         // 0x2CA0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_83;                            // 0x2D20(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_80;                         // 0x2D50(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_82;                            // 0x2DD0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_79;                         // 0x2E00(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_81;                            // 0x2E80(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_78;                         // 0x2EB0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_80;                            // 0x2F30(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_77;                         // 0x2F60(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_79;                            // 0x2FE0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_76;                         // 0x3010(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_27;                        // 0x3090(0x00A8)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_11;                       // 0x3138(0x00C0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_75;                         // 0x31F8(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_21;                          // 0x3278(0x0028)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_26;                        // 0x32A0(0x00A8)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_10;                       // 0x3348(0x00C0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_74;                         // 0x3408(0x0080)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_6;                             // 0x3488(0x00C8)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_20;                          // 0x3550(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_73;                         // 0x3578(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_78;                            // 0x35F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_72;                         // 0x3628(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_77;                            // 0x36A8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_16;                           // 0x36D8(0x00B0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_120;                      // 0x3788(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_119;                      // 0x37B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_118;                      // 0x37D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_117;                      // 0x3800(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_116;                      // 0x3828(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_115;                      // 0x3850(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_114;                      // 0x3878(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_113;                      // 0x38A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_112;                      // 0x38C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_111;                      // 0x38F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_110;                      // 0x3918(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_109;                      // 0x3940(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_108;                      // 0x3968(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_107;                      // 0x3990(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_106;                      // 0x39B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_105;                      // 0x39E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_104;                      // 0x3A08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_103;                      // 0x3A30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_102;                      // 0x3A58(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_101;                      // 0x3A80(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_100;                      // 0x3AA8(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_71;                         // 0x3AD0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_76;                            // 0x3B50(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_70;                         // 0x3B80(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_8;                           // 0x3C00(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_69;                         // 0x3CC8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_75;                            // 0x3D48(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_68;                         // 0x3D78(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_74;                            // 0x3DF8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_67;                         // 0x3E28(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_66;                         // 0x3EA8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_25;                        // 0x3F28(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_73;                            // 0x3FD0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_65;                         // 0x4000(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_72;                            // 0x4080(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_64;                         // 0x40B0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_71;                            // 0x4130(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_63;                         // 0x4160(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_70;                            // 0x41E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_62;                         // 0x4210(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_69;                            // 0x4290(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_61;                         // 0x42C0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_68;                            // 0x4340(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_60;                         // 0x4370(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_67;                            // 0x43F0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_59;                         // 0x4420(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_66;                            // 0x44A0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_58;                         // 0x44D0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_65;                            // 0x4550(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_57;                         // 0x4580(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_7;                           // 0x4600(0x00C8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_5;                             // 0x46C8(0x00C8)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_9;                        // 0x4790(0x00C0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_56;                         // 0x4850(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_19;                          // 0x48D0(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_55;                         // 0x48F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_64;                            // 0x4978(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_54;                         // 0x49A8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_63;                            // 0x4A28(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_15;                           // 0x4A58(0x00B0)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_4;                             // 0x4B08(0x00C8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_62;                            // 0x4BD0(0x0030)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_3;                             // 0x4C00(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_53;                         // 0x4CC8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_52;                         // 0x4D48(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_61;                            // 0x4DC8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_14;                           // 0x4DF8(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_60;                            // 0x4EA8(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_24;                        // 0x4ED8(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_51;                         // 0x4F80(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_50;                         // 0x5000(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_6;                           // 0x5080(0x00C8)
		struct FAnimNode_MakeDynamicAdditive                       AnimGraphNode_MakeDynamicAdditive_3;                     // 0x5148(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_49;                         // 0x5180(0x0080)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_31;                       // 0x5200(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_59;                            // 0x52E8(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_30;                       // 0x5318(0x00E8)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_5;                           // 0x5400(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_48;                         // 0x54C8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_58;                            // 0x5548(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_18;                          // 0x5578(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_57;                            // 0x55A0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_13;                           // 0x55D0(0x00B0)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_7;                          // 0x5680(0x0158)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_5;                   // 0x57D8(0x0020)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_6;                          // 0x57F8(0x0158)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_17;                          // 0x5950(0x0028)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_7;                   // 0x5978(0x0020)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_8;                        // 0x5998(0x00C0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_16;                          // 0x5A58(0x0028)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_4;                   // 0x5A80(0x0020)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_15;                          // 0x5AA0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_99;                       // 0x5AC8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_98;                       // 0x5AF0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_97;                       // 0x5B18(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_96;                       // 0x5B40(0x0028)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_11;                      // 0x5B68(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_56;                            // 0x5BB8(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_14;                          // 0x5BE8(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_55;                            // 0x5C10(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_13;                          // 0x5C40(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_54;                            // 0x5C68(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_12;                           // 0x5C98(0x00B0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_95;                       // 0x5D48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_94;                       // 0x5D70(0x0028)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_12;                          // 0x5D98(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_53;                            // 0x5DC0(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_11;                          // 0x5DF0(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_52;                            // 0x5E18(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_11;                           // 0x5E48(0x00B0)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_5;                          // 0x5EF8(0x0158)
		struct FAnimNode_RBRelativeToCamera                        AnimGraphNode_RBRelativeToCamera_3;                      // 0x6050(0x0170)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_7;                        // 0x61C0(0x00C0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_10;                          // 0x6280(0x0028)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_9;                           // 0x62A8(0x0028)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_8;                           // 0x62D0(0x0028)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_6;                   // 0x62F8(0x0020)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_7;                           // 0x6318(0x0028)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_5;                   // 0x6340(0x0020)
		struct FAnimNode_RBRelativeToCamera                        AnimGraphNode_RBRelativeToCamera_2;                      // 0x6360(0x0170)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_6;                           // 0x64D0(0x0028)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_4;                   // 0x64F8(0x0020)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_3;                   // 0x6518(0x0020)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_5;                           // 0x6538(0x0028)
		struct FAnimNode_RBRelativeToCamera                        AnimGraphNode_RBRelativeToCamera;                        // 0x6560(0x0170)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_3;                   // 0x66D0(0x0020)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_47;                         // 0x66F0(0x0080)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_4;                                    // 0x6770(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_6;                        // 0x67B8(0x00C0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_46;                         // 0x6878(0x0080)
		struct FAnimNode_CopyPoseFromMesh                          AnimGraphNode_CopyPoseFromMesh;                          // 0x68F8(0x01D8) ContainsInstancedReference
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_23;                        // 0x6AD0(0x00A8)
		struct FAnimNode_LinkedAnimGraph                           AnimGraphNode_LinkedAnimGraph;                           // 0x6B78(0x00A0)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_4;                          // 0x6C18(0x0158)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_4;                           // 0x6D70(0x0028)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_3;                                    // 0x6D98(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_2;                                    // 0x6DE0(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_22;                        // 0x6E28(0x00A8)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_93;                       // 0x6ED0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_92;                       // 0x6EF8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_91;                       // 0x6F20(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_90;                       // 0x6F48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_89;                       // 0x6F70(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_88;                       // 0x6F98(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_87;                       // 0x6FC0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_86;                       // 0x6FE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_85;                       // 0x7010(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_84;                       // 0x7038(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_83;                       // 0x7060(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_82;                       // 0x7088(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_81;                       // 0x70B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_80;                       // 0x70D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_79;                       // 0x7100(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_78;                       // 0x7128(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_77;                       // 0x7150(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_76;                       // 0x7178(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_75;                       // 0x71A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_74;                       // 0x71C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_73;                       // 0x71F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_72;                       // 0x7218(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_71;                       // 0x7240(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_70;                       // 0x7268(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_69;                       // 0x7290(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_68;                       // 0x72B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_67;                       // 0x72E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_66;                       // 0x7308(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_65;                       // 0x7330(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_64;                       // 0x7358(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_63;                       // 0x7380(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_62;                       // 0x73A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_61;                       // 0x73D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_60;                       // 0x73F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_59;                       // 0x7420(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_58;                       // 0x7448(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_57;                       // 0x7470(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_56;                       // 0x7498(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_55;                       // 0x74C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_54;                       // 0x74E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_53;                       // 0x7510(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_45;                         // 0x7538(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_51;                            // 0x75B8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_44;                         // 0x75E8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_50;                            // 0x7668(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_43;                         // 0x7698(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_49;                            // 0x7718(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_42;                         // 0x7748(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_48;                            // 0x77C8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_41;                         // 0x77F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_47;                            // 0x7878(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_40;                         // 0x78A8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_46;                            // 0x7928(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_39;                         // 0x7958(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_45;                            // 0x79D8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_38;                         // 0x7A08(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_44;                            // 0x7A88(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_37;                         // 0x7AB8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_36;                         // 0x7B38(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_21;                        // 0x7BB8(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_43;                            // 0x7C60(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_29;                       // 0x7C90(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_42;                            // 0x7D78(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_3;                           // 0x7DA8(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_41;                            // 0x7DD0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_35;                         // 0x7E00(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_40;                            // 0x7E80(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_28;                       // 0x7EB0(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_39;                            // 0x7F98(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_10;                           // 0x7FC8(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_38;                            // 0x8078(0x0030)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_4;                              // 0x80A8(0x0108)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_2;                   // 0x81B0(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_2;                   // 0x81D0(0x0020)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_3;                              // 0x81F0(0x0108)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_34;                         // 0x82F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_37;                            // 0x8378(0x0030)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_2;                              // 0x83A8(0x0108)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace;                     // 0x84B0(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace;                     // 0x84D0(0x0020)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone;                                // 0x84F0(0x0108)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_20;                        // 0x85F8(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_27;                       // 0x86A0(0x00E8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_33;                         // 0x8788(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_36;                            // 0x8808(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_19;                        // 0x8838(0x00A8)
		struct FAnimNode_BlendSpaceEvaluator                       AnimGraphNode_BlendSpaceEvaluator;                       // 0x88E0(0x00F0)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_10;                      // 0x89D0(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_35;                            // 0x8A20(0x0030)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_9;                       // 0x8A50(0x0050)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_4;                           // 0x8AA0(0x00C8)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_52;                       // 0x8B68(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_51;                       // 0x8B90(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_32;                         // 0x8BB8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_34;                            // 0x8C38(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_31;                         // 0x8C68(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_33;                            // 0x8CE8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_9;                            // 0x8D18(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_32;                            // 0x8DC8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_30;                         // 0x8DF8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_31;                            // 0x8E78(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_26;                       // 0x8EA8(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_30;                            // 0x8F90(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_50;                       // 0x8FC0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_49;                       // 0x8FE8(0x0028)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_8;                       // 0x9010(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_29;                            // 0x9060(0x0030)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_7;                       // 0x9090(0x0050)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_28;                            // 0x90E0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_8;                            // 0x9110(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_27;                            // 0x91C0(0x0030)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_2;                           // 0x91F0(0x0028)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_26;                            // 0x9218(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_7;                            // 0x9248(0x00B0)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_3;                          // 0x92F8(0x0158)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_2;                          // 0x9450(0x0158)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_5;                        // 0x95A8(0x00C0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose;                             // 0x9668(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_48;                       // 0x9690(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_47;                       // 0x96B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_46;                       // 0x96E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_45;                       // 0x9708(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_44;                       // 0x9730(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_43;                       // 0x9758(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_42;                       // 0x9780(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_41;                       // 0x97A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_40;                       // 0x97D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_39;                       // 0x97F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_38;                       // 0x9820(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_37;                       // 0x9848(0x0028)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_25;                       // 0x9870(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_24;                       // 0x9958(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_23;                       // 0x9A40(0x00E8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_29;                         // 0x9B28(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_5;                         // 0x9BA8(0x00B8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_25;                            // 0x9C60(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_28;                         // 0x9C90(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_27;                         // 0x9D10(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_26;                         // 0x9D90(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_25;                         // 0x9E10(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_4;                         // 0x9E90(0x00B8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_22;                       // 0x9F48(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_21;                       // 0xA030(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_20;                       // 0xA118(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_19;                       // 0xA200(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_3;                         // 0xA2E8(0x00B8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_2;                         // 0xA3A0(0x00B8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum;                           // 0xA458(0x00B8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_24;                         // 0xA510(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_24;                            // 0xA590(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_18;                       // 0xA5C0(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_17;                       // 0xA6A8(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_18;                        // 0xA790(0x00A8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_23;                            // 0xA838(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_36;                       // 0xA868(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_35;                       // 0xA890(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_34;                       // 0xA8B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_33;                       // 0xA8E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_32;                       // 0xA908(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_31;                       // 0xA930(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_30;                       // 0xA958(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_29;                       // 0xA980(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_28;                       // 0xA9A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_27;                       // 0xA9D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_26;                       // 0xA9F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_25;                       // 0xAA20(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_24;                       // 0xAA48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_23;                       // 0xAA70(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_22;                       // 0xAA98(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_21;                       // 0xAAC0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_20;                       // 0xAAE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_19;                       // 0xAB10(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_18;                       // 0xAB38(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_17;                       // 0xAB60(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_16;                       // 0xAB88(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_15;                       // 0xABB0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14;                       // 0xABD8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_13;                       // 0xAC00(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_12;                       // 0xAC28(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11;                       // 0xAC50(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_10;                       // 0xAC78(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_23;                         // 0xACA0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_22;                            // 0xAD20(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9;                        // 0xAD50(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_22;                         // 0xAD78(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_21;                            // 0xADF8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_21;                         // 0xAE28(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_20;                            // 0xAEA8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_20;                         // 0xAED8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_19;                            // 0xAF58(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_19;                         // 0xAF88(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_18;                            // 0xB008(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_18;                         // 0xB038(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_17;                            // 0xB0B8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_17;                         // 0xB0E8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_17;                        // 0xB168(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_16;                         // 0xB210(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_16;                            // 0xB290(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8;                        // 0xB2C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7;                        // 0xB2E8(0x0028)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_16;                       // 0xB310(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_16;                        // 0xB3F8(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_15;                       // 0xB4A0(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_15;                            // 0xB588(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_15;                         // 0xB5B8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_15;                        // 0xB638(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_14;                         // 0xB6E0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_14;                            // 0xB760(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_6;                            // 0xB790(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_13;                            // 0xB840(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_13;                         // 0xB870(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_14;                        // 0xB8F0(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_12;                         // 0xB998(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_12;                            // 0xBA18(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_13;                        // 0xBA48(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_11;                         // 0xBAF0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10;                         // 0xBB70(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_12;                        // 0xBBF0(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_14;                       // 0xBC98(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_11;                            // 0xBD80(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9;                          // 0xBDB0(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_11;                        // 0xBE30(0x00A8)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_4;                        // 0xBED8(0x00C0)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_13;                       // 0xBF98(0x00E8)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6;                        // 0xC080(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5;                        // 0xC0A8(0x0028)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_12;                       // 0xC0D0(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_11;                       // 0xC1B8(0x00E8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend_2;                             // 0xC2A0(0x00C8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_10;                            // 0xC368(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8;                          // 0xC398(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7;                          // 0xC418(0x0080)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_6;                       // 0xC498(0x0050)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_5;                       // 0xC4E8(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_10;                        // 0xC538(0x00A8)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_3;                           // 0xC5E0(0x00C8)
		struct FAnimNode_MakeDynamicAdditive                       AnimGraphNode_MakeDynamicAdditive_2;                     // 0xC6A8(0x0038)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_9;                             // 0xC6E0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_5;                            // 0xC710(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_8;                             // 0xC7C0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6;                          // 0xC7F0(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_9;                         // 0xC870(0x00A8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5;                          // 0xC918(0x0080)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_3;                        // 0xC998(0x00C0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_8;                         // 0xCA58(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_10;                       // 0xCB00(0x00E8)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4;                        // 0xCBE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3;                        // 0xCC10(0x0028)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_2;                        // 0xCC38(0x00C0)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_4;                       // 0xCCF8(0x0050)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_3;                       // 0xCD48(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_7;                         // 0xCD98(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_6;                         // 0xCE40(0x00A8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend;                               // 0xCEE8(0x00C8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_9;                        // 0xCFB0(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_5;                         // 0xD098(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_8;                        // 0xD140(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_7;                        // 0xD228(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_6;                        // 0xD310(0x00E8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_4;                         // 0xD3F8(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_3;                         // 0xD4A0(0x00A8)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_2;                         // 0xD548(0x00A8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_5;                        // 0xD5F0(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_4;                        // 0xD6D8(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_3;                        // 0xD7C0(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_7;                             // 0xD8A8(0x0030)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator_2;                       // 0xD8D8(0x0050)
		struct FAnimNode_SequenceEvaluator                         AnimGraphNode_SequenceEvaluator;                         // 0xD928(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool;                           // 0xD978(0x00A8)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_2;                           // 0xDA20(0x00C8)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4;                          // 0xDAE8(0x0080)
		struct FAnimNode_MakeDynamicAdditive                       AnimGraphNode_MakeDynamicAdditive;                       // 0xDB68(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3;                          // 0xDBA0(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive;                             // 0xDC20(0x00C8)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2;                        // 0xDCE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult;                          // 0xDD10(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2;                          // 0xDD38(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_6;                             // 0xDDB8(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_2;                        // 0xDDE8(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_5;                             // 0xDED0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_4;                            // 0xDF00(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_4;                             // 0xDFB0(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_3;                            // 0xDFE0(0x00B0)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend;                          // 0xE090(0x00C0)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer;                          // 0xE150(0x00E8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_3;                             // 0xE238(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_2;                            // 0xE268(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_2;                             // 0xE318(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer;                            // 0xE348(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult;                               // 0xE3C8(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine;                              // 0xE3F8(0x00B0)
		struct FAnimNode_Root                                      AnimGraphNode_Root;                                      // 0xE4A8(0x0030)
		struct FAnimNode_RBRotateRelative                          AnimGraphNode_RBRotateRelative;                          // 0xE4D8(0x00F8)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot;                                      // 0xE5D0(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose;                            // 0xE618(0x0158)
		struct FAnimNode_RotationOffsetBlendSpace                  AnimGraphNode_RotationOffsetBlendSpace;                  // 0xE770(0x0190)
		float                                                      DelayedPeek;                                             // 0xE900(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_U347[0x4];                                   // 0xE904(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequenceBase*                                   PickUpHand;                                              // 0xE908(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      PickUpBlend;                                             // 0xE910(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_VB5Y[0x4];                                   // 0xE914(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<EItemType, class UAnimSequenceBase*>                  ItemTypeStyle;                                           // 0xE918(0x0050) Edit, BlueprintVisible, DisableEditOnInstance
		float                                                      SpeedNormal;                                             // 0xE968(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash

	public:
		void AnimGraph(struct FPoseLink* AnimGraph);
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void AnimNotify_StartPush_Left();
		void AnimNotify_StopPush_Left();
		void ExecuteUbergraph_player_1P_AnimBP(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
