#pragma once

/**
 * Name: OUTLAST
 * Version: 0.0.2_fixed
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_PushCart_ObjCoord_BP3_2_K2Node_ActorBoundEvent_0_OnObjectiveCoordinatorStarted__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_PushCart_ObjCoord_BP3_2_K2Node_ActorBoundEvent_0_OnObjectiveCoordinatorStarted__DelegateSignature_Params
	{	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_PS_T02_B04_ObjCoord_PushCart_Snitch_K2Node_ActorBoundEvent_2_OnObjectiveCoordinatorCompleted__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_PS_T02_B04_ObjCoord_PushCart_Snitch_K2Node_ActorBoundEvent_2_OnObjectiveCoordinatorCompleted__DelegateSignature_Params
	{
	public:
		bool                                                       bIsJIP;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_FirstGate_K2Node_ActorBoundEvent_6_OnGameplayTriggerEvent__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_FirstGate_K2Node_ActorBoundEvent_6_OnGameplayTriggerEvent__DelegateSignature_Params
	{
	public:
		class URBGameplayTriggerComponent*                         Trigger;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_SecondGate_K2Node_ActorBoundEvent_7_OnGameplayTriggerEvent__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_SecondGate_K2Node_ActorBoundEvent_7_OnGameplayTriggerEvent__DelegateSignature_Params
	{
	public:
		class URBGameplayTriggerComponent*                         Trigger;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_ThirdGate_K2Node_ActorBoundEvent_8_OnGameplayTriggerEvent__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_ThirdGate_K2Node_ActorBoundEvent_8_OnGameplayTriggerEvent__DelegateSignature_Params
	{
	public:
		class URBGameplayTriggerComponent*                         Trigger;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.PST02B04_CloseRailTV
	 */
	struct APoliceStation_T02_B04_C_PST02B04_CloseRailTV_Params
	{	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.Cheat_SpawnEndCoyle
	 */
	struct APoliceStation_T02_B04_C_Cheat_SpawnEndCoyle_Params
	{	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_CoyleTrigger_K2Node_ActorBoundEvent_3_OnGameplayTriggerEvent__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_CoyleTrigger_K2Node_ActorBoundEvent_3_OnGameplayTriggerEvent__DelegateSignature_Params
	{
	public:
		class URBGameplayTriggerComponent*                         Trigger;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.B04_ActivateRollingDoorVariators
	 */
	struct APoliceStation_T02_B04_C_B04_ActivateRollingDoorVariators_Params
	{	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.OnFirstGateTriggered
	 */
	struct APoliceStation_T02_B04_C_OnFirstGateTriggered_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_8HEO[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class ARBTriggerable*                                      triggerable;                                             // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_FirstGate_K2Node_ActorBoundEvent_1_OnGameplayTriggerEvent__DelegateSignature
	 */
	struct APoliceStation_T02_B04_C_BndEvt__PoliceStation_T02_B04_RBGameplayTriggerVolume_FirstGate_K2Node_ActorBoundEvent_1_OnGameplayTriggerEvent__DelegateSignature_Params
	{
	public:
		class URBGameplayTriggerComponent*                         Trigger;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PoliceStation_T02_B04.PoliceStation_T02_B04_C.ExecuteUbergraph_PoliceStation_T02_B04
	 */
	struct APoliceStation_T02_B04_C_ExecuteUbergraph_PoliceStation_T02_B04_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
