#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.SetHovered
	 */
	struct URBCharacterSheetTabMenuButton_C_SetHovered_Params
	{
	public:
		bool                                                       bInHovered;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.SetHasNewItems
	 */
	struct URBCharacterSheetTabMenuButton_C_SetHasNewItems_Params
	{
	public:
		bool                                                       hasNewItems;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.SetText
	 */
	struct URBCharacterSheetTabMenuButton_C_SetText_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.Disable
	 */
	struct URBCharacterSheetTabMenuButton_C_Disable_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.Refresh
	 */
	struct URBCharacterSheetTabMenuButton_C_Refresh_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.BndEvt__MainButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct URBCharacterSheetTabMenuButton_C_BndEvt__MainButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.PreConstruct
	 */
	struct URBCharacterSheetTabMenuButton_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.Event_OnSelectedChanged
	 */
	struct URBCharacterSheetTabMenuButton_C_Event_OnSelectedChanged_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.BndEvt__RBCharacterSheetTabMenuButton_MainButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct URBCharacterSheetTabMenuButton_C_BndEvt__RBCharacterSheetTabMenuButton_MainButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.BndEvt__RBCharacterSheetTabMenuButton_MainButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	 */
	struct URBCharacterSheetTabMenuButton_C_BndEvt__RBCharacterSheetTabMenuButton_MainButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.Construct
	 */
	struct URBCharacterSheetTabMenuButton_C_Construct_Params
	{	};

	/**
	 * Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.ExecuteUbergraph_RBCharacterSheetTabMenuButton
	 */
	struct URBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
