#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ReadyOrNot.ActivityState.CreateTransition
	 */
	struct UActivityState_CreateTransition_Params
	{
	public:
		struct FActivityStateTransition                            InStateTransition;                                       // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
		class UActivityState*                                      ReturnValue;                                             // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityState.BindEventTick
	 */
	struct UActivityState_BindEventTick_Params
	{
	public:
		class FScriptDelegate                                      Delegate;                                                // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class UActivityState*                                      ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityState.BindEventExit
	 */
	struct UActivityState_BindEventExit_Params
	{
	public:
		class FScriptDelegate                                      Delegate;                                                // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class UActivityState*                                      ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityState.BindEventEnter
	 */
	struct UActivityState_BindEventEnter_Params
	{
	public:
		class FScriptDelegate                                      Delegate;                                                // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class UActivityState*                                      ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction ReadyOrNot.ActivityState.ActivityStateUpdate__DelegateSignature
	 */
	struct UActivityState_ActivityStateUpdate__DelegateSignature_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Uptime;                                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction ReadyOrNot.ActivityState.ActivityStateEvent__DelegateSignature
	 */
	struct UActivityState_ActivityStateEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ReadyOrNot.ActivityFiniteStateMachine.IsMachineInitialized
	 */
	struct UActivityFiniteStateMachine_IsMachineInitialized_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityFiniteStateMachine.GetStateByName
	 */
	struct UActivityFiniteStateMachine_GetStateByName_Params
	{
	public:
		class FString                                              InStateName;                                             // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UActivityState*                                      ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityFiniteStateMachine.GetStateByID
	 */
	struct UActivityFiniteStateMachine_GetStateByID_Params
	{
	public:
		int32_t                                                    InStateID;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WSUT[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UActivityState*                                      ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityFiniteStateMachine.GetActiveState
	 */
	struct UActivityFiniteStateMachine_GetActiveState_Params
	{
	public:
		class UActivityState*                                      ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityFiniteStateMachine.AddState
	 */
	struct UActivityFiniteStateMachine_AddState_Params
	{
	public:
		class FString                                              NewStateName;                                            // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FActivityStateTransition>                    Transitions;                                             // 0x0010(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		class UActivityState*                                      ReturnValue;                                             // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.SetStartDelay
	 */
	struct UActivityManager_SetStartDelay_Params
	{
	public:
		float                                                      NewDelayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.GiveActivityTo
	 */
	struct UActivityManager_GiveActivityTo_Params
	{
	public:
		class UBaseActivity*                                       InActivity;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ACyberneticCharacter*                                InCharacter;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bOverrideCurrentActivity;                                // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bClearActivityList;                                      // 0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0012(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.GiveActivitiesTo
	 */
	struct UActivityManager_GiveActivitiesTo_Params
	{
	public:
		TArray<class UBaseActivity*>                               InActivities;                                            // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class ACyberneticCharacter*                                InCharacter;                                             // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bOverrideCurrentActivity;                                // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bClearActivityList;                                      // 0x0019(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x001A(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.GetStartDelay
	 */
	struct UActivityManager_GetStartDelay_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.Get
	 */
	struct UActivityManager_Get_Params
	{
	public:
		class UActivityManager*                                    ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.CreateActivity
	 */
	struct UActivityManager_CreateActivity_Params
	{
	public:
		class UObject*                                             ContextObject;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              InActivityClass;                                         // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              InActivityName;                                          // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InActivityStartDelay;                                    // 0x0020(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_N3NK[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UBaseActivity*                                       ReturnValue;                                             // 0x0028(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ActivityManager.CanGiveActivityTo
	 */
	struct UActivityManager_CanGiveActivityTo_Params
	{
	public:
		class UBaseActivity*                                       InActivity;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ACyberneticCharacter*                                InCharacter;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AdminGameControls.KickPlayer
	 */
	struct UAdminGameControls_KickPlayer_Params
	{
	public:
		class APlayerState*                                        KickingPlayerState;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FText                                                reason;                                                  // 0x0008(0x0018)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AdminGameControls.IsAdmin
	 */
	struct UAdminGameControls_IsAdmin_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AdminGameControls.GetKickablePlayers
	 */
	struct UAdminGameControls_GetKickablePlayers_Params
	{
	public:
		TArray<class APlayerState*>                                KickablePlayers;                                         // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.WantsAbort
	 */
	struct UAIAction_WantsAbort_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.Tick_Blueprint
	 */
	struct UAIAction_Tick_Blueprint_Params
	{
	public:
		float                                                      DeltaTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.ShouldPerformAction
	 */
	struct UAIAction_ShouldPerformAction_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.RequestMove
	 */
	struct UAIAction_RequestMove_Params
	{
	public:
		struct FCoreUObject_FVector                                Location;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.OnSucceededToConsider_Blueprint
	 */
	struct UAIAction_OnSucceededToConsider_Blueprint_Params
	{	};

	/**
	 * Function ReadyOrNot.AIAction.OnPathFound_Blueprint
	 */
	struct UAIAction_OnPathFound_Blueprint_Params
	{
	public:
		int32_t                                                    PathId;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ERonNavigationQueryResult                                  Result;                                                  // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.OnPathFound
	 */
	struct UAIAction_OnPathFound_Params
	{
	public:
		int32_t                                                    PathId;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		ERonNavigationQueryResult                                  Result;                                                  // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.OnMoveComplete_Blueprint
	 */
	struct UAIAction_OnMoveComplete_Blueprint_Params
	{
	public:
		class AAIController*                                       Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    RequestID;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.OnMoveComplete
	 */
	struct UAIAction_OnMoveComplete_Params
	{
	public:
		class AAIController*                                       Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    RequestID;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.OnFailedToConsider_Blueprint
	 */
	struct UAIAction_OnFailedToConsider_Blueprint_Params
	{	};

	/**
	 * Function ReadyOrNot.AIAction.OnCreate_Blueprint
	 */
	struct UAIAction_OnCreate_Blueprint_Params
	{
	public:
		class ACyberneticController*                               Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.InitAction_Blueprint
	 */
	struct UAIAction_InitAction_Blueprint_Params
	{
	public:
		class ACyberneticController*                               Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.GetCharacter
	 */
	struct UAIAction_GetCharacter_Params
	{
	public:
		class ACyberneticCharacter*                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.GetActionRunCount
	 */
	struct UAIAction_GetActionRunCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.GetActionData
	 */
	struct UAIAction_GetActionData_Params
	{
	public:
		struct FAIActionData                                       ReturnValue;                                             // 0x0000(0x02C8)  (Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIAction.EndAction_Blueprint
	 */
	struct UAIAction_EndAction_Blueprint_Params
	{	};

	/**
	 * Function ReadyOrNot.AIAction.BeginAction_Blueprint
	 */
	struct UAIAction_BeginAction_Blueprint_Params
	{	};

	/**
	 * Function ReadyOrNot.AIAction.AbortAction
	 */
	struct UAIAction_AbortAction_Params
	{	};

	/**
	 * Function ReadyOrNot.AIActionConsideration.Score
	 */
	struct UAIActionConsideration_Score_Params
	{
	public:
		struct FAIActionDecisionContext                            Context;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bSuccess;                                                // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MRHF[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ReturnValue;                                             // 0x0014(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIActionConsideration.EvaluateResponseCurve
	 */
	struct UAIActionConsideration_EvaluateResponseCurve_Params
	{
	public:
		float                                                      Score;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIActionConsideration.CalculateCurve
	 */
	struct UAIActionConsideration_CalculateCurve_Params
	{
	public:
		float                                                      X;                                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIActionGate.CanOpen
	 */
	struct UAIActionGate_CanOpen_Params
	{
	public:
		struct FAIActionDecisionContext                            Context;                                                 // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIArchetypeData.AssignActionPreset
	 */
	struct UAIArchetypeData_AssignActionPreset_Params
	{	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAllAISpawned_Blueprint
	 */
	struct AAIFactionManager_OnAllAISpawned_Blueprint_Params
	{	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAISpottedNeutral_Blueprint
	 */
	struct AAIFactionManager_OnAISpottedNeutral_Blueprint_Params
	{
	public:
		class ACyberneticCharacter*                                Spotter;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Neutral;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAISpottedNeutral
	 */
	struct AAIFactionManager_OnAISpottedNeutral_Params
	{
	public:
		class ACyberneticCharacter*                                Spotter;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Neutral;                                                 // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAISpottedFriendly_Blueprint
	 */
	struct AAIFactionManager_OnAISpottedFriendly_Blueprint_Params
	{
	public:
		class ACyberneticCharacter*                                Spotter;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Friendly;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAISpottedFriendly
	 */
	struct AAIFactionManager_OnAISpottedFriendly_Params
	{
	public:
		class ACyberneticCharacter*                                Spotter;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Friendly;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAISpottedEnemy_Blueprint
	 */
	struct AAIFactionManager_OnAISpottedEnemy_Blueprint_Params
	{
	public:
		class ACyberneticCharacter*                                Spotter;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Enemy;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAISpottedEnemy
	 */
	struct AAIFactionManager_OnAISpottedEnemy_Params
	{
	public:
		class ACyberneticCharacter*                                Spotter;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Enemy;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.OnAIAdded_Blueprint
	 */
	struct AAIFactionManager_OnAIAdded_Blueprint_Params
	{
	public:
		class ACyberneticCharacter*                                Character;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.IsTeamFull
	 */
	struct AAIFactionManager_IsTeamFull_Params
	{
	public:
		struct FFactionSuspectTeam                                 InTeam;                                                  // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.IsSuspectInTeam
	 */
	struct AAIFactionManager_IsSuspectInTeam_Params
	{
	public:
		class ASuspectCharacter*                                   InSuspect;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FFactionSuspectTeam                                 OutTeam;                                                 // 0x0008(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0028(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetTeamTacticFor
	 */
	struct AAIFactionManager_GetTeamTacticFor_Params
	{
	public:
		class ASuspectCharacter*                                   InSuspect;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EAITeamTactic                                              OutTactic;                                               // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetTeamIndex
	 */
	struct AAIFactionManager_GetTeamIndex_Params
	{
	public:
		class ASuspectCharacter*                                   InSuspect;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetSuspectsInTeam
	 */
	struct AAIFactionManager_GetSuspectsInTeam_Params
	{
	public:
		class ASuspectCharacter*                                   InSuspect;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class ASuspectCharacter*>                           OutSuspects;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       bIncludeSelf;                                            // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0019(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetAllSuspects
	 */
	struct AAIFactionManager_GetAllSuspects_Params
	{
	public:
		TArray<class ASuspectCharacter*>                           ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetAllLeaders
	 */
	struct AAIFactionManager_GetAllLeaders_Params
	{
	public:
		TArray<class ACyberneticCharacter*>                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetAllCivilians
	 */
	struct AAIFactionManager_GetAllCivilians_Params
	{
	public:
		TArray<class ACivilianCharacter*>                          ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.GetAllCharacters
	 */
	struct AAIFactionManager_GetAllCharacters_Params
	{
	public:
		TArray<class ACyberneticCharacter*>                        ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.FindClosestSuspect
	 */
	struct AAIFactionManager_FindClosestSuspect_Params
	{
	public:
		TArray<class ASuspectCharacter*>                           OtherSuspects;                                           // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class ASuspectCharacter*                                   Suspect;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      MaxDistance;                                             // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_EOSR[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class ASuspectCharacter*                                   ReturnValue;                                             // 0x0020(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.AreTeamSpotsAvailable
	 */
	struct AAIFactionManager_AreTeamSpotsAvailable_Params
	{
	public:
		int32_t                                                    OutIndex;                                                // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AIFactionManager.AlertOtherSuspectsInTeam_Blueprint
	 */
	struct AAIFactionManager_AlertOtherSuspectsInTeam_Blueprint_Params
	{
	public:
		class ASuspectCharacter*                                   Suspect;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AReadyOrNotCharacter*                                Enemy;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISafeZone.OnOverlapEnd
	 */
	struct AAISafeZone_OnOverlapEnd_Params
	{
	public:
		class AActor*                                              OverlappedActor;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISafeZone.OnOverlapBegin
	 */
	struct AAISafeZone_OnOverlapBegin_Params
	{
	public:
		class AActor*                                              OverlappedActor;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISpawn.TransferSpawnDataToRosterSpawnData
	 */
	struct AAISpawn_TransferSpawnDataToRosterSpawnData_Params
	{	};

	/**
	 * Function ReadyOrNot.AISpawn.GetSuspectSpawnData
	 */
	struct AAISpawn_GetSuspectSpawnData_Params
	{
	public:
		TArray<struct FSpawnData>                                  OutSpawnData;                                            // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISpawn.GetSpawningTeamType
	 */
	struct AAISpawn_GetSpawningTeamType_Params
	{
	public:
		struct FSpawnData                                          Sd;                                                      // 0x0000(0x00B8)  (Parm, NativeAccessSpecifierPublic)
		ETeamType                                                  ReturnValue;                                             // 0x00B8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISpawn.GetSpawnedCharacterDeffered
	 */
	struct AAISpawn_GetSpawnedCharacterDeffered_Params
	{
	public:
		class ACyberneticCharacter*                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISpawn.GetDefaultSpawningTeamType
	 */
	struct AAISpawn_GetDefaultSpawningTeamType_Params
	{
	public:
		ETeamType                                                  ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISpawn.GetCivilianSpawnData
	 */
	struct AAISpawn_GetCivilianSpawnData_Params
	{
	public:
		TArray<struct FSpawnData>                                  OutSpawnData;                                            // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AISpawn.DoSpawn
	 */
	struct AAISpawn_DoSpawn_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AITest.Investigate
	 */
	struct AAITest_Investigate_Params
	{	};

	/**
	 * Function ReadyOrNot.AITest.DestroyTestCharacter
	 */
	struct AAITest_DestroyTestCharacter_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.UpdatePreviousResource
	 */
	struct UResourceComponent_UpdatePreviousResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.ToggleUnlimitedResource
	 */
	struct UResourceComponent_ToggleUnlimitedResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.SetUnlimitedResource
	 */
	struct UResourceComponent_SetUnlimitedResource_Params
	{
	public:
		bool                                                       bEnabled;                                                // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.SetResource
	 */
	struct UResourceComponent_SetResource_Params
	{
	public:
		float                                                      NewResourceAmount;                                       // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.SetMaxResource
	 */
	struct UResourceComponent_SetMaxResource_Params
	{
	public:
		float                                                      NewMaxResource;                                          // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.SetCurrentResourceToMax
	 */
	struct UResourceComponent_SetCurrentResourceToMax_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_UpdatePreviousResource
	 */
	struct UResourceComponent_Server_UpdatePreviousResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_ToggleUnlimitedResource
	 */
	struct UResourceComponent_Server_ToggleUnlimitedResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_SetUnlimitedResource
	 */
	struct UResourceComponent_Server_SetUnlimitedResource_Params
	{
	public:
		bool                                                       bEnabled;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_SetResource
	 */
	struct UResourceComponent_Server_SetResource_Params
	{
	public:
		float                                                      NewResourceAmount;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_SetMaxResource
	 */
	struct UResourceComponent_Server_SetMaxResource_Params
	{
	public:
		float                                                      NewMaxResource;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_SetCurrentResourceToMax
	 */
	struct UResourceComponent_Server_SetCurrentResourceToMax_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_ResetResource
	 */
	struct UResourceComponent_Server_ResetResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_InitResource
	 */
	struct UResourceComponent_Server_InitResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_IncreaseResource
	 */
	struct UResourceComponent_Server_IncreaseResource_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_EnableUnlimitedResource
	 */
	struct UResourceComponent_Server_EnableUnlimitedResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_DisableUnlimitedResource
	 */
	struct UResourceComponent_Server_DisableUnlimitedResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_DepleteResource
	 */
	struct UResourceComponent_Server_DepleteResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.Server_DecreaseResource
	 */
	struct UResourceComponent_Server_DecreaseResource_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.ResetResource
	 */
	struct UResourceComponent_ResetResource_Params
	{	};

	/**
	 * DelegateFunction ReadyOrNot.ResourceComponent.OnLowResourceSignature__DelegateSignature
	 */
	struct UResourceComponent_OnLowResourceSignature__DelegateSignature_Params
	{
	public:
		float                                                      Resource;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction ReadyOrNot.ResourceComponent.OnFullResourceSignature__DelegateSignature
	 */
	struct UResourceComponent_OnFullResourceSignature__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction ReadyOrNot.ResourceComponent.OnDepletedResourceSignature__DelegateSignature
	 */
	struct UResourceComponent_OnDepletedResourceSignature__DelegateSignature_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsUnlimitedResourceEnabled
	 */
	struct UResourceComponent_IsUnlimitedResourceEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsResourceBelow
	 */
	struct UResourceComponent_IsResourceBelow_Params
	{
	public:
		float                                                      ResourceValue;                                           // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsResourceAtOrBelow
	 */
	struct UResourceComponent_IsResourceAtOrBelow_Params
	{
	public:
		float                                                      ResourceValue;                                           // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsResourceAtOrAbove
	 */
	struct UResourceComponent_IsResourceAtOrAbove_Params
	{
	public:
		float                                                      ResourceValue;                                           // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsResourceAt
	 */
	struct UResourceComponent_IsResourceAt_Params
	{
	public:
		float                                                      ResourceValue;                                           // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsResourceAbove
	 */
	struct UResourceComponent_IsResourceAbove_Params
	{
	public:
		float                                                      ResourceValue;                                           // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsLowResource
	 */
	struct UResourceComponent_IsLowResource_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsHalfResource
	 */
	struct UResourceComponent_IsHalfResource_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsFullResource
	 */
	struct UResourceComponent_IsFullResource_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IsDepleted
	 */
	struct UResourceComponent_IsDepleted_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IncreaseResourceByRate
	 */
	struct UResourceComponent_IncreaseResourceByRate_Params
	{
	public:
		float                                                      Rate;                                                    // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IncreaseResource_Expression
	 */
	struct UResourceComponent_IncreaseResource_Expression_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.IncreaseResource
	 */
	struct UResourceComponent_IncreaseResource_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.HasResource
	 */
	struct UResourceComponent_HasResource_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetResourceName
	 */
	struct UResourceComponent_GetResourceName_Params
	{
	public:
		class FName                                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetPreviousResource
	 */
	struct UResourceComponent_GetPreviousResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetOriginalMaxResource
	 */
	struct UResourceComponent_GetOriginalMaxResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetNormalizedResource
	 */
	struct UResourceComponent_GetNormalizedResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetMaxResource
	 */
	struct UResourceComponent_GetMaxResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetLowResourceThreshold
	 */
	struct UResourceComponent_GetLowResourceThreshold_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetLowResource
	 */
	struct UResourceComponent_GetLowResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetHalfResource
	 */
	struct UResourceComponent_GetHalfResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.GetCurrentResource
	 */
	struct UResourceComponent_GetCurrentResource_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.EnableUnlimitedResource
	 */
	struct UResourceComponent_EnableUnlimitedResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.DisableUnlimitedResource
	 */
	struct UResourceComponent_DisableUnlimitedResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.DepleteResource
	 */
	struct UResourceComponent_DepleteResource_Params
	{	};

	/**
	 * Function ReadyOrNot.ResourceComponent.DecreaseResourceByRate
	 */
	struct UResourceComponent_DecreaseResourceByRate_Params
	{
	public:
		float                                                      Rate;                                                    // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.DecreaseResource_Expression
	 */
	struct UResourceComponent_DecreaseResource_Expression_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.ResourceComponent.DecreaseResource
	 */
	struct UResourceComponent_DecreaseResource_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AmmoComponent.GetAmmoUsagePerSecond
	 */
	struct UAmmoComponent_GetAmmoUsagePerSecond_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AnimatedDecal.SetAnimatedDecalMaterial
	 */
	struct AAnimatedDecal_SetAnimatedDecalMaterial_Params
	{
	public:
		class UMaterialInterface*                                  Material;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ReadyOrNot.AnimatedDecal.GetRuntimeFloatCurveValue
	 */
	struct AAnimatedDecal_GetRuntimeFloatCurveValue_Params
	{
	public:
		struct FRuntimeFloatCurve                                  Curve;                                                   // 0x0000(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		float                                                      Time;                                                    // 0x0088(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
