#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.OnRep_FrameMetalWorldTransform
	 */
	struct ASlidingLock_Operatable__BP_C_OnRep_FrameMetalWorldTransform_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.OnRep_FrameMetalTransform
	 */
	struct ASlidingLock_Operatable__BP_C_OnRep_FrameMetalTransform_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.RestorePhysicsComponentsSnapshot
	 */
	struct ASlidingLock_Operatable__BP_C_RestorePhysicsComponentsSnapshot_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.TakePhysicsComponentsSnapshot
	 */
	struct ASlidingLock_Operatable__BP_C_TakePhysicsComponentsSnapshot_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.BP_OverrideEditorCompTranform
	 */
	struct ASlidingLock_Operatable__BP_C_BP_OverrideEditorCompTranform_Params
	{
	public:
		class FName                                                compName;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bLocked;                                                 // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_HV5I[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          Transform;                                               // 0x0010(0x0030)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
		struct FTransform                                          ReturnValue;                                             // 0x0040(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.UserConstructionScript
	 */
	struct ASlidingLock_Operatable__BP_C_UserConstructionScript_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.ReceiveBeginPlay
	 */
	struct ASlidingLock_Operatable__BP_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.OnSetup
	 */
	struct ASlidingLock_Operatable__BP_C_OnSetup_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.BP_OnLock
	 */
	struct ASlidingLock_Operatable__BP_C_BP_OnLock_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.BP_OnUnlock
	 */
	struct ASlidingLock_Operatable__BP_C_BP_OnUnlock_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.BndEvt__Damageable_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature
	 */
	struct ASlidingLock_Operatable__BP_C_BndEvt__Damageable_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature_Params
	{
	public:
		class URBDamageableComponent*                              DamageableComponent;                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.Event_SnapToState
	 */
	struct ASlidingLock_Operatable__BP_C_Event_SnapToState_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.Event_OnResetStage
	 */
	struct ASlidingLock_Operatable__BP_C_Event_OnResetStage_Params
	{	};

	/**
	 * Function SlidingLock-Operatable-01_BP.SlidingLock-Operatable-01_BP_C.ExecuteUbergraph_SlidingLock-Operatable-01_BP
	 */
	struct ASlidingLock_Operatable__BP_C_ExecuteUbergraph_SlidingLock_Operatable__BP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_F0LL[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
