#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.SetHovered
	 */
	struct USocialMenu_PartyOption_C_SetHovered_Params
	{
	public:
		bool                                                       bInHovered;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_BO8U[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.SetValue
	 */
	struct USocialMenu_PartyOption_C_SetValue_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.SetEnabled
	 */
	struct USocialMenu_PartyOption_C_SetEnabled_Params
	{
	public:
		bool                                                       bInEnabled;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.Setup
	 */
	struct USocialMenu_PartyOption_C_Setup_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.PreConstruct
	 */
	struct USocialMenu_PartyOption_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__PreviousValueButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__PreviousValueButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__NextValueButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__NextValueButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__SocialMenu_PartyOption_PreviousValueButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__SocialMenu_PartyOption_PreviousValueButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__SocialMenu_PartyOption_NextValueButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__SocialMenu_PartyOption_NextValueButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.ExecuteUbergraph_SocialMenu_PartyOption
	 */
	struct USocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.OnValueUpdated__DelegateSignature
	 */
	struct USocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
