#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * BlueprintGeneratedClass TestGateWagon_01.TestGateWagon-01_C
	 * Size -> 0x0AE8 (FullSize[0x0D40] - InheritedSize[0x0258])
	 */
	class ATestGateWagon__C : public ARBLevelScriptActor
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x0258(0x0008) ZeroConstructor, Transient, DuplicateTransient
		float                                                      Timeline_3_NewTrack_0_580011104A2C46422E17D6A01AC5CCE8;  // 0x0260(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         Timeline_3__Direction_580011104A2C46422E17D6A01AC5CCE8;  // 0x0264(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_EH6Q[0x3];                                   // 0x0265(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  Timeline_4;                                              // 0x0268(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      Timeline_2_NewTrack_0_5CAB98CE434DB76396D18E8742E82D91;  // 0x0270(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         Timeline_2__Direction_5CAB98CE434DB76396D18E8742E82D91;  // 0x0274(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_WRIZ[0x3];                                   // 0x0275(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  Timeline_3;                                              // 0x0278(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      Timeline_1_NewTrack_0_F21E72B847CEDA8674C169B55B36FCF8;  // 0x0280(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         Timeline_1__Direction_F21E72B847CEDA8674C169B55B36FCF8;  // 0x0284(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_1VD3[0x3];                                   // 0x0285(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  Timeline_2;                                              // 0x0288(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      ShakingCablesTimeline_NewTrack_0_003C118546332022DAB9B2BD9BB306DC; // 0x0290(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         ShakingCablesTimeline__Direction_003C118546332022DAB9B2BD9BB306DC; // 0x0294(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_XEJA[0x3];                                   // 0x0295(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  ShakingCablesTimeline;                                   // 0x0298(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      Timeline_0_NewTrack_0_55C762554C82F09849B411A87CA70CD5;  // 0x02A0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         Timeline_0__Direction_55C762554C82F09849B411A87CA70CD5;  // 0x02A4(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_XD8I[0x3];                                   // 0x02A5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  Timeline_1;                                              // 0x02A8(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      FlickeringTimeline_NewTrack_0_231E7B494A9D13BACBBA1E8CEF7A386E; // 0x02B0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         FlickeringTimeline__Direction_231E7B494A9D13BACBBA1E8CEF7A386E; // 0x02B4(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_SQIJ[0x3];                                   // 0x02B5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  FlickeringTimeline;                                      // 0x02B8(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      StopTimeline_NewTrack_0_CC26ABF642D32909179CBABBB2A238EF; // 0x02C0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ETimelineDirection                                         StopTimeline__Direction_CC26ABF642D32909179CBABBB2A238EF; // 0x02C4(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_8GOW[0x3];                                   // 0x02C5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTimelineComponent*                                  StopTimeline;                                            // 0x02C8(0x0008) BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             StartingStationInitialPos;                               // 0x02D0(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             StartingStationEndPos;                                   // 0x02DC(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FCameraShakeData                                    EaseInCamShakeData;                                      // 0x02E8(0x00A0) Edit, BlueprintVisible, NoDestructor
		struct FCameraShakeData                                    Shake_DataContinousCamShakeData;                         // 0x0388(0x00A0) Edit, BlueprintVisible, NoDestructor
		struct FCameraShakeData                                    Shake_DataBumpsCamShakeData;                             // 0x0428(0x00A0) Edit, BlueprintVisible, NoDestructor
		struct FCameraShakeData                                    EaseOutCamShakeData;                                     // 0x04C8(0x00A0) Edit, BlueprintVisible, NoDestructor
		bool                                                       ShakeLoopsActive;                                        // 0x0568(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_M1XR[0x3];                                   // 0x0569(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             ArrivingStationInitialPos;                               // 0x056C(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             ArrivingStationEndPos;                                   // 0x0578(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_NUPH[0x4];                                   // 0x0584(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCameraShakeData                                    DeAnchoringCamShakeData;                                 // 0x0588(0x00A0) Edit, BlueprintVisible, NoDestructor
		float                                                      LightFlickeringIntensity;                                // 0x0628(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_ASR8[0x4];                                   // 0x062C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class ASAS_TanglingCable__BP_C*>                    TanglingCables;                                          // 0x0630(0x0010) Edit, BlueprintVisible, DisableEditOnTemplate
		struct FPostProcessSettings                                Settings;                                                // 0x0640(0x05C0) Edit, BlueprintVisible, DisableEditOnInstance
		class ASASChair_BP_C*                                      Chair;                                                   // 0x0C00(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinTimeBeforeStoppingTrain;                              // 0x0C08(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      StartTrainTimeStamp;                                     // 0x0C0C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       DrugSequenceStarted;                                     // 0x0C10(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_0940[0x7];                                   // 0x0C11(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FNarrativeScreenAnimationData                       PleaseSitAnimationDAta;                                  // 0x0C18(0x0018) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor
		bool                                                       IsTutorialStage;                                         // 0x0C30(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3K3C[0x7];                                   // 0x0C31(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UMovieSceneSequencePlayer*                           Target;                                                  // 0x0C38(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EEndPlayReason                                             End_Play_Reason;                                         // 0x0C40(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_L1W9[0x3];                                   // 0x0C41(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Time;                                                    // 0x0C44(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FNarrativeScreenAnimationData                       EndScreenLogo;                                           // 0x0C48(0x0018) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor
		class ARBSAS*                                              currentSAS;                                              // 0x0C60(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              DrugPost[0x28];                                          // 0x0C68(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		TArray<struct FLinearColor>                                LightColor;                                              // 0x0C90(0x0010) Edit, BlueprintVisible, DisableEditOnInstance
		class UPostProcessComponent*                               NewPP;                                                   // 0x0CA0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class ATrainStationSign__BP_C*>                     DestinationSigns;                                        // 0x0CA8(0x0010) Edit, BlueprintVisible, DisableEditOnTemplate
		TArray<class ARBLight_BP_C*>                               FluorescentArray;                                        // 0x0CB8(0x0010) Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance
		TArray<class ASpotLight*>                                  SpotLightArray;                                          // 0x0CC8(0x0010) Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance
		unsigned char                                              WagonWindows[0x10];                                      // 0x0CD8(0x0010) UNKNOWN PROPERTY: ArrayProperty
		class ASasDoor__BP1_C*                                     SasDoorEntrance_ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0CE8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ASasDoor__BP1_C*                                     SasDoorExit_ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0CF0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ACeilingFluorescent__C*                              CeilingFluorescent__ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0CF8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ATestGateMovingBackground__BP_C*                     ArrivingStationAnchor__ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0D00(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ACeilingFluorescent__C*                              CeilingFluorescent__ExecuteUbergraph_TestGateWagon__RefProperty2; // 0x0D08(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ATestGateMovingBackground__BP_C*                     TestGateMovingBackground__BP_5_ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0D10(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ASAS_TvChannel_BP_C*                                 SAS_Default_TvChannel_BP_ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0D18(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AEmitter*                                            DrugSpray__PS_ExecuteUbergraph_TestGateWagon__RefProperty; // 0x0D20(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AEmitter*                                            DrugSpray__PS_ExecuteUbergraph_TestGateWagon__RefProperty2; // 0x0D28(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ASAS_TvChannel_BP_C*                                 SAS_Default_TvChannel_BP_EdGraph_3_RefProperty;          // 0x0D30(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class ASAS_TvChannel_BP_C*                                 SAS_Default_TvChannel_BP_EdGraph_7_RefProperty;          // 0x0D38(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash

	public:
		void GetLight();
		void SetDestinationSignsText(const class FText& Text);
		void SetAllTVsWithInteractibleUI();
		void ForceAllTvUp(bool ForceUP);
		void CanPlayIntroAnim(bool* Value);
		void SetAllTVsON(bool IsOn);
		void PlayAnimationOnAllTVs(const struct FNarrativeScreenAnimationData& animData);
		void GetLocalPlayerChairPanel(class URBSASChairPanelComponent** Chair);
		void ForcePlayersOutOfChairs();
		void UpdateSASDoorText(const struct FRBStageID& StageID, class ASasDoor__BP1_C* door);
		void StopTimeline__FinishedFunc();
		void StopTimeline__UpdateFunc();
		void FlickeringTimeline__FinishedFunc();
		void FlickeringTimeline__UpdateFunc();
		void Timeline_0__FinishedFunc();
		void Timeline_0__UpdateFunc();
		void ShakingCablesTimeline__FinishedFunc();
		void ShakingCablesTimeline__UpdateFunc();
		void Timeline_1__FinishedFunc();
		void Timeline_1__UpdateFunc();
		void Timeline_2__FinishedFunc();
		void Timeline_2__UpdateFunc();
		void Timeline_3__FinishedFunc();
		void Timeline_3__UpdateFunc();
		void bpiBlurEntity();
		void UpdateSASTexts();
		void StartTrain(bool ToLobby);
		void StopTrain();
		void ReceiveBeginPlay();
		void StartTrainNoDelay();
		void CameraShakeTrainRideContinuous();
		void StartFlickeringLights();
		void BrakingFlickeringLights();
		void SetCableShakeFadeIn();
		void SetCableShakeFadeOut();
		void MoveAwayFromLobby();
		void ArriveToLobby();
		void MoveAwayFromMission();
		void ArriveToMission();
		void EnableLight();
		void OnGamePhaseUpdated(EGamePhase gamePhase);
		void OnGameStageInfoChanged(const struct FRBGameStageInfo& gameStageInfo);
		void TryStopTrain();
		void StartIntroSequence();
		void ForceTvUp();
		void DisableLight();
		void ReceiveEndPlay(EEndPlayReason EndPlayReason);
		void Start_Narrative_Fail_Music();
		void OnIntroAnimationFinished();
		void StopDrugSpray();
		void StartDrugSpray();
		void PrintMovieDebug();
		void UpdateSAS();
		void OnCurrentSasChanged(class ARBSAS* oldSAS, class ARBSAS* currentSAS);
		void OnSASStateChnagedCallback(ESASState State);
		void CloseLight();
		void OnTutorialIntroFinished();
		void ExecuteUbergraph_TestGateWagon(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
