#pragma once

/**
 * Name: TRIALS
 * Version: FINAL
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass TimerCountdown_01_ABP.TimerCountdown-01_ABP_C
	 * Size -> 0x0D98 (FullSize[0x1050] - InheritedSize[0x02B8])
	 */
	class UTimerCountdown__ABP_C : public UAnimInstance
	{
	public:
		unsigned char                                              UnknownData_LNC0[0x8];                                   // 0x02B8(0x0008) Fix Super Size
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x02C0(0x0008) ZeroConstructor, Transient, DuplicateTransient
		struct FAnimNode_Root                                      AnimGraphNode_Root;                                      // 0x02C8(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_31;                       // 0x02F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_30;                       // 0x0320(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_29;                       // 0x0348(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_28;                       // 0x0370(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_27;                       // 0x0398(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_26;                       // 0x03C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_25;                       // 0x03E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_24;                       // 0x0410(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_23;                       // 0x0438(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_22;                       // 0x0460(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_21;                       // 0x0488(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_20;                       // 0x04B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_19;                       // 0x04D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_18;                       // 0x0500(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_17;                       // 0x0528(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_16;                       // 0x0550(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_15;                       // 0x0578(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14;                       // 0x05A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_13;                       // 0x05C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_12;                       // 0x05F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11;                       // 0x0618(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_10;                       // 0x0640(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9;                        // 0x0668(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8;                        // 0x0690(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7;                        // 0x06B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6;                        // 0x06E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5;                        // 0x0708(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4;                        // 0x0730(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3;                        // 0x0758(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2;                        // 0x0780(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult;                          // 0x07A8(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10;                         // 0x07D0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_11;                            // 0x0850(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9;                          // 0x0880(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_10;                            // 0x0900(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8;                          // 0x0930(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_9;                             // 0x09B0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7;                          // 0x09E0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_8;                             // 0x0A60(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6;                          // 0x0A90(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_7;                             // 0x0B10(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5;                          // 0x0B40(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_6;                             // 0x0BC0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4;                          // 0x0BF0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_5;                             // 0x0C70(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3;                          // 0x0CA0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_4;                             // 0x0D20(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2;                          // 0x0D50(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_3;                             // 0x0DD0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer;                            // 0x0E00(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_2;                             // 0x0E80(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_2;                            // 0x0EB0(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult;                               // 0x0F60(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine;                              // 0x0F90(0x00B0)
		int32_t                                                    Time;                                                    // 0x1040(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_HETW[0x4];                                   // 0x1044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkAudioEvent*                                       SFX_Event;                                               // 0x1048(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash

	public:
		void AnimGraph(struct FPoseLink* AnimGraph);
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_51A047A94FE1B47C5C4DC384A424CEFC();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_BEC810534DA28C70FC3C7DBE5BAD8FF5();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_C6B77F944C2D16DD4EA3D6806C0D746B();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_5BFBD1254733669A2A7E849DB0A871AB();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_1DC6D4434C431E560DFB0DB99BE2EF19();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_F92A34EA4DCE84F8DC3A68944862ACA0();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_DB09FA434318BA3EE5A72CBC43DE8914();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_F80D6962414A44D0AA1B5E8A8CA300BD();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_F995637C44C1DD0A22DEB284E068B0CA();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_40393A39468E812E126B9290E7A92275();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_AEA28D3F45413EE498935F87527515EB();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_EC31407947212FE1C3E7058981726766();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_CCAA23DB46604B7FC97B3D952C5D4D6C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_90443B544B1C495AC44E0B9A3A1336AD();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_1466F7C74CA3D977A1F4948646110981();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_2CE354274348640F851330B2AE37F795();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_25AC93054F8059036A34B7985711E1BF();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_348075954602FFD37B27DD87FF104368();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_A4EA1B624CA0BF5C405935A1AA728177();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_9BDD110B4E1DFBA2EC086E8766F2EE04();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_1260A76D473C4D123186868FCC44ECFA();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_146058724EF34B11D7C5BF877988FCC7();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_C6747BF147324CF29E6505B0C6DDF389();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_2DCF401C40DAF80EF93724A833A78DFE();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_4B7E2C054A68F9EB9B3F41B43B267FAC();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_0CCE794B4AD89FE9A737FCA16D2CE11B();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_7203C8A3484490A6C3998A817CC8AD17();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_8CC5DD9D47716ED4E3C1CC864B8A317C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_1FAFB4AF4C37575189B7799A2401F7F3();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TimerCountdown__ABP_AnimGraphNode_TransitionResult_A60253754E2152CC889F498659801ED8();
		void AnimNotify_NumberChanged();
		void ExecuteUbergraph_TimerCountdown__ABP(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
