#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.SequenceEvent__ENTRYPOINTW_Briefing_AudioControls_Button_2
	 */
	struct UW_Briefing_AudioControls_Button_C_SequenceEvent__ENTRYPOINTW_Briefing_AudioControls_Button_2_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.SequenceEvent__ENTRYPOINTW_Briefing_AudioControls_Button_1
	 */
	struct UW_Briefing_AudioControls_Button_C_SequenceEvent__ENTRYPOINTW_Briefing_AudioControls_Button_1_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.SetHovered
	 */
	struct UW_Briefing_AudioControls_Button_C_SetHovered_Params
	{
	public:
		bool                                                       IsHovered;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.SetActive
	 */
	struct UW_Briefing_AudioControls_Button_C_SetActive_Params
	{
	public:
		bool                                                       IsActive;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.AnimateHover
	 */
	struct UW_Briefing_AudioControls_Button_C_AnimateHover_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.BndEvt__btn_Play_K2Node_ComponentBoundEvent_3_Pressed__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_BndEvt__btn_Play_K2Node_ComponentBoundEvent_3_Pressed__DelegateSignature_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.BndEvt__btn_Play_K2Node_ComponentBoundEvent_4_Released__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_BndEvt__btn_Play_K2Node_ComponentBoundEvent_4_Released__DelegateSignature_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.BndEvt__btn_Play_K2Node_ComponentBoundEvent_2_Unhovered__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_BndEvt__btn_Play_K2Node_ComponentBoundEvent_2_Unhovered__DelegateSignature_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.HoverAnim
	 */
	struct UW_Briefing_AudioControls_Button_C_HoverAnim_Params
	{
	public:
		float                                                      Duration;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       Reverse;                                                 // 0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_ZZWD[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      FPS;                                                     // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.BndEvt__btn_Play_K2Node_ComponentBoundEvent_1_Hovered__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_BndEvt__btn_Play_K2Node_ComponentBoundEvent_1_Hovered__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.BndEvt__btn_Play_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_BndEvt__btn_Play_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.PreConstruct
	 */
	struct UW_Briefing_AudioControls_Button_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.ExecuteUbergraph_W_Briefing_AudioControls_Button
	 */
	struct UW_Briefing_AudioControls_Button_C_ExecuteUbergraph_W_Briefing_AudioControls_Button_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.AudioControlButtonHovered__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_AudioControlButtonHovered__DelegateSignature_Params
	{
	public:
		class UW_Briefing_AudioControls_Button_C*                  Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       Hovered;                                                 // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.AudioControlButtonReleased__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_AudioControlButtonReleased__DelegateSignature_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.AudioControlButtonPressed__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_AudioControlButtonPressed__DelegateSignature_Params
	{	};

	/**
	 * Function W_Briefing_AudioControls_Button.W_Briefing_AudioControls_Button_C.AudioControlButtonClicked__DelegateSignature
	 */
	struct UW_Briefing_AudioControls_Button_C_AudioControlButtonClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
