#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.SequenceEvent__ENTRYPOINTW_MissionEnd_RatingScoreEntry_2
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_SequenceEvent__ENTRYPOINTW_MissionEnd_RatingScoreEntry_2_Params
	{
	public:
		class UObject*                                             Event_Receiver;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.SequenceEvent__ENTRYPOINTW_MissionEnd_RatingScoreEntry_1
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_SequenceEvent__ENTRYPOINTW_MissionEnd_RatingScoreEntry_1_Params
	{	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.Finished_0849F9E54A775090B38983909C2585B3
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_Finished_0849F9E54A775090B38983909C2585B3_Params
	{	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.numberSound
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_numberSound_Params
	{
	public:
		class UObject*                                             Event_Receiver;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.PreConstruct
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.Construct
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_Construct_Params
	{	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.revealSound
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_revealSound_Params
	{	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.ExecuteUbergraph_W_MissionEnd_RatingScoreEntry
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_ExecuteUbergraph_W_MissionEnd_RatingScoreEntry_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_MissionEnd_RatingScoreEntry.W_MissionEnd_RatingScoreEntry_C.ScoreEntryReady__DelegateSignature
	 */
	struct UW_MissionEnd_RatingScoreEntry_C_ScoreEntryReady__DelegateSignature_Params
	{
	public:
		class UW_MissionEnd_RatingScoreEntry_C*                    EntryWidget;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    Score;                                                   // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
