#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.OnErrorSet
	 */
	struct UW_ModAuthenticationDialog_C_OnErrorSet_Params
	{
	public:
		class FString                                              ErrorMessage;                                            // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_EditableTextBox_95_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_EditableTextBox_95_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		ETextCommit                                                CommitMethod;                                            // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_W_Button_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_W_Button_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.OnEmailRequested
	 */
	struct UW_ModAuthenticationDialog_C_OnEmailRequested_Params
	{	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.OnSecurityCodeRequested
	 */
	struct UW_ModAuthenticationDialog_C_OnSecurityCodeRequested_Params
	{	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_W_Button_2_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_W_Button_2_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_W_Button_3_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_W_Button_3_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_SecurityCodeSubmitButton_K2Node_ComponentBoundEvent_6_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_SecurityCodeSubmitButton_K2Node_ComponentBoundEvent_6_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_SecurityCodeEntryBox_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_SecurityCodeEntryBox_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature_Params
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		ETextCommit                                                CommitMethod;                                            // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_EmailLogin_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_EmailLogin_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_SteamLogin_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_SteamLogin_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.Construct
	 */
	struct UW_ModAuthenticationDialog_C_Construct_Params
	{	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.PreConstruct
	 */
	struct UW_ModAuthenticationDialog_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.OnTermsOfUseAcceptanceRequested
	 */
	struct UW_ModAuthenticationDialog_C_OnTermsOfUseAcceptanceRequested_Params
	{
	public:
		class FString                                              Terms;                                                   // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		struct FTermsOfUse                                         Localization;                                            // 0x0010(0x00D0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_SteamDecline_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_SteamDecline_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_CancelLogin_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_CancelLogin_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.ReturnToMethodSelect
	 */
	struct UW_ModAuthenticationDialog_C_ReturnToMethodSelect_Params
	{	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_SteamAgree_K2Node_ComponentBoundEvent_10_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_SteamAgree_K2Node_ComponentBoundEvent_10_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_ModioPrivacy_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_ModioPrivacy_K2Node_ComponentBoundEvent_11_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.BndEvt__W_ModAuthenticationDialog_btn_ModioTerms_K2Node_ComponentBoundEvent_12_Clicked__DelegateSignature
	 */
	struct UW_ModAuthenticationDialog_C_BndEvt__W_ModAuthenticationDialog_btn_ModioTerms_K2Node_ComponentBoundEvent_12_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_ModAuthenticationDialog.W_ModAuthenticationDialog_C.ExecuteUbergraph_W_ModAuthenticationDialog
	 */
	struct UW_ModAuthenticationDialog_C_ExecuteUbergraph_W_ModAuthenticationDialog_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_21V3[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
