#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.SetSelected
	 */
	struct UW_PlanningMap_BreachPoint_C_SetSelected_Params
	{
	public:
		bool                                                       Selected;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.Construct
	 */
	struct UW_PlanningMap_BreachPoint_C_Construct_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.FadeIn
	 */
	struct UW_PlanningMap_BreachPoint_C_FadeIn_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.FadeOut
	 */
	struct UW_PlanningMap_BreachPoint_C_FadeOut_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.BndEvt__btn_BreachPoint_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_C_BndEvt__btn_BreachPoint_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.BndEvt__btn_BreachPoint_K2Node_ComponentBoundEvent_1_Hovered__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_C_BndEvt__btn_BreachPoint_K2Node_ComponentBoundEvent_1_Hovered__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.ExecuteUbergraph_W_PlanningMap_BreachPoint
	 */
	struct UW_PlanningMap_BreachPoint_C_ExecuteUbergraph_W_PlanningMap_BreachPoint_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.OnBreachPointClicked__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_C_OnBreachPointClicked__DelegateSignature_Params
	{
	public:
		class UW_PlanningMap_BreachPoint_C*                        ClickedPoint;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint.W_PlanningMap_BreachPoint_C.OnBreachPointHovered__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_C_OnBreachPointHovered__DelegateSignature_Params
	{
	public:
		class UW_PlanningMap_BreachPoint_C*                        HoveredPoint;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
