#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.OnLoaded_0AA3E177468D68E03944E59A03A2CFB4
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_OnLoaded_0AA3E177468D68E03944E59A03A2CFB4_Params
	{
	public:
		class UObject*                                             Loaded;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.Construct
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_Construct_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.BndEvt__W_Button_K2Node_ComponentBoundEvent_0_Hovered__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_BndEvt__W_Button_K2Node_ComponentBoundEvent_0_Hovered__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.BndEvt__W_Button_K2Node_ComponentBoundEvent_1_Unhovered__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_BndEvt__W_Button_K2Node_ComponentBoundEvent_1_Unhovered__DelegateSignature_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.BndEvt__W_Button_K2Node_ComponentBoundEvent_2_Pressed__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_BndEvt__W_Button_K2Node_ComponentBoundEvent_2_Pressed__DelegateSignature_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.BndEvt__W_Button_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_BndEvt__W_Button_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.BndEvt__W_Button_K2Node_ComponentBoundEvent_4_Released__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_BndEvt__W_Button_K2Node_ComponentBoundEvent_4_Released__DelegateSignature_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.ExecuteUbergraph_W_PlanningMap_BreachPoint_Info_EquipmentEntry
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_ExecuteUbergraph_W_PlanningMap_BreachPoint_Info_EquipmentEntry_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_VA14[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info_EquipmentEntry.W_PlanningMap_BreachPoint_Info_EquipmentEntry_C.OnClicked__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_EquipmentEntry_C_OnClicked__DelegateSignature_Params
	{
	public:
		struct FLevelDeployableData                                DeployableData;                                          // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
