#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.SetRecommendedDeployables
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_SetRecommendedDeployables_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.SetDesignationText
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_SetDesignationText_Params
	{
	public:
		int32_t                                                    SpawnIndex;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.Finished_B45778B942FC16674AB7A3BD06E9C36E
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_Finished_B45778B942FC16674AB7A3BD06E9C36E_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.Finished_186E628046C415504DDD34A0079F53C5
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_Finished_186E628046C415504DDD34A0079F53C5_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.BndEvt__btn_ClickAway_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_BndEvt__btn_ClickAway_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.BndEvt__btn_SelectPoint_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_BndEvt__btn_SelectPoint_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.SetActiveSpawn
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_SetActiveSpawn_Params
	{
	public:
		struct FSpawnPoints                                        SpawnInfo;                                               // 0x0000(0x0090)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.UpdateInfo
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_UpdateInfo_Params
	{
	public:
		struct FSpawnPoints                                        SpawnInfo;                                               // 0x0000(0x0090)  (BlueprintVisible, BlueprintReadOnly, Parm)
		int32_t                                                    SpawnIndex;                                              // 0x0090(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.RevealPanel
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_RevealPanel_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.HidePanel
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_HidePanel_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.ExecuteUbergraph_W_PlanningMap_BreachPoint_Info
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_ExecuteUbergraph_W_PlanningMap_BreachPoint_Info_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.OnDetailPanelHide__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_OnDetailPanelHide__DelegateSignature_Params
	{	};

	/**
	 * Function W_PlanningMap_BreachPoint_Info.W_PlanningMap_BreachPoint_Info_C.OnSetSpawnButtonClicked__DelegateSignature
	 */
	struct UW_PlanningMap_BreachPoint_Info_C_OnSetSpawnButtonClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
