#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_RequestRestart.W_RequestRestart_C.BndEvt__W_RequestRestart_RestartNowButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
	 */
	struct UW_RequestRestart_C_BndEvt__W_RequestRestart_RestartNowButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_RequestRestart.W_RequestRestart_C.BndEvt__W_RequestRestart_RestartLaterButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature
	 */
	struct UW_RequestRestart_C_BndEvt__W_RequestRestart_RestartLaterButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_RequestRestart.W_RequestRestart_C.BndEvt__W_ModProgressWidget_btn_Restart_K2Node_ComponentBoundEvent_0_Hovered__DelegateSignature
	 */
	struct UW_RequestRestart_C_BndEvt__W_ModProgressWidget_btn_Restart_K2Node_ComponentBoundEvent_0_Hovered__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_RequestRestart.W_RequestRestart_C.BndEvt__W_ModProgressWidget_btn_Restart_K2Node_ComponentBoundEvent_1_Unhovered__DelegateSignature
	 */
	struct UW_RequestRestart_C_BndEvt__W_ModProgressWidget_btn_Restart_K2Node_ComponentBoundEvent_1_Unhovered__DelegateSignature_Params
	{	};

	/**
	 * Function W_RequestRestart.W_RequestRestart_C.BndEvt__W_ModProgressWidget_btn_Restart_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature
	 */
	struct UW_RequestRestart_C_BndEvt__W_ModProgressWidget_btn_Restart_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature_Params
	{
	public:
		class UW_Button_C*                                         Button;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_RequestRestart.W_RequestRestart_C.ExecuteUbergraph_W_RequestRestart
	 */
	struct UW_RequestRestart_C_ExecuteUbergraph_W_RequestRestart_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_BG7F[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
