#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_MoveOverThereText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_MoveOverThereText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_Command_Visibility_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_Command_Visibility_1_Params
	{
	public:
		ESlateVisibility                                           ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ZDF1[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_ReportEvidence_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_ReportEvidence_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_ReportIncapacitated_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_ReportIncapacitated_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_ReportedArrestedText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_ReportedArrestedText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_ReportDeadText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_ReportDeadText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_TOC_Visibility_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_TOC_Visibility_1_Params
	{
	public:
		ESlateVisibility                                           ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_TAC_Visibility_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_TAC_Visibility_1_Params
	{
	public:
		ESlateVisibility                                           ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_ComeHereText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_ComeHereText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_GetOnTheFloorText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_GetOnTheFloorText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_HandsUpText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_HandsUpText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Get_DropTheGunText_ColorAndOpacity_1
	 */
	struct UW_TacticalCommandAuthority_C_Get_DropTheGunText_ColorAndOpacity_1_Params
	{
	public:
		struct FSlateColor                                         ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Construct
	 */
	struct UW_TacticalCommandAuthority_C_Construct_Params
	{	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.Tick
	 */
	struct UW_TacticalCommandAuthority_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function W_TacticalCommandAuthority.W_TacticalCommandAuthority_C.ExecuteUbergraph_W_TacticalCommandAuthority
	 */
	struct UW_TacticalCommandAuthority_C_ExecuteUbergraph_W_TacticalCommandAuthority_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
