#pragma once

/**
 * Name: READYORNOT
 * Version: 0.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamupdateBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamupdateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamupdateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamgetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzTeam                                           Result;                                                  // 0x0000(0x00C8)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamgetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzTeam                                           Result;                                                  // 0x0000(0x00C8)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x00C8(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamdeleteBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamdeleteBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamdeleteBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamcreateBPS__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamcreateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountTeamcreateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountQuotasetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzAccountQuotaInfo                               Result;                                                  // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountQuotasetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountQuotasetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzAccountQuotaInfo                               Result;                                                  // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountQuotagetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzAccountQuotaInfo                               Result;                                                  // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountQuotagetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountQuotagetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzAccountQuotaInfo                               Result;                                                  // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectupdateBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectupdateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectupdateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectsgetBPS__DelegateSignature_Params
	{
	public:
		TArray<struct FZeuzProj>                                   Result;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectsgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectsgetBP__DelegateSignature_Params
	{
	public:
		TArray<struct FZeuzProj>                                   Result;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectgetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzProj                                           Result;                                                  // 0x0000(0x00C8)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectgetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzProj                                           Result;                                                  // 0x0000(0x00C8)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x00C8(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectdeleteBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectdeleteBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectdeleteBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectcreateBPS__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectcreateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountProjectcreateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvupdateBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvupdateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvupdateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvsgetBPS__DelegateSignature_Params
	{
	public:
		TArray<struct FZeuzEnv>                                    Result;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvsgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvsgetBP__DelegateSignature_Params
	{
	public:
		TArray<struct FZeuzEnv>                                    Result;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvserviceupdateBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvserviceupdateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvserviceupdateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvservicedeleteBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvservicedeleteBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvservicedeleteBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvgetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzEnv                                            Result;                                                  // 0x0000(0x00E8)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvgetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzEnv                                            Result;                                                  // 0x0000(0x00E8)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x00E8(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvdeleteBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvdeleteBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvdeleteBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvcreateBPS__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvcreateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountEnvcreateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevquicksetupBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzAccountDevQuickSetupOut                        Result;                                                  // 0x0000(0x0080)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevquicksetupBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevquicksetupBP__DelegateSignature_Params
	{
	public:
		struct FZeuzAccountDevQuickSetupOut                        Result;                                                  // 0x0000(0x0080)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0080(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperupdateBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperupdateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperupdateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopersgetBPS__DelegateSignature_Params
	{
	public:
		TArray<struct FZeuzDeveloper>                              Result;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopersgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopersgetBP__DelegateSignature_Params
	{
	public:
		TArray<struct FZeuzDeveloper>                              Result;                                                  // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopersetpwhashBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzDeveloper                                      Result;                                                  // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopersetpwhashBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopersetpwhashBP__DelegateSignature_Params
	{
	public:
		struct FZeuzDeveloper                                      Result;                                                  // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0120(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperrevokeBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperrevokeBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperrevokeBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetrequestBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetrequestBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetrequestBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperispasswordresethashexpiredBPS__DelegateSignature_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperispasswordresethashexpiredBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperispasswordresethashexpiredBP__DelegateSignature_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_UU0L[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              Error;                                                   // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperinviteBPS__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperinviteBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDeveloperinviteBP__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopergetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzDeveloper                                      Result;                                                  // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopergetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopergetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzDeveloper                                      Result;                                                  // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0120(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopercreatepwhashBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzDeveloper                                      Result;                                                  // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopercreatepwhashBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopercreatepwhashBP__DelegateSignature_Params
	{
	public:
		struct FZeuzDeveloper                                      Result;                                                  // 0x0000(0x0120)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0120(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopercreateBPS__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopercreateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountDevelopercreateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountupdateBPS__DelegateSignature_Params
	{	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountupdateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountupdateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountgetBPS__DelegateSignature_Params
	{
	public:
		struct FZeuzAccount                                        Result;                                                  // 0x0000(0x0168)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountgetBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountgetBP__DelegateSignature_Params
	{
	public:
		struct FZeuzAccount                                        Result;                                                  // 0x0000(0x0168)  (Parm, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0168(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBPS__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountcreateBPS__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBPF__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountcreateBPF__DelegateSignature_Params
	{
	public:
		class FString                                              Error;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBP__DelegateSignature
	 */
	struct UZeuzApiAccount_DelegateAccountAccountcreateBP__DelegateSignature_Params
	{
	public:
		class FString                                              Result;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Error;                                                   // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountTeamupdateBP
	 */
	struct UZeuzApiAccount_AccountTeamupdateBP_Params
	{
	public:
		struct FZeuzTeam                                           In;                                                      // 0x0000(0x00C8)  (Parm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x00C8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x00D8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x00E8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x00F8(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountTeamgetBP
	 */
	struct UZeuzApiAccount_AccountTeamgetBP_Params
	{
	public:
		class FString                                              In;                                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0040(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountTeamdeleteBP
	 */
	struct UZeuzApiAccount_AccountTeamdeleteBP_Params
	{
	public:
		struct FZeuzAccountTeamDeleteIn                            In;                                                      // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0040(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0050(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountTeamcreateBP
	 */
	struct UZeuzApiAccount_AccountTeamcreateBP_Params
	{
	public:
		struct FZeuzAccountTeamCreateIn                            In;                                                      // 0x0000(0x0068)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0068(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0078(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0088(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0098(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountQuotasetBP
	 */
	struct UZeuzApiAccount_AccountQuotasetBP_Params
	{
	public:
		struct FZeuzAccountQuotaInfo                               In;                                                      // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0018(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0028(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0038(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0048(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountQuotagetBP
	 */
	struct UZeuzApiAccount_AccountQuotagetBP_Params
	{
	public:
		class FString                                              In;                                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0040(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountProjectupdateBP
	 */
	struct UZeuzApiAccount_AccountProjectupdateBP_Params
	{
	public:
		struct FZeuzProj                                           In;                                                      // 0x0000(0x00C8)  (Parm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x00C8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x00D8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x00E8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x00F8(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountProjectsgetBP
	 */
	struct UZeuzApiAccount_AccountProjectsgetBP_Params
	{
	public:
		TArray<class FString>                                      In;                                                      // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0040(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountProjectgetBP
	 */
	struct UZeuzApiAccount_AccountProjectgetBP_Params
	{
	public:
		class FString                                              In;                                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0040(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountProjectdeleteBP
	 */
	struct UZeuzApiAccount_AccountProjectdeleteBP_Params
	{
	public:
		struct FZeuzAccountProjectDeleteIn                         In;                                                      // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0040(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0050(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountProjectcreateBP
	 */
	struct UZeuzApiAccount_AccountProjectcreateBP_Params
	{
	public:
		struct FZeuzAccountProjectCreateIn                         In;                                                      // 0x0000(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0058(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0068(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0078(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0088(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountEnvupdateBP
	 */
	struct UZeuzApiAccount_AccountEnvupdateBP_Params
	{
	public:
		struct FZeuzEnv                                            In;                                                      // 0x0000(0x00E8)  (Parm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x00E8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x00F8(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0108(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0118(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountEnvsgetBP
	 */
	struct UZeuzApiAccount_AccountEnvsgetBP_Params
	{
	public:
		TArray<class FString>                                      In;                                                      // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0010(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0020(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0030(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FZeuzContext                                        Ctx;                                                     // 0x0040(0x0098)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Zeuzsdk.ZeuzApiAccount.AccountEnvserviceupdateBP
	 */
	struct UZeuzApiAccount_AccountEnvserviceupdateBP_Params
	{
	public:
		struct FZeuzServiceCfg                                     In;                                                      // 0x0000(0x0038)  (Parm, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      Callback;                                                // 0x0038(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnSuccess;                                               // 0x0048(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		class FScriptDelegate                                      OnFailure;                                               // 0x0058(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
