#pragma once

/**
 * Name: OUTLAST
 * Version: 0.0.2_fixed
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimGraph
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.PlayHandleAnimation
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_PlayHandleAnimation_Params
	{
	public:
		bool                                                       IsWin;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		ETimingInputResultType                                     Result;                                                  // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_VD5T[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.FinishGhost
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_FinishGhost_Params
	{
	public:
		EGhostFinishReason                                         finishReason;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_N7ZI[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    GhostFinishCustomReason;                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.IsGameplayCompleted
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_IsGameplayCompleted_Params
	{
	public:
		bool                                                       completed;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_55BAD8D248767A509558DDBD1732AD8B
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_55BAD8D248767A509558DDBD1732AD8B_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_0C5102BF4E32A86A96A556A054CEB926
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_0C5102BF4E32A86A96A556A054CEB926_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_2D1A56E5492C202037EF1DB46AAA8918
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_2D1A56E5492C202037EF1DB46AAA8918_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_E2DA909E4F537B41E4E99194BBBF9C77
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_E2DA909E4F537B41E4E99194BBBF9C77_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_DB7D910542FD83701E37EC96BEC0952D
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_DB7D910542FD83701E37EC96BEC0952D_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_421E4A2E427270F6B0A212B101BA0F6C
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_421E4A2E427270F6B0A212B101BA0F6C_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_3B5BB8DF40BE74EFC561B3A3985BC47C
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_AnimGraphNode_TransitionResult_3B5BB8DF40BE74EFC561B3A3985BC47C_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.BP_InitializeGhost
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_BP_InitializeGhost_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimNotify_TurnStart
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimNotify_TurnStart_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimNotify_EntryDone
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimNotify_EntryDone_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimNotify_Finished
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimNotify_Finished_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.BP_ClearGhost
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_BP_ClearGhost_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimNotify_EnterHold
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimNotify_EnterHold_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.CustomEvent_1
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_CustomEvent_1_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.Minigame Result
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_MinigameResult_Params
	{
	public:
		class URBZoneTimingPanelComponent*                         panel;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class ARBPlayer*                                           Player;                                                  // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    targetIndex;                                             // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      Timestamp;                                               // 0x0014(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		ETimingInputResultType                                     Result;                                                  // 0x0018(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimNotify_Leave
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimNotify_Leave_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.AnimNotify_Win
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_AnimNotify_Win_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_ExecuteUbergraph_ZoneTimingPanel_GhostAnimBP_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.FinishedComplete__DelegateSignature
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_FinishedComplete__DelegateSignature_Params
	{	};

	/**
	 * Function ZoneTimingPanel_GhostAnimBP.ZoneTimingPanel_GhostAnimBP_C.EntryComplete__DelegateSignature
	 */
	struct UZoneTimingPanel_GhostAnimBP_C_EntryComplete__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
